{
  "id": "AV-EVZITKZqtpbFMSoqc",
  "dateAdded": "2017-11-03T23:17:55Z",
  "name": "All-New Kindle Oasis E-reader - 7 High-Resolution Display (300 ppi), Waterproof, Built-In Audible, 8 GB, Wi-Fi - Includes Special Offers",
  "asins": "B06XD5YCKX",
  "brand": "Amazon",
  "categories": "EBook Readers,Tablets,Electronics,Amazon Ereaders,Kindle E-readers,E-Readers,Featured Brands,E-Readers & Accessories,Amazon Book Reader,Computers & Tablets,Amazon Devices,Amazon,Tablets & E-Readers",
  "primaryCategories": "Electronics",
  "keys": "841667176819,amazon/53051929,amazonkindleoasisereader7highresolutiondisplay300ppiwaterproofbuiltinaudible8gbwifiblacksilver/5999007,amazon/b06xd5yckx,allnewkindleoasisereader7highresolutiondisplay300ppiwaterproofbuiltinaudible8gbwifiincludesspecialoffers/b06xd5yckx,amazon/53006476,amazonkindle7oasisereader8gbwithofferswaterproofwifigraphiteb06xd5yckx/9sia9k87cz6133",
  "manufacturer": "Amazon",
  "reviews": [
    {
      "reviews.date": "2018-04-20T00:00:00.000Z",
      "reviews.id": "39eb1cb2-aaa8-40a8-b22e-db66f3761d1b",
      "reviews.rating": 5,
      "reviews.text": "Love my new kindle!!! I would recommend this to anyone who reads ebooks or has audible."
    },
    {
      "reviews.date": "2018-01-17T00:00:00.000Z",
      "reviews.id": "8c56676b-42fd-4f7d-9670-cb03d6913fc4",
      "reviews.rating": 5,
      "reviews.text": "I got this as gift for my husband and he loves it! Excellent e-reader!"
    },
    {
      "reviews.date": "2018-03-28T00:00:00.000Z",
      "reviews.id": "6f07af16-79de-427f-9244-e4435bbadb6b",
      "reviews.rating": 5,
      "reviews.text": "I owned the Kindle Keyboard, Kindle Paperwhite, and purchased new generation Kindle Oasis recently. It feels much more premium with the aluminium casing than first generation. It is so great!"
    },
    {
      "reviews.date": "2017-12-29T00:00:00.000Z",
      "reviews.id": "5dfb6765-9aa9-48b3-9633-18782ac05048",
      "reviews.rating": 5,
      "reviews.text": "This is the best Kindle out of a long line of Kindles. Amazon improved on all the bad points of the first Oasis and made it almost perfect."
    },
    {
      "reviews.date": "2018-01-13T00:00:00.000Z",
      "reviews.id": "b6e0a5b1-8a1a-44aa-bb3e-f4a40efb2432",
      "reviews.rating": 5,
      "reviews.text": "IMO they have perfected the display. even lighting. no glare. and now it's waterproof??? incredible."
    },
    {
      "reviews.date": "2018-01-06T00:00:00.000Z",
      "reviews.id": "261fc268-8370-4183-9101-84241f0e2d83",
      "reviews.rating": 5,
      "reviews.text": "I'm a huge fan of the e-readers. I find I read more on my kindle than any other device (iPad, other tablet). I recently upgraded from the Kindle Paperwhite to the Oasis. I'm a huge fan of the larger screen and ergonomic feel. It has been a pleasure to use."
    },
    {
      "reviews.date": "2018-03-04T00:00:00.000Z",
      "reviews.id": "ab5c8495-00cd-4431-a732-1ef70ded2475",
      "reviews.rating": 5,
      "reviews.text": "Really comfortable to hold, 7-inch screen looks fantastic and offers some features that could be useful. If you use audible or like to read near water (poolside or in a bath) then this would be the e-reader to go with. If not, then I would just stick with the Voyage (if you're a hardcore reader) or a Paperwhite for casual readers."
    },
    {
      "reviews.date": "2017-12-09T00:00:00.000Z",
      "reviews.id": "71e47a24-fe9f-4268-96af-93009595b629",
      "reviews.rating": 4,
      "reviews.text": "I was used to the Kindle 3rd gen(Kindle Keyboard) and when i first held the Oasis it felt very odd and uncomfortable and the metal back made it feel like it could slip and fall at any second. It does take time to get used to. The device is expensive for something that is not even a colored screen. However, my main reason was because it was a bigger screen and clearer ( besides there doesn't seem to be much upgrades between the Kindle Keyboard and the other ones) I find myself accidently touching the touchscreen more often than I would like ( but much less than when I 1st got it- a week or so ago). All in all it is a sleek and nice device, alittle pricey."
    },
    {
      "reviews.date": "2018-03-14T00:00:00.000Z",
      "reviews.id": "928a1c55-db3d-43a6-8d1a-5a6426441e13",
      "reviews.rating": 4,
      "reviews.text": "The design is good. Love to read books with this beautiful device. The battery is not very good though."
    },
    {
      "reviews.date": "2018-05-04T00:00:00.000Z",
      "reviews.id": "35797170-08bd-475d-b7a5-d43ff6c2769e",
      "reviews.rating": 5,
      "reviews.text": "Great oven with a nice even heat with the convection part"
    },
    {
      "reviews.date": "2018-05-25T00:00:00.000Z",
      "reviews.id": "b7fe0c66-593f-4629-80b5-4583d8b4f7fb",
      "reviews.rating": 5,
      "reviews.text": "This e reader is great because of higher pixel dpi - no blemish to detract from reading. My only grip is it‚Äôs kind of a finger print magnet slash sweaty but it‚Äôs my first e-reader so maybe that‚Äôs to be expected and I don‚Äôt use a case.Try reading in landscape mode it‚Äôs so comfy and feels like less natural reading eye fatigue somehow."
    },
    {
      "reviews.date": "2018-01-17T00:00:00.000Z",
      "reviews.id": "ffe93403-8812-4804-b319-776a54fc62e1",
      "reviews.rating": 5,
      "reviews.text": "This Kindle is light weight, easy to read and water proof. A great buy."
    },
    {
      "reviews.date": "2018-01-22T00:00:00.000Z",
      "reviews.id": "14ad38f6-ab26-4932-8ae1-8a3d97e1a550",
      "reviews.rating": 5,
      "reviews.text": "Bought this IPAD for my daughter and husband for Christmas. They love it and great for capturing the kids moments."
    },
    {
      "reviews.date": "2017-12-10T00:00:00.000Z",
      "reviews.id": "393baa07-ba8c-4a41-93e6-c806510baffc",
      "reviews.rating": 4,
      "reviews.text": "I love this so far only downside is you can not read and listen at the same time. Its one or the other. Battery life is poor. 50% drained on stanby in under a week. Lasts better if you keep wifi bluetooth off"
    },
    {
      "reviews.date": "2017-12-16T00:00:00.000Z",
      "reviews.id": "4c3ccb4f-4dc2-4588-a4ed-d7e1eb183fdf",
      "reviews.rating": 5,
      "reviews.text": "I adore this kindle. I have owned voyage and paperwhite previously. And all the three; paperwhite, voyage and oasis 2017 are fantastic devices but the only two reasons i upgraded are bigger screen and waterproof. Though the screen size is little bigger than the previous models it does make quite a difference. Also oasis comes with 8gb or 32gb of memory. But otherwise i love paperwhite and voyage as well."
    },
    {
      "reviews.date": "2018-04-13T00:00:00.000Z",
      "reviews.id": "981005a5-add0-4af1-9d90-dde6eada46ab",
      "reviews.rating": 4,
      "reviews.text": "Really impressed with the effects of the cover. Works great with the kindle. Highly recommend this."
    },
    {
      "reviews.date": "2017-11-15T00:00:00.000Z",
      "reviews.id": "b5914cdf-d3b5-419f-bc0c-6b5df1496de0",
      "reviews.rating": 4,
      "reviews.text": "Love bigger screen, bold fonts, auto rotate & ability to hold it with one hand. Hate slippery aluminum backside. Where did the grippy textured surface go? So easy to drop."
    },
    {
      "reviews.date": "2018-03-21T00:00:00.000Z",
      "reviews.id": "c43c7e78-770a-4336-b6df-11f2e12aa5ad",
      "reviews.rating": 5,
      "reviews.text": "I have used and loved three previous Kindles: the Kindle Keyboard, the 1st gen Paperwhite and the Voyage. Without a doubt this one is the best. This is the first Kindle I can comfortably hold in my hands. I love that if I want to switch from holding it in left hand to holding it in right hand, the text automatically flips. No matter which hand you hold it in the page turn buttons are in the perfect place for your thumb. No regrets in this purchase!"
    },
    {
      "reviews.date": "2018-04-06T00:00:00.000Z",
      "reviews.id": "ad9da479-9b6e-4570-8db1-d48519d39d05",
      "reviews.rating": 2,
      "reviews.text": "I've always been a fan of the Kindle, ever since the first one came out over a decade again.I was excited about this Kindle due to the many premium features it showed - the all-metal finish, high-resolution ePaper display, backlighting, extended battery life, etc.I was significantly disappointed to see that Amazon pushes ads through the Kindle when you put it into sleep mode, and throughout the store options. Additionally, I was further frustrated by the fact that I learned there was a cellular version (available direct from Amazon) but not through the store. For such an expensive unit, to have ads with no option to disable them, seems unreasonable and like a rip-off. Additionally, the fact that this only supports wifi (not cellular or WhisperSync) makes it even more of a drawback and something I would not recommend to a friend - stick with the cheaper version.I also found annoying problems trying to get my Apple Airpod earphones to work with this device. Pairing took forever to finish or work (had to try three different times) and if the unit sits for too long, I found that I had to go through the entire pairing process again; they were not automatically connected and synced the moment I had both devices turned on."
    },
    {
      "reviews.date": "2018-03-10T00:00:00.000Z",
      "reviews.id": "ee295526-2359-45bc-bf86-1c79247bd401",
      "reviews.rating": 5,
      "reviews.text": "Bought this as a birthday present and my wife loved the upgrade from her Paperwhite. Easier to hold and lighter. She has commented the screen is also much easier to read."
    },
    {
      "reviews.date": "2018-01-17T00:00:00.000Z",
      "reviews.id": "cec206d4-9a54-4d53-9840-734d8acad75b",
      "reviews.rating": 4,
      "reviews.text": "Kind of disappointed that they did away with the included battery cover and also removed the ability to even connect a battery cover."
    },
    {
      "reviews.date": "2017-12-21T00:00:00.000Z",
      "reviews.id": "f68ee4c3-ee40-4e04-a695-6fc460d8a19c",
      "reviews.rating": 5,
      "reviews.text": "Best reader, super light a very fast reader but pricy."
    }
  ]
}