{
  "id": "AV-ETMhgYSSHbkXwpNb9",
  "dateAdded": "2017-11-03T23:17:55Z",
  "name": "All-New Kindle Oasis E-reader - 7 High-Resolution Display (300 ppi), Waterproof, Built-In Audible, 32 GB, Wi-Fi + Free Cellular Connectivity",
  "asins": "B06VTJWRJW",
  "brand": "Amazon",
  "categories": "Featured Brands,E-Readers & Accessories,EBook Readers,Tablets,Amazon Book Reader,Electronics,Computers & Tablets,Amazon Ereaders,Kindle E-readers,Amazon Devices,Tablets & E-Readers,E-Readers",
  "primaryCategories": "Electronics",
  "keys": "amazon/53006390,amazon/b06vtjwrjw,841667188416,allnewkindleoasisereader7highresolutiondisplay300ppiwaterproofbuiltinaudible32gbwififreecellularconnectivity/b06vtjwrjw,amazonkindleoasisereader7highresolutiondisplay300ppiwaterproofbuiltinaudible32gbwififreecellularblacksilver/6106902,amazon/53052037",
  "manufacturer": "Amazon",
  "reviews": [
    {
      "reviews.date": "2017-11-10T00:00:00.000Z",
      "reviews.id": "fdc3e8ac-e87b-4f24-8913-dfab7d5cb922",
      "reviews.rating": 5,
      "reviews.text": "The best Kindle ever, for me, is still the huge DX that Amazon used to make. But that is ancient history.With the current generation, I have owned the Voyager, and both the new and older versions of the Oasis (for all, wifi and 3g versions). I can tell you from these three devices this 2017 Kindle Oasis is the best and well worth the cost. It is fast, and that seemingly minor screen size bump actually is very big when you use the device to read.Also, the device is very fast. Page flips are very quick and the backlight is even and not distracting.Note that I only read Kindle books on the device. For technical documents the SONY EReader (DPTRP1/B) is probably the go to device, but its considerably more."
    },
    {
      "reviews.date": "2017-12-23T00:00:00.000Z",
      "reviews.id": "9651ad96-edd7-4b57-aa8d-bb921f5690c7",
      "reviews.rating": 5,
      "reviews.text": "I always use it when i read ebook ,i like it a lot"
    },
    {
      "reviews.date": "2017-11-04T00:00:00.000Z",
      "reviews.id": "07e02c57-ced8-4b32-a9b0-10bbc36cf794",
      "reviews.rating": 5,
      "reviews.text": "Bought the new Oasis for my wife. She already had the first Oasis and was very pleased with it. What sets this one apart is the 7\" screen. Much easier to see (we are not \"20ish by a longshot) and the battery not being in the case. It feels lighter than the old model but they are very close in actuality. To pay this much money for a tablet without color is only going to be worthwhile if you are an avid reader. Reading on the Kindle eReader is simply much, much easier on the eyes than a regular tablet like an iPad or a Kindle Fire. Not sure what the battery life will be, but reportedly many weeks, and if the old Oasis is any measure that will be true. Build quality is excellent. Aluminum back and not plastic. The leather cover must be purchased separately but is worth it to protect the screen and it looks great. There have been complaints that it does not lock on well, but it appears to be as secure as the previous cover for the Oasis. This case does not carry a battery as the previous generation but the battery in the device is much larger than the previous model. A winner for bookworms!"
    },
    {
      "reviews.date": "2017-12-20T00:00:00.000Z",
      "reviews.id": "7df3bbdf-f6d8-46e0-8db4-09b3e0262457",
      "reviews.rating": 4,
      "reviews.text": "I absolutely love this reader. The bigger screen is wonderful. My only complaint is the battery does not last as long as advertised."
    }
  ]
}