{
  "id": "AVpe7nGV1cnluZ0-aG2o",
  "dateAdded": "2014-10-28T11:14:38Z",
  "name": "AmazonBasics Nylon CD/DVD Binder (400 Capacity)",
  "asins": "B00DIHVMEA,B00EZ1ZTV0",
  "brand": "Amazonbasics",
  "categories": "Audio & Video Accessories,TV, Video & Home Audio,Home Audio & Video Accessories,DVD Cases,Electronics,Media Cases & Storage,TV, Video & Audio Accessories,Media Storage & Organization,Disc Storage Wallets,Consumer Electronics,CD, DVD & Blu-ray Discs,Blank Audio/Video Media,Accessories & Supplies,all electronics",
  "primaryCategories": "Electronics",
  "keys": "amazonbasicsnyloncddvdbinder400capacity/b00ez1ztv0,amazonbasicsnyloncddvdbinder400capacity/113673983053,amazonbasicsnyloncddvdbinder400capacity/b00dihvmea,amazonbasics/ybb12400r2",
  "manufacturer": "AmazonBasics",
  "reviews": [
    {
      "reviews.date": "2017-11-12T00:00:00.000Z",
      "reviews.id": "68c76db1-1e9c-4839-95a2-5f13e0fff6f9",
      "reviews.rating": 5,
      "reviews.text": "Great case to keep everything in its place! My husband love it!!!! Holds a lot of cds!"
    },
    {
      "reviews.date": "2014-06-14T05:00:00Z",
      "reviews.id": "254a708f-449b-4894-91bf-6aa08cb6cc02",
      "reviews.rating": 5,
      "reviews.text": "After discarding and getting rid of broken cd cases, broken cds, and selecting those ones we really like, this binder turned up to be an excellent option to store our favourite cds and dvds and keep them in a small space at our living room, giving us the choice to donate or get rid of those cds towers that took a lot of room, despite looking nice. And because you can turn the pages, you can spot the cd you want to play without the hassle of taking it from a case that is falling apart. After storing them cds, all the cases and printed covers went straight to the recycling centre. We have a small version to put those cds my husband would like to listen to whenever he must drive away for work."
    },
    {
      "reviews.date": "2019-02-15T00:00:00.000Z",
      "reviews.id": "ce04ceab-8641-4da7-8ea9-b5452f4b4a9f",
      "reviews.rating": 5,
      "reviews.text": "A few dollars more, but I am boycotting amazon"
    },
    {
      "reviews.date": "2014-06-19T05:00:00Z",
      "reviews.id": "e7ac063e-eaf2-4775-a2a6-2e1a93d78d9d",
      "reviews.rating": 2,
      "reviews.text": "My initial impression of this was very good. The material is nicer than the shiny stuff on my Hama CD binders and the netting trim gives a nice appearance compared to plain look of most budget CD binders.There are 50 pages with 8 disc pockets each (4 per side) giving a total of 400 capacity. The pages are hung from the spine in two groups of 25. By that I mean that 25 pages all have a single attachment point to the plastic spine.This is where the first problem with this binder lies. Because each group of 25 pages shares the same anchor point in the spine, the pages cannot sit flat once full of discs. They bend and arch, and apart from looking tatty this puts a lot of tension across the plastic film. With long-term usage I suspect this plastic film will will tear due to the tension. It also makes it awkward to browse the binder as the pages don't sit flat. It may even crack or bend your discs.I look to my Hama 120 binder to see how it *should* be done - it only has 30 pages and yet they were smart enough to hang them from the spine in 3 bundles of 10. This spreads out the pages and allows easy browsing of the binder without putting any of the pockets under tension.After just 2 weeks in storage I opened the binder and the corners of all the pages have become dog-eared by themselves. This is due to the poor design and poor fit of the binder pages when filled with discs. Again, it is not a problem I have seen with my other disc binders, my two-year-old Hama binders look as good as new.Overally this binder has a lot of storage at a good price. If that's all you want you will probably be happy with the product. But sloppy design prevents it from being anything more than a mediocre binder. I feel that whoever designed this did not bother to fill it with discs to see how it would cope."
    }
  ]
}