{
  "id": "AVphPmHuilAPnD_x3E5h",
  "dateAdded": "2016-03-31T21:08:24Z",
  "name": "Kindle Voyage E-reader, 6 High-Resolution Display (300 ppi) with Adaptive Built-in Light, PagePress Sensors, Wi-Fi - Includes Special Offers",
  "asins": "B00IOY8XWQ",
  "brand": "Amazon",
  "categories": "eBook Readers,Electronics Features,Walmart for Business,Tablets,See more Amazon Kindle Voyage (Wi-Fi),Electronics,Amazon Ereaders,Office Electronics,iPad & Tablets,Kindle E-readers,E-Readers & Accessories,All Tablets,See more Amazon Kindle Voyage 4GB, Wi-Fi  3G (Unlocked...,Amazon Book Reader,Computers & Tablets",
  "primaryCategories": "Electronics",
  "keys": "amazon/b00ioy8xwq,848719040104,kindlevoyageereader6highresolutiondisplay300ppiwithadaptivebuiltinlightpagepresssensorswifiincludesspecialoffers/b00ioy8xwq,0848719040104,kindlevoyageereader6highresolutiondisplay300ppiwithadaptivebuiltinlightpagepresssensorswifiincludesspecialoffers/321689278417,kindlevoyageereader6highresolutiondisplay300ppiwithadaptivebuiltinlightpagepresssensorswifiincludesspecialoffers/9302088,amazon/53002680,amazonkindlevoyage64gbblack/9302088",
  "manufacturer": "Amazon",
  "reviews": [
    {
      "reviews.date": "2017-06-21T00:00:00.000Z",
      "reviews.id": "4980e446-9b3a-419d-9c88-d72c71aaeb30",
      "reviews.rating": 5,
      "reviews.text": "I bought this so i can save all of my books. It was a bit small at first but you get used to it. Overall i am very satistfy"
    },
    {
      "reviews.date": "2015-08-05T00:00:00.000Z",
      "reviews.id": "2b6a8add-6cb3-4585-a600-52b49aec0668",
      "reviews.rating": 5,
      "reviews.text": "I bought this as a gift. I think it is pretty decent both quality and design."
    },
    {
      "reviews.date": "2015-11-08T00:00:00.000Z",
      "reviews.id": "fbc90b68-db1d-44a4-82d4-32861339c129",
      "reviews.rating": 5,
      "reviews.text": "This is a great e-reader, perhaps a little pricey but well worth the money. It is extremely light and the e-ink is very readable."
    },
    {
      "reviews.date": "2015-07-03T00:00:00.000Z",
      "reviews.id": "07df1eb8-7c53-4bf4-964b-aa1071f08791",
      "reviews.rating": 5,
      "reviews.text": "I have owned several Kindles over the years, and this one is the best yet. The contrast and clarity is improved over the already-good Paperwhite 2. I like the page turn \"buttons\" on the bezel as well."
    },
    {
      "reviews.date": "2015-05-15T00:00:00.000Z",
      "reviews.id": "b2283cf7-cc01-4c6a-82f0-bca6bc6adae1",
      "reviews.rating": 5,
      "reviews.text": "Nothing will replace the joy of flipping through the pages of a book, but living in a studio apartment with my girlfriend, I simply don't have the space for all the books I'd like to own on top of the ones I have now.I got this for my girlfriend because she has difficulty reading on my iPad Air. She has no difficulty using her Kindle Voyage, and she thoroughly enjoys it.I'm actually thinking of getting one for myself farther down the line."
    },
    {
      "reviews.date": "2015-02-05T00:00:00.000Z",
      "reviews.id": "d957dd79-e616-45d2-bde0-761c05fca9e3",
      "reviews.rating": 4,
      "reviews.text": "Light weight, easy to use, love the lighted background. I am unable to make it stay on page count it keeps going back to hours left to read. But other then that a great ereader."
    },
    {
      "reviews.date": "2015-06-03T00:00:00.000Z",
      "reviews.id": "61691a12-23b1-4fda-831f-f5c6f485bed3",
      "reviews.rating": 5,
      "reviews.text": "The Amazon Kindle Voyage is the absolute e-reader to end all e-readers. Light, amazing screen, and stylish, minimal design. If you want an e-reader, definitely buy this one!"
    },
    {
      "reviews.date": "2016-06-03T00:00:00.000Z",
      "reviews.id": "f9b33834-5f49-4f37-a272-3417c98ebbfb",
      "reviews.rating": 4,
      "reviews.text": "I have been very pleased with my Voyage. It operates as advertised and has been a pleasure to use. Very well pleased with battery life."
    },
    {
      "reviews.date": "2014-11-07T00:00:00.000Z",
      "reviews.id": "9be20bb7-ddc2-4018-a186-b7d2020acc12",
      "reviews.rating": 5,
      "reviews.text": "We had previously owned Kindle paperwhite version 1 and this is a substantial improvement. The new screen is much brighter and the response is quicker ."
    },
    {
      "reviews.date": "2015-08-07T00:00:00.000Z",
      "reviews.id": "84934b95-9585-4a1f-b9de-b89be090f343",
      "reviews.rating": 5,
      "reviews.text": "Absolutely love this new Kindle! Light, sharp, glass touchscreen and adaptive front light. Very easy to use and read!"
    },
    {
      "reviews.date": "2014-11-04T00:00:00.000Z",
      "reviews.id": "a34c75e9-79d6-45d9-bdb0-efdc1ca5b368",
      "reviews.rating": 5,
      "reviews.text": "I have the second generation Kindle Paperwhite and the new Voyage is far superior to it. The resolution is much sharper, the back light is much brighter and the power button location is much more convenient. I highly recommend it."
    },
    {
      "reviews.date": "2014-10-24T00:00:00.000Z",
      "reviews.id": "eef8b7bb-b63f-47dd-b8a7-43e16a4b94b1",
      "reviews.rating": 5,
      "reviews.text": "I am extremely happy with my new Kindle Voyage. The text is so sharp and crisp, the images look much better than on the Kindle Paperwhite. The device is extremely light and comfortable to hold, The adaptive front light works great. I have an iPad with the Kindle app, but the reading experience is so much better on my Kindle Voyage that don't regret the purchase one bit."
    },
    {
      "reviews.date": "2016-12-06T00:00:00.000Z",
      "reviews.id": "762eb04c-7e53-428c-9018-4111f5330214",
      "reviews.rating": 5,
      "reviews.text": "I bought this product back in September and have loved every moment of it. Setup was easy, the Amazon store and search bar make it easy to narrow down the thousands of books available, and the battery is long-lasting so that I don't have to worry about constantly charging. In 3 months I have only had to charge it twice. Best parts are the backlit screen with easy adjustment and ample storage!"
    },
    {
      "reviews.date": "2017-10-20T00:00:00.000Z",
      "reviews.id": "78d76e63-653d-4585-ab1d-fe5cb9b2bc32",
      "reviews.rating": 5,
      "reviews.text": "love this device it is amazing. the screen is bright and easy to read"
    },
    {
      "reviews.date": "2016-09-24T00:00:00.000Z",
      "reviews.id": "57147ff7-4056-4f8e-84b6-5c0fb4839e58",
      "reviews.rating": 5,
      "reviews.text": "This is my third Amazon Kindle and by far it is the best one. The adaptive lighting really helps as it is easy on the eyes. The battery lasts for weeks on a normal charge and charges to full pretty fast.I still enjoy the eink displays over a regular phone or tablet for extended reading periods.The kindle voyage is light weight and I was able to easily find cases and accessories online.I highly recommend the kindle voyage over the other kindle readers because of the advanced features."
    },
    {
      "reviews.date": "2015-07-18T00:00:00.000Z",
      "reviews.id": "0fa1db72-f242-4507-b079-c19418ccfa4b",
      "reviews.rating": 5,
      "reviews.text": "Went to buy the Kindle Paperwhite, but after comparing them side-by-side I decided to buy the Voyage. I thought that the print was a little sharper and I liked the smaller and lighter weight. I have been using it almost every day and really, really enjoy it."
    },
    {
      "reviews.date": "2016-10-01T00:00:00.000Z",
      "reviews.id": "faa1c9f4-f7bf-476a-88d2-22defd85c536",
      "reviews.rating": 5,
      "reviews.text": "I extremely enjoy and like my Kindle Voyage Reader a whole bunch! I like reading on it a whole bunch, especially my Living Bible, because I'm a Christian that loves God and Jesus Christ of Nazareth! I believe this product is a very excellent reader, which a person can read all of their books on the Kindle Voyages in their Amazon library! Definitely get one today, because especially, because it is light weight and has an awesome back light for reading in the dark. I like it because it is so light and easy on the arms while holding while reading. God bless you! :)"
    },
    {
      "reviews.date": "2016-03-17T00:00:00.000Z",
      "reviews.id": "20cecaad-c112-4d66-8ced-8c443745791c",
      "reviews.rating": 1,
      "reviews.text": "My Kindle Voyage is nearly 16 months old and worked perfectly. I kept receiving emails from Amazon about the software update. I switched off airplane mode, switched on wifi and shortly after the screen locked up. I have tried everything with customer support and they now tell me I will have to buy a new one. I am very annoyed. If I had left the software as it was my Kindle Voyage would still be working."
    },
    {
      "reviews.date": "2016-02-26T00:00:00.000Z",
      "reviews.id": "dd70bbd5-4368-4177-97c1-578ee755a95b",
      "reviews.rating": 5,
      "reviews.text": "Fantastic for reading in dark conditions. Very light and easy to hold."
    },
    {
      "reviews.date": "2016-02-26T00:00:00.000Z",
      "reviews.id": "7e3964aa-0d56-4695-9cfd-473f7d67a329",
      "reviews.rating": 4,
      "reviews.text": "The Kindle voyage is an improvement on the paper white. It is lightweight, compact, and easy to use."
    },
    {
      "reviews.date": "2014-11-04T00:00:00.000Z",
      "reviews.id": "afdd4460-c952-436b-a251-7bae7497e37e",
      "reviews.rating": 4,
      "reviews.text": "Moving to this from the first generation Paperwhite appears to have been the right move. I love the new size, it just feels tiny and perfect in the hand. The new automatic brightness setting works quite well. I do wish I could crank up the force required to activate the page turn buttons however, as I have frequently hit them accidentally. The page turn buttons do work with gloves on which a great for reading in a tree stand."
    },
    {
      "reviews.date": "2017-05-17T00:00:00.000Z",
      "reviews.id": "4d5622b7-2b93-4f5b-b4d7-5e6eef69858f",
      "reviews.rating": 5,
      "reviews.text": "This is the 3rd Kindle we have purchased and they keep getting a little nicer with each version. The light on this one is a really nice feature. The battery life is better, the page turning options are better, it is lighter... there are just a lot of nice little improvements. If you like to read in an electronic format I cannot imagine disliking the Kindle."
    },
    {
      "reviews.date": "2015-12-05T00:00:00.000Z",
      "reviews.id": "8c0c72c3-8f7f-4596-ad06-55ae581c3d61",
      "reviews.rating": 5,
      "reviews.text": "Purchased as a gift. It was a good choice. It is as advertised,"
    },
    {
      "reviews.date": "2015-06-08T00:00:00.000Z",
      "reviews.id": "3853a2f8-7887-45c1-860a-aa71eea6589c",
      "reviews.rating": 5,
      "reviews.text": "As expected. i would suggest to get a cover. The dictionary is very easy to use."
    },
    {
      "reviews.date": "2014-11-28T00:00:00.000Z",
      "reviews.id": "60c9233a-598a-47ec-905d-69ae41f78554",
      "reviews.rating": 5,
      "reviews.text": "I like that it has an Automatic backlight adjustment"
    },
    {
      "reviews.date": "2016-12-16T00:00:00.000Z",
      "reviews.id": "f442f028-7aa8-455e-9277-6b5235d373d4",
      "reviews.rating": 5,
      "reviews.text": "Great device. Great for reading books. Small and compact. Lightweight. Looks great too. The light is a great feature"
    },
    {
      "reviews.date": "2016-03-18T00:00:00.000Z",
      "reviews.id": "8df10999-5e4a-4c28-bf82-78040a3f175a",
      "reviews.rating": 5,
      "reviews.text": "Great product. Would recommend it to others to buy."
    },
    {
      "reviews.date": "2015-02-24T00:00:00.000Z",
      "reviews.id": "d6a2b445-92e0-4644-93a0-fd00e6ee5196",
      "reviews.rating": 5,
      "reviews.text": "This is the best Kindle I have ever used. This is way better than the Kindle Fire HD which I also own."
    },
    {
      "reviews.date": "2016-07-27T00:00:00.000Z",
      "reviews.id": "002696f8-8b18-4b3e-8b35-03f4fd2ae720",
      "reviews.rating": 5,
      "reviews.text": "Love it! Best e reader I have owned so far and I've owned quite a few"
    },
    {
      "reviews.date": "2015-03-05T00:00:00.000Z",
      "reviews.id": "a8fc86da-f712-42fd-b7cd-a6057e02ad9b",
      "reviews.rating": 5,
      "reviews.text": "I'm not one for reviewing usually but my oh my do i love this thing. It is lightweight and amazing!! I LOVE HOW CRISP IT IS AND HOW BRIGHT IT IS."
    },
    {
      "reviews.date": "2014-10-24T00:00:00.000Z",
      "reviews.id": "7d4550ba-6848-4c07-890f-c2404f396fd0",
      "reviews.rating": 5,
      "reviews.text": "The Voyage is a great reader for those like myself who love to read books. The lines and images are crisp and clean. Its light weight even with the cover. The only thing is the origami cover was something that i would have thought of designing differently. It feels uncomfortable to hold... The device though is awesome and the page turn features are great you can use either side to turn pages. Would suggest to anyone who loves to read!!"
    },
    {
      "reviews.date": "2016-01-06T00:00:00.000Z",
      "reviews.id": "58e703ce-8332-47f3-a522-5edaa517608c",
      "reviews.rating": 5,
      "reviews.text": "Love this ereader; very convenient. Very easy to use."
    },
    {
      "reviews.date": "2015-01-06T00:00:00.000Z",
      "reviews.id": "911b01a7-43d4-402a-8c35-2f197491d76c",
      "reviews.rating": 5,
      "reviews.text": "The best kindle that I ever had!It is great if you love reading and really want to have the feel of handling a book.Great for indoor and outdoor reading"
    },
    {
      "reviews.date": "2016-04-29T00:00:00.000Z",
      "reviews.id": "2d2f51bd-c2e3-4896-af88-f70da735bc0d",
      "reviews.rating": 5,
      "reviews.text": "I have always enjoyed reading. I read to quickly and eventually spend a load of money on one book series. This product has already saved me at least $80, and i've only had it for a month. Yes I did the math! I love this thing!"
    },
    {
      "reviews.date": "2017-05-12T00:00:00.000Z",
      "reviews.id": "6c6ce5b1-ed8b-4e6a-8fac-7605e8039af0",
      "reviews.rating": 5,
      "reviews.text": "Really like to read ebooks on the Kindle. The contrast is perfect so there is no strain on the eyes. The smooth feel gives a good user experience."
    },
    {
      "reviews.date": "2015-03-15T00:00:00.000Z",
      "reviews.id": "fe36c91b-e94f-46fc-8a7c-70c3932ef96f",
      "reviews.rating": 4,
      "reviews.text": "I love this kindle. Faster than the paper white in how it responds to changing pages and/or books. The self adjusting light levels works very good in mine. Having the option on the frame to change pages is great but you have to press a little hard on the forward page button or it will do a backward change instead; this is the only reason why I don't give it a 5.I love this reader"
    },
    {
      "reviews.date": "2015-07-09T00:00:00.000Z",
      "reviews.id": "2aa264a9-e3a8-4116-83f7-ff4f73c15100",
      "reviews.rating": 5,
      "reviews.text": "Voyager is super easy to use and see, love the translations too!"
    },
    {
      "reviews.date": "2016-01-05T00:00:00.000Z",
      "reviews.id": "dd6796e7-6207-4a56-8320-09dca7a6d13c",
      "reviews.rating": 5,
      "reviews.text": "i'm an avid reader and love the Kindle Voyage. i love the adjustable fonts and that it automatically adjust to the light settings. The push sides to flip pages but not if you accidentally bump the wrong side which has happened a few times. Great battery life it's usually a couple of days before i have to recharge."
    },
    {
      "reviews.date": "2016-04-24T00:00:00.000Z",
      "reviews.id": "e67a2dc0-119b-468b-81c1-2beb4bdcc615",
      "reviews.rating": 5,
      "reviews.text": "I love my kindle voyage. It is very little weight and I love the page press that it has, don't even have to move your hand to turn the page. You can read it in the bright sun and in the dark which no over brand of tablets you can do that with."
    },
    {
      "reviews.date": "2015-04-18T00:00:00.000Z",
      "reviews.id": "14d9a769-1f1f-4ae5-befd-f7bd74b23bd7",
      "reviews.rating": 2,
      "reviews.text": "I accidentally cracked my screen on the first day when the Voyage was too close to my rocking chair and neither Best Buy nor Amazon would do anything to help. Well, Amazon offered $15 off purchasing the Paperwhite and that wasn't something I wanted at all. Now I'm stuck with a $199 broken Voyage. Not a happy customer. I realize it was my fault but thought they should do something more to minimize the loss and keep my business."
    },
    {
      "reviews.date": "2014-10-24T00:00:00.000Z",
      "reviews.id": "c7093cf7-bb97-40f1-a979-34a9e1f39a04",
      "reviews.rating": 5,
      "reviews.text": "Nice ereader for reading books. Browser should be improved otherwise fine for reading books, another irritating part is ads pop up which amazon shud fix"
    },
    {
      "reviews.date": "2015-08-19T00:00:00.000Z",
      "reviews.id": "54cffecb-ef2b-48f5-91b1-4f60b4139bb2",
      "reviews.rating": 5,
      "reviews.text": "Very nice display and high resolution! A pleasure to read."
    },
    {
      "reviews.date": "2015-07-02T00:00:00.000Z",
      "reviews.id": "e54b63c4-a753-4b56-aa3f-898b89d79916",
      "reviews.rating": 5,
      "reviews.text": "This is my first e reader. I did ttry my friends papperwhite but voyage is the best of the e reader world. The screen is awesome. I read a lot at night before I sleep and I use to read in my mobile which after sometime feels like my eyes are burning. But with voyage I can read as much time I want. No strain no burning sensation in my eyes. Compared to the papperwhite the screen looks better. Feels like I am actually reading a paper book."
    },
    {
      "reviews.date": "2016-04-23T00:00:00.000Z",
      "reviews.id": "eb3d93ab-1201-4cda-beea-91f4e0f32e2e",
      "reviews.rating": 5,
      "reviews.text": "Kindle voyage is the costliest of the kindle range but its worth it due to light weight and adaptive backlight. Enjoying it so far."
    },
    {
      "reviews.date": "2014-12-10T00:00:00.000Z",
      "reviews.id": "99aa7946-e6f7-43a4-b943-aafc040f9fd4",
      "reviews.rating": 5,
      "reviews.text": "Lighter than a helium balloon. So thin. Bright white screen. Crisp letters. Intuitive. Easy touchscreen page turning (or a gentle squeeze on either side of the book) and easy menu access. Ideal size. I don't know how they can improve this further. Just ordered their (Kindle's) Origami cover too."
    },
    {
      "reviews.date": "2015-04-23T00:00:00.000Z",
      "reviews.id": "4505a55f-0d9c-4b6f-aba5-71ff341e3692",
      "reviews.rating": 5,
      "reviews.text": "Gave up my tablet for the voyage and haven't looked back. A pleasure to read on."
    },
    {
      "reviews.date": "2015-10-12T00:00:00.000Z",
      "reviews.id": "f417a1a4-5b50-463b-954a-979e2f14a65a",
      "reviews.rating": 5,
      "reviews.text": "I am so glad i procrastinated in buying an e-reader.I was going to get the kindle paperwhite- then the Voyage came out- I bought it and am so happy with it- a joy to use."
    },
    {
      "reviews.date": "2015-12-02T00:00:00.000Z",
      "reviews.id": "6cbcd915-2d9d-4bb4-b4a6-b5a89b893360",
      "reviews.rating": 5,
      "reviews.text": "I or a family member have owned every version of the Kindle since it came out. This version has finally taken all of the best elements of the previous Kindles and combined them into one unit. It is small and light, has both touch screen and button functionality (depending on which you prefer - I'm a fan of the buttons), and an excellent back-light. Kindle battery life has always been excellent, and is no different here. I use my Kindle daily, often for at least an hour at a time. The only downside is that I'm not sure what other features Amazon could add to improve this version, other than perhaps making it lighter weight. By far the best e-reader out there, and a worthy upgrade from a previous version"
    },
    {
      "reviews.date": "2016-09-02T00:00:00.000Z",
      "reviews.id": "0e78873e-1c6d-40d7-bff1-996547e1d6e2",
      "reviews.rating": 5,
      "reviews.text": "Improved interface and same great readability as the Paperwhite."
    },
    {
      "reviews.date": "2015-08-23T00:00:00.000Z",
      "reviews.id": "da20c42b-0712-4133-9057-ca3fe1db401e",
      "reviews.rating": 5,
      "reviews.text": "Kindle Voyage is easily the best e-reader with an impressive high-resolution display and it is very thin and light weight too. Loving it."
    },
    {
      "reviews.date": "2016-01-22T00:00:00.000Z",
      "reviews.id": "41f572c5-8904-43b6-b00a-cfd37dd9c510",
      "reviews.rating": 5,
      "reviews.text": "Even better than the Paperwhite, which have used regularly over the past couple of years."
    },
    {
      "reviews.date": "2017-02-05T00:00:00.000Z",
      "reviews.id": "00ff9792-bea3-4700-b605-995bc779a1cc",
      "reviews.rating": 5,
      "reviews.text": "I have been using the paperwhite for about 2 years now and this unit definitely beats it. The adaptive lighting is amazing and page turn buttons are quite useful. If you are looking for an E-Reader then this is the one for you."
    },
    {
      "reviews.date": "2015-08-19T00:00:00.000Z",
      "reviews.id": "b33a8627-3cb6-40e8-948e-c85782c48270",
      "reviews.rating": 5,
      "reviews.text": "There is no better E-reader available today. It costs a bit more, but the build quality is the best."
    },
    {
      "reviews.date": "2015-10-02T00:00:00.000Z",
      "reviews.id": "b7cd9477-24e4-406b-84e2-37547fc756b2",
      "reviews.rating": 5,
      "reviews.text": "I have had several Kindle ereaders over the years also Nook, Kobo, and Sony as well, I even had the original Rocket Reader (I still have it) and they have all improved over the years so it's not surprising that the new Voyage is the best one yet. Over all I prefer the Kindle readers now and Amazon has perfected the eBook experience so why go anywhere else."
    },
    {
      "reviews.date": "2015-09-11T00:00:00.000Z",
      "reviews.id": "bce9760d-c98c-495a-aad9-c38350db9ded",
      "reviews.rating": 5,
      "reviews.text": "I got this for my sister who is in Paris and she doesn't go anywhere without it. All the benefits of a real book and none of the cons."
    },
    {
      "reviews.date": "2015-04-17T00:00:00.000Z",
      "reviews.id": "8e47e17d-47ba-4a6c-adee-0795b64943a3",
      "reviews.rating": 5,
      "reviews.text": "This kindle is so good on so many levels. Not sure it is worth the price premium over the paperwhite, but you will definitely have the best reader on the market."
    },
    {
      "reviews.date": "2015-04-15T00:00:00.000Z",
      "reviews.id": "83b586e0-391e-41ab-be7a-504d44656a09",
      "reviews.rating": 5,
      "reviews.text": "What a great ereader. Amazon continues its dominance in the ereader field with this entry. Light and comfortable to hold. Perfect combination of hepatic feedback buttons and adaptive back-lighting. Seems to stay charged forever even with regular use. I would definitely recommend this and would buy again."
    },
    {
      "reviews.date": "2015-01-16T00:00:00.000Z",
      "reviews.id": "a4c06383-00b8-4a37-97fb-735ed6ec8cc3",
      "reviews.rating": 4,
      "reviews.text": "Overall I've been very happy with my new Kindle Voyage, the screen is much sharper than my wife's paperwhite (v1) and the backlight is much more even. I've also been very happy with the page turn buttons. It makes it significantly more convenient to turn pages than using the screen and the pressure and feedback both seem about right. The only issue I have that keeps this from earning 5 stars is that the backlight on the screen has a slightly two-tone hue. It is somewhat yellowish on top and bluish on the bottom of the screen. It isn't something that really distracts from reading but it is noticeable when looking for it. Fix this so the coloring is even and it is really a perfect ereader."
    },
    {
      "reviews.date": "2015-03-13T00:00:00.000Z",
      "reviews.id": "b9ada3ba-2cfa-468c-98ab-ee1a76d79f1c",
      "reviews.rating": 5,
      "reviews.text": "I choose store pick Up in New York and works Great. Love my Kindle Voyage"
    },
    {
      "reviews.date": "2017-06-21T00:00:00.000Z",
      "reviews.id": "91856f9e-833a-4c5e-85e5-9b2c9bec5cfe",
      "reviews.rating": 5,
      "reviews.text": "I have owned several Kindles and this is the best one yet"
    },
    {
      "reviews.date": "2014-11-04T00:00:00.000Z",
      "reviews.id": "75d51cec-029c-4044-809f-643f78c02271",
      "reviews.rating": 5,
      "reviews.text": "This is so far the best Kindle I have ever owned. I love the screen and the resolution on it. The device out performs all of the other e readers on the market."
    },
    {
      "reviews.date": "2015-04-13T00:00:00.000Z",
      "reviews.id": "f2ac2373-8e81-4748-bada-70e6694b032c",
      "reviews.rating": 5,
      "reviews.text": "Works well from outdoors, to plane to reading in bed. No issues. Excellent all around. Better than a light."
    },
    {
      "reviews.date": "2015-02-06T00:00:00.000Z",
      "reviews.id": "396be0b4-d118-4d47-9266-d5599e3b8396",
      "reviews.rating": 5,
      "reviews.text": "received earlier than expected and was very happy. Will continue to buy at Best Buy in the future"
    },
    {
      "reviews.date": "2015-06-17T00:00:00.000Z",
      "reviews.id": "30d7278b-8b28-4751-b159-c18d25ac274f",
      "reviews.rating": 5,
      "reviews.text": "I purchased this specifically to take on a cruise. It exceeded my expectations. The voyager is slim, even with the cover, it is light weight and the screen is very clear. Battery life is good. I would absolutely recommend it."
    },
    {
      "reviews.date": "2015-04-11T00:00:00.000Z",
      "reviews.id": "92364bf1-850e-4e5d-8286-f8264a6f8caf",
      "reviews.rating": 5,
      "reviews.text": "Having had an original Kindle which I have enjoyed for several years, I decided to upgrade to the newest Kindle Voyage. I love the touch screen functionality and the lighted reading. I only wish I had done it sooner."
    },
    {
      "reviews.date": "2015-01-01T00:00:00.000Z",
      "reviews.id": "1a0b8cc8-8342-4c78-8f4f-6e7b0170207a",
      "reviews.rating": 5,
      "reviews.text": "Having owned each of the previous Kindle readers, this one is without a doubt the best of the bunch. I highly recommend that the serious reader consider this device. Do note that this is a Reader, not a tablet. Grab an iPad or Kindle Fire for your tablet needs but get this to read books. The high dot-per-inch count makes it easy on the eyes, as does the evenly-distributed light. Superb device!"
    },
    {
      "reviews.date": "2015-03-20T00:00:00.000Z",
      "reviews.id": "1951eff4-883e-4555-b190-6aef091e4650",
      "reviews.rating": 4,
      "reviews.text": "I've started to allow this device to grow on me. Yes I saw some color variation but either my eyes have adjusted or it's gone away. I'm back to reading like I used to and love it!"
    },
    {
      "reviews.date": "2014-10-24T00:00:00.000Z",
      "reviews.id": "d66b0a65-55a4-4732-b135-9fc48551b318",
      "reviews.rating": 5,
      "reviews.text": "I have a previous version of the Kindle, but this one surpasses it in every way, from the resolution to the automatic brightness display. Recommend it highly."
    },
    {
      "reviews.date": "2015-01-12T00:00:00.000Z",
      "reviews.id": "f218b032-0480-4678-9a3d-468ff19eaa86",
      "reviews.rating": 5,
      "reviews.text": "I just upgraded from a Touch to a Voyage and could not be happier. In my opinion this is by far the best Kindle yet. Its operation and features are similar to the Touch and Paperwhite but it is lighter and faster and very comfortable in the hand. Like other e-ink devices (unlike Fire) the screen has a matte finish which is really superb for reading. Some early reviews I've read complained about part of the screen having a yellowish hue. I have not seen any sign of this so that may have been an early manufacturing issue that hopefully has been corrected. The built-in screen light is amazing.Like other e-ink devices the Voyage allows better control and integration of dictionaries, which is really important for specialized reading or reading in a foreign language where one may want to consult several dictionaries in-situ to fully understand a word or phrase.There is very little not to like about the Voyage. I can only think of two issues to consider:1. Price - no doubt about it, Voyage is expensive, but in my opinion it is worth it. When trading off price and performance, I urge you to go into your nearest Best Buy for a hands-on look at the various Kindles, particularly the Paperwhite and Voyage to see what you really need/want or can live with.2. A minor point for the evolution of e-ink readers: it would be nice if there was some control of the screen background color or at least an implementation of a warmer background. Recent studies suggest adverse effects, particularly regarding getting good sleep, from using electronic devices with bright-white or bluish screens (disrupts melatonin production in the body). This is one (of the few in my opinion) advantages of Kindle Fire and Kindle for Android, where several text background colors are available).I highly recommend Voyage - the new king of e-readers."
    },
    {
      "reviews.date": "2018-05-09T00:00:00.000Z",
      "reviews.id": "9c175bf3-9a3b-42c6-935a-f54bca405d18",
      "reviews.rating": 5,
      "reviews.text": "Nightlight allows me to read at night when the wife is sleeping"
    },
    {
      "reviews.date": "2015-01-22T00:00:00.000Z",
      "reviews.id": "ba560626-570f-466f-b07a-f431217e9afb",
      "reviews.rating": 4,
      "reviews.text": "The Voyage is easily the best kindle avaiailable. The page turn buttons are a little wonky a times, but I find the high-res screen worth it."
    },
    {
      "reviews.date": "2016-09-24T00:00:00.000Z",
      "reviews.id": "da53da7e-2a62-4136-ba1e-fa3d9641ac8d",
      "reviews.rating": 5,
      "reviews.text": "This is my third Kindle and the best one yet. Love the new controls, the backlit page, the compact size and the ease of use. I would recommend the Kindle Voyage to all readers!"
    },
    {
      "reviews.date": "2014-11-29T00:00:00.000Z",
      "reviews.id": "8d7576cc-4ae8-4723-bf92-9490daa0aa5c",
      "reviews.rating": 5,
      "reviews.text": "This is the best kindle yet. Very sharp text and easy page management."
    },
    {
      "reviews.date": "2015-01-23T00:00:00.000Z",
      "reviews.id": "6ebede8e-c992-4002-a6a7-62bec3f3949b",
      "reviews.rating": 4,
      "reviews.text": "Upgraded from a paperwhite and the build quality of this unit is much, much better! Just it's kind of expensive for an e-reader."
    },
    {
      "reviews.date": "2015-04-17T00:00:00.000Z",
      "reviews.id": "fe07a207-c80e-4a97-a197-37b4771e4b53",
      "reviews.rating": 5,
      "reviews.text": "This is my third Kindle, plus I have used the Kindle app on my two iPads and three iPhones. I always want to have a real Kindle so I will read in peace and avoid distraction from email, texts and such.This is much more readable that all of the previous models. The resolution is as good as I could ever want. The lighting is perfectly even and makes reading in any light (or lack of) completely comfortable. The screen response is almost perfect, but I am just getting use to the new side areas to turn pages. I love the weight and can read in any position, including on my back in bed, with one hand.I am perfectly fine with paying $200 for this Kindle. If you want something to read your books, and nothing else, this is the product for you."
    },
    {
      "reviews.date": "2015-08-05T00:00:00.000Z",
      "reviews.id": "111e4b30-ca10-4015-84a1-2144d80f9be7",
      "reviews.rating": 5,
      "reviews.text": "I first bought the Kindle Paperwhite with the 300dpi screen, I didn't think the jump to the Voyage was worth the $80 plus additional taxes. I read about the Voyage and with Georgia having the back to school tax free days and the e-readers qualifying I returned the Paperwhite and purchased this one. Boy am I glad I did."
    },
    {
      "reviews.date": "2016-07-22T00:00:00.000Z",
      "reviews.id": "7016ef13-3466-4ad8-b8fd-5d0526b220d7",
      "reviews.rating": 5,
      "reviews.text": "The Amazon voyage really is a fantastic ereader. Prior to owning this tablet, I had a couple of PW2's which are great tablets in their own right. My wife knew that I had my eye on the Kindle Voyage but I was waiting to catch it during one of Amazon's rare sales events. Unfortunately my wife ended up buying it for me for Father's Day and I planned to take it back and wait for a sale but after comparing it to my PW2 side by side, I decided I couldn't wait for it to get cheaper and so I kept it. The PW2 is a great ereader (ended up giving it to my oldest son) but the Voyage is more crisp and the backlighting is quite a bit whiter. It's also a couple of ounces lighter and slimmer. Is it worth the upgrade? Definitely, if you can get it on sale (usually $150). At $199? Well, that's up to you. Obviously I paid full freight and I don't regret it.....much. :) With that being said, the PW3 is worth a look too. Same 300 ppi clarity but usually $80 to $100 cheaper. The Voyage has a bezel that's flush with it's glass so it's not the \"crumb catcher\" paperwhite is but hey, maybe you want to skip eating while you're reading and save the dough!"
    },
    {
      "reviews.date": "2015-07-29T00:00:00.000Z",
      "reviews.id": "3b6e8323-72a8-4a13-a42c-71ca827d115b",
      "reviews.rating": 5,
      "reviews.text": "Great day reading. The backlight works great in the day as well. It is nice to have enough light to read wherever you are. The batterry life is also long"
    },
    {
      "reviews.date": "2014-12-22T00:00:00.000Z",
      "reviews.id": "455a2e11-30ac-467c-ab53-fe6cd3798abc",
      "reviews.rating": 5,
      "reviews.text": "I have owned exactlo, nooks, kobo's and kindles. This is the Cadillac of readers!!!"
    },
    {
      "reviews.date": "2014-11-22T00:00:00.000Z",
      "reviews.id": "a34bac88-b896-475f-88b8-36b76bcd5a37",
      "reviews.rating": 5,
      "reviews.text": "This is the very best devise to read from. The print is one hundred percent book like. The device is light, elegant and a pleasure to use. There is nothing that comes close."
    },
    {
      "reviews.date": "2015-04-03T00:00:00.000Z",
      "reviews.id": "ac6df8a8-87bb-4061-ac5a-eadc25f17b61",
      "reviews.rating": 5,
      "reviews.text": "What could be better than a book? A Kindle Voyage! This wonderful device is easier to carry around than a book. Whenever I need to wait a few minutes, I whip out my Kindle. It is clear, it works for a long time without recharging, and it receives new books instantly. I had been using an Ipod with audio books for a long time but I got tired of the difficulty in searching for material. It also lost my place unless I was extremely careful. This device is lightweight and slips easily into my handbag or pocket. I also bought the Origami case - with it, the Kindle comes on automatically when it is opened. A great and useful device - I love it!"
    },
    {
      "reviews.date": "2015-07-15T00:00:00.000Z",
      "reviews.id": "20453506-9e15-4cf0-9e9e-caef1ccf1708",
      "reviews.rating": 5,
      "reviews.text": "The extra money for the Voyage version is well worth it, as the screen is brighter, clearer, and easier on the eyes. The other specs are also nicer compared to other Kindle versions, but the screen is what sold me."
    },
    {
      "reviews.date": "2017-07-07T00:00:00.000Z",
      "reviews.id": "3ee75dfc-a60b-4713-af9b-6e34ee3a4ded",
      "reviews.rating": 5,
      "reviews.text": "It is better than in thought it was. At first I didnt like how small the screen was, but then the conistent reading, it got much better. After a month i it grew on me."
    },
    {
      "reviews.date": "2017-10-13T00:00:00.000Z",
      "reviews.id": "5d2e0f62-f50d-464e-8f9f-4516673534c7",
      "reviews.rating": 5,
      "reviews.text": "If you're planning on reading at nighttime or with dimmed lights, I recommend going with Voyage, because PaperWhite has some blue hot spots of light on the bottom of the screen. This one doesn't. Really awesome device, same as PaperWhite for reading in sunlight. My honest opinion, even better than an actual book in your hand.Sometimes it feels like the refresh rate is slow, but you can get used to it. This is not the same LCD screen as you're used to.Very easy to set up, but you definitely need an Amazon account."
    },
    {
      "reviews.date": "2016-07-26T00:00:00.000Z",
      "reviews.id": "4890ab71-7693-44fd-a86f-991c52cfe807",
      "reviews.rating": 5,
      "reviews.text": "The voyage is lighter, and thinner than the paperwhite. I love it!"
    },
    {
      "reviews.date": "2015-04-23T00:00:00.000Z",
      "reviews.id": "a4b706db-8f59-4d91-b2b4-93da7ca41156",
      "reviews.rating": 5,
      "reviews.text": "Bought this for my wife who loves books. She was always agents ebooks but now she can't be without it."
    },
    {
      "reviews.date": "2016-11-19T00:00:00.000Z",
      "reviews.id": "17876e4d-2a10-4904-a6e3-e763ad42bca4",
      "reviews.rating": 4,
      "reviews.text": "I love my Kindle Voyage, however it does not have a speaker for audio books. and changes settings ie. remaining time/pages left in book on it's own."
    },
    {
      "reviews.date": "2016-01-09T00:00:00.000Z",
      "reviews.id": "11748149-a6a6-4b86-ad52-68c68009a359",
      "reviews.rating": 5,
      "reviews.text": "When you compare the Kindle Voyage 6's Screen to the other model. The Screen was brighter for reading"
    },
    {
      "reviews.date": "2017-02-13T00:00:00.000Z",
      "reviews.id": "989dbd65-f370-482a-a38b-d078c8722dad",
      "reviews.rating": 5,
      "reviews.text": "I've always been a reader and an early technology adopter but until now I've resisted moving to electronic media when reading for pleasure. Now I wish I hadn't waited so long. Reading at night with the lights off and instantly downloading a new book are my favorite aspects."
    },
    {
      "reviews.date": "2016-09-23T00:00:00.000Z",
      "reviews.id": "b0ee6980-1d6e-46c1-bc07-09d3d2b5542e",
      "reviews.rating": 2,
      "reviews.text": "i cant at night it has no back light from one to ten its a 7"
    },
    {
      "reviews.date": "2016-02-06T00:00:00.000Z",
      "reviews.id": "044dbb12-cd39-4c43-aa2c-1cc3147cc3e4",
      "reviews.rating": 4,
      "reviews.text": "This Kindle is really light weight and has an excellent screen that dims or brightens automatically. Very comfortable to hold and read. I like that it has page advance buttons on both sides including the touch screen finger swipe to advance."
    },
    {
      "reviews.date": "2015-04-29T00:00:00.000Z",
      "reviews.id": "0bdbe235-a063-47e3-b858-fb772d8eefc8",
      "reviews.rating": 5,
      "reviews.text": "Reading on my commute, or in a waiting room, is a pleasant way to pass time - and convenient"
    },
    {
      "reviews.date": "2015-09-11T00:00:00.000Z",
      "reviews.id": "91ae2f03-a23b-4bdb-807f-faf38a4f4050",
      "reviews.rating": 5,
      "reviews.text": "Great way to read books. The screen is readable in any light. Add a waterproof case and you have the perfect beach or pol side library!"
    },
    {
      "reviews.date": "2016-10-02T00:00:00.000Z",
      "reviews.id": "4bf78fd8-0caa-44c1-a600-4dd4ca83505d",
      "reviews.rating": 3,
      "reviews.text": "turning pages not as easy as the original ones; whole Home Page experience not really user friendly, and seems geared to just sell you more books."
    },
    {
      "reviews.date": "2016-09-06T00:00:00.000Z",
      "reviews.id": "055e5fa8-6acc-4002-b8a5-60969a910847",
      "reviews.rating": 5,
      "reviews.text": "This is my very first kindle. I am enjoying reading more books. The size is quite comfortable as well as the weight. The battery life is quite good. If you're looking for a new way to read book this is definitely the one."
    },
    {
      "reviews.date": "2014-11-04T00:00:00.000Z",
      "reviews.id": "77fc16c3-2341-49a0-9420-2626e6f16e42",
      "reviews.rating": 5,
      "reviews.text": "This was actually for my daughter and she has rarely put it down since she got it."
    },
    {
      "reviews.date": "2015-04-15T00:00:00.000Z",
      "reviews.id": "120dfe75-d8c2-4bba-8416-23357738b2b6",
      "reviews.rating": 4,
      "reviews.text": "After dropping my Kindle with a keyboard (not techie enough to know which generation it was) I did plenty of research before getting my next Kindle.I wanted a dedicated ebook as I don't want distractions when I read. Let's make this simple:I have read in sunlight and there have been no problems with glare.The automatic light makes it great for night reading.It took a while to get used to the buttons, but after my last Kindle, this was a feature I really wanted. I like them.I have read only three books on the Kindle so far and I still haven't mastered the touch of getting it to do what I want when I want. I am fighting it to highlight, and tap like a madman to change between page number and time left in the chapter/book (which are features I love).Excellent reader. I would purchase again, but I can't say with any honesty that the extra $100 was worth it over the Paperwhite, but I have no experience with that model either. I do like this more than my last Kindle, so that is all that really matters."
    },
    {
      "reviews.date": "2014-12-26T00:00:00.000Z",
      "reviews.id": "84232d2a-b325-49cf-90ef-19ca8629f720",
      "reviews.rating": 5,
      "reviews.text": "Product was as described and delivered on time as scheduled."
    },
    {
      "reviews.date": "2015-05-31T00:00:00.000Z",
      "reviews.id": "ffae5ba1-f861-4c84-84c1-ea1d162613a0",
      "reviews.rating": 1,
      "reviews.text": "Very disappointed that my Kindle Voyage, purchased in April, failed after just two uses. Went to charge it tonight to take on a business trip and it won't charge, won't reset, etc. Since my Best Buy receipt says I only have 15 days to return it, tried calling Amazon support. Their only solution after over 30 minutes on the phone is to process a replacement which may be a new or may be a refurbished device-- unacceptable to replace a less than 2-month old device with a refurbished one... but, given the poor experience I've had with the Voyage, I'm not even comfortable with a 'new' replacement at this point. Amazon says they can't do anything about a refund because I purchased from Best Buy-- 15 days seems a little extreme in a situation like this with a defective product!Stuck with a $200 paperweight :-("
    },
    {
      "reviews.date": "2016-05-24T00:00:00.000Z",
      "reviews.id": "f1595e53-a155-443a-b878-1fb81be9331a",
      "reviews.rating": 4,
      "reviews.text": "I will start off with the fact that I like paper books a lot. I bought the e reader because it's light and can travel with multiple books. The interface is fairly easy to use and it holds a lot of books. The automatic light feature doesn't work as nicely as I would. Overall I am happy with the purchase but there are features that could make it a 5."
    },
    {
      "reviews.date": "2016-07-29T00:00:00.000Z",
      "reviews.id": "9bc717fe-2bc7-4993-ab3f-6d8b56cd4ada",
      "reviews.rating": 5,
      "reviews.text": "The voyage is so much easier on the eyes. The size is great and easy to carry in a briefcase for travel purposes."
    },
    {
      "reviews.date": "2015-02-03T00:00:00.000Z",
      "reviews.id": "d0777c93-6f28-4056-af8b-434773f9d0d1",
      "reviews.rating": 4,
      "reviews.text": "I like everything about the Voyage reader. It has a crisp display, is small and lightweight. I give it four stars instead of five because the screen light takes sometimes a while to adjust. The battery life is amazing. Prize could be a little less."
    },
    {
      "reviews.date": "2017-03-03T00:00:00.000Z",
      "reviews.id": "c467e476-b8e2-4423-acc2-2ae068a55843",
      "reviews.rating": 5,
      "reviews.text": "Easy to carry; easy to read. Easy to get books and download. Nice to have a dictionary within your book. Able to download books, newspapers or magazines."
    },
    {
      "reviews.date": "2017-06-07T00:00:00.000Z",
      "reviews.id": "e4002d4c-4621-4bd0-b86f-ac519d9d5752",
      "reviews.rating": 5,
      "reviews.text": "I love how easy the Kindle is to operate. It is very intuitive, and requires only a short learning curve. Also it is one of the most economical ways to read books."
    },
    {
      "reviews.date": "2015-04-17T00:00:00.000Z",
      "reviews.id": "cfaa4541-6952-44d6-b7f6-a4a9b7546cca",
      "reviews.rating": 5,
      "reviews.text": "Easy to read screen in a small light package. Excellent battery life and even fits into my work pockets."
    },
    {
      "reviews.date": "2015-08-14T00:00:00.000Z",
      "reviews.id": "f00aaa9d-0bf1-46de-8f64-ee3533f2033e",
      "reviews.rating": 3,
      "reviews.text": "Clear reading in bright light outdoor settings. Long battery life."
    },
    {
      "reviews.date": "2015-08-29T00:00:00.000Z",
      "reviews.id": "622ef26d-53b8-42ff-90dd-3fc189eab276",
      "reviews.rating": 4,
      "reviews.text": "Bought this for vacations at the beach - easy to read in the sulight."
    },
    {
      "reviews.date": "2015-04-03T00:00:00.000Z",
      "reviews.id": "0f3861b1-33f7-4517-96b6-47921768cbe3",
      "reviews.rating": 5,
      "reviews.text": "Out of the box there really is nothing to do but plug it in to the USB drive and you're ready to go. You get a pop up reminder asking if you want to use the drive as a back up. If you select yes or no that will be the last time you see it. If you say \"decide later\" it will come up each time you plug it in to the USB drive."
    },
    {
      "reviews.date": "2016-01-16T00:00:00.000Z",
      "reviews.id": "7b629e2a-4add-4a20-9c21-5367f40034be",
      "reviews.rating": 5,
      "reviews.text": "Easy to use and easy to order books. Now I just have to join amazon prime for the lending library and look into the books i haven't read but want to."
    },
    {
      "reviews.date": "2016-09-10T00:00:00.000Z",
      "reviews.id": "00a5dfd6-29ca-4b08-869c-6377d203d2b9",
      "reviews.rating": 5,
      "reviews.text": "Great item, easy to use,would recommend to anybody want to use!"
    },
    {
      "reviews.date": "2016-01-23T00:00:00.000Z",
      "reviews.id": "4aed701c-099c-4afd-8fa0-0acccd8c6d77",
      "reviews.rating": 5,
      "reviews.text": "It makes reading at night much easier. Easy access to books that are of interest."
    },
    {
      "reviews.date": "2016-10-15T00:00:00.000Z",
      "reviews.id": "8aa0dfbd-784e-48c5-9125-1af4518de74f",
      "reviews.rating": 4,
      "reviews.text": "E-Reader battery doesn't hold up as long as stated."
    },
    {
      "reviews.date": "2015-07-22T00:00:00.000Z",
      "reviews.id": "b2d0cfc3-df26-4656-90ae-f407a5faa36d",
      "reviews.rating": 5,
      "reviews.text": "I bought one for my Dad, liked it so much I bought one for myself. Even better than the paperwhite."
    },
    {
      "reviews.date": "2015-07-13T00:00:00.000Z",
      "reviews.id": "6363c959-48e9-41df-9a2f-298903772e18",
      "reviews.rating": 5,
      "reviews.text": "Even though it is a little pricy, I like my new Kindle Voyage. It looks smaller, but it is because it's only the screen - no buttons. It is lightweight. You can scroll and turn pages with touch screen press or with physical small buttons on the side. It is automatically adjusts to different light conditions."
    },
    {
      "reviews.date": "2016-01-16T00:00:00.000Z",
      "reviews.id": "d03f1051-f74f-48c5-8b88-6ba4d09e8110",
      "reviews.rating": 4,
      "reviews.text": "The Kindle was as a replacement for an earlier model. Its performance and ease of use are superb However, the battery life is far shorter than my older version. It wouldn't last from LA to Frankfort and the old one did."
    },
    {
      "reviews.date": "2014-11-16T00:00:00.000Z",
      "reviews.id": "5859d560-c4b7-4c2f-8774-96b4c4bc4c57",
      "reviews.rating": 4,
      "reviews.text": "I am a big fan of e-readers. I prefer the e-ink screens over tablet screen when reading books. I decided to pick up the new Kindle Voyage. Here are my thoughts.First, the Kindle is much sleeker and lighter than the Paperwhite model. It's very easy to hold for a long length of time without getting tired.Secondly, the addition of the page turn buttons is a welcomed addition. The buttons make it so easy to hold the Kindle with one hand and turn pages.Lastly the screen. I marked off a star because I had to return my first Voyage directly to Amazon because the top half of the screen had a yellow tint to it that was very distracting while reading. The replacement Kindle Voyage that I received had a perfect screen and the 300 ppi looks amazing. That being said, Amazon needs to really focus on quality control because I've read that the yellow tint on the screen is a common issue. If you're spending $200 for an e-reader, then the screen should be perfect. Especially since this is the 3rd generation of the lighted screens for the e-readers.If you're an avid reader, then the Kindle Voyage would be a worthy upgrade to make. If you're a casual reader who has a Paperwhite, you're probably okay with what you have."
    },
    {
      "reviews.date": "2016-02-26T00:00:00.000Z",
      "reviews.id": "787bb614-90ee-492b-84bf-67ca8849fd62",
      "reviews.rating": 5,
      "reviews.text": "I purchased this Kindle because I wanted the buttons on the side -- I prefer to hold my e-reader in just my left hand and it's hard to turn pages by screen press only. I love this so far! It's an upgrade from my Nook because it's so much easier to borrow books from the library! I've never used a Paperwhite so I can't speak as to how it's better, other than it has the side-press buttons (which was worth it to me)."
    },
    {
      "reviews.date": "2014-12-31T00:00:00.000Z",
      "reviews.id": "93db2c49-e9e6-41ff-b36c-8f0340e60df7",
      "reviews.rating": 5,
      "reviews.text": "Couldn't be happier with this latest Kindle e-reader! Love being able to turn pages by pushing a button and the bright uniform lighting! It's a big step up from my first generation paperweight!"
    },
    {
      "reviews.date": "2016-06-06T00:00:00.000Z",
      "reviews.id": "8c884a96-e6e9-499d-8ea1-a397868391f1",
      "reviews.rating": 5,
      "reviews.text": "Lightweight, bright screen, adequate capacity, great battery life. The perfect stand alone eReader."
    },
    {
      "reviews.date": "2015-07-29T00:00:00.000Z",
      "reviews.id": "edcbe495-4c20-460d-a0f7-d36678ee35c6",
      "reviews.rating": 5,
      "reviews.text": "Perhaps the best ereader made until now. Fantastic reading experience."
    },
    {
      "reviews.date": "2016-02-27T00:00:00.000Z",
      "reviews.id": "6318b859-81b3-4f9d-bb2a-8ab5c4d64939",
      "reviews.rating": 5,
      "reviews.text": "Reading on the voyage is such a pleasure. Its so much more convenient than carrying around an actual book. I love that I can read in bed without disturbing my partner. The backlight makes reading a pleasure whether in the dark or outside in the sun. Truly well worth the price if you are a serious reader. I love having several books available so I never run out of reading material while at the doctors or on a plane......"
    },
    {
      "reviews.date": "2017-09-23T00:00:00.000Z",
      "reviews.id": "09fadd92-556c-4736-a303-f7b1e5e93230",
      "reviews.rating": 5,
      "reviews.text": "This is my second Kindle Voyage. I dropped the first one and broke the glass screen, so I bought a new one. I highly recommend the Voyage but also recommend buying a good protective cover and an extended warranty. ;-)"
    },
    {
      "reviews.date": "2016-04-17T00:00:00.000Z",
      "reviews.id": "b6976e87-d4cd-4b6c-b68a-7b9223d8439b",
      "reviews.rating": 5,
      "reviews.text": "Hands down this is the best ereader that you can buy..."
    },
    {
      "reviews.date": "2015-04-24T00:00:00.000Z",
      "reviews.id": "63422ed7-beb8-4080-8a62-f1c5ba7f0f07",
      "reviews.rating": 4,
      "reviews.text": "The voyage is a great e reader for the avid reader. It's not a tablet so don't expect features of an internet tablet. However the auto-adjust backlight feature & minimal flash between pages makes it ideal for readers. This version includes the vocabulary builder, which I find myself using a lot nowadays. However, I'm not sure why it's more expensive than the paperwhite. That's the one I actually wanted but my local store was out of stock. I thought it included the 3g so you can download even when away from wifi but it doesn't. So that's why I'm confused on the price difference. The overall feel of it is fine. Not a lot thinner than the original. I keep mine in a case and whenever it goes idle I have to take it out of the case just to press the power button, which is pretty inconvenient. Oh and it freezes when charging which made me extremely nervous the first time because I thought it was broken but I just held the power button for like ten seconds and it was fine... other than those very minor complaints,I love it. I find myself reading way more than watching tv these days so that's always a plus!"
    },
    {
      "reviews.date": "2014-11-05T00:00:00.000Z",
      "reviews.id": "a86fe218-6a29-4b4e-8ec0-35105ff1ea6c",
      "reviews.rating": 5,
      "reviews.text": "As usual Amazon does it again. Fabulous ereader. Love the auto adjustment of the on board light!"
    },
    {
      "reviews.date": "2016-09-09T00:00:00.000Z",
      "reviews.id": "9db9b4f3-2cdd-47dc-947f-c71c1efedae7",
      "reviews.rating": 5,
      "reviews.text": "I thoroughly enjoy the product it is really great and the best ever build by any company."
    },
    {
      "reviews.date": "2016-12-31T00:00:00.000Z",
      "reviews.id": "4467c525-3963-4628-b5f2-231a242a770f",
      "reviews.rating": 5,
      "reviews.text": "This is third Kindle product and the size, battery life and readability have improved with each new generation. Very happy with product and will continue to purchase in the future as new versions become available."
    },
    {
      "reviews.date": "2016-11-16T00:00:00.000Z",
      "reviews.id": "5d3fafb5-b986-446f-a5bb-2859f8e674de",
      "reviews.rating": 5,
      "reviews.text": "Much better resolution than previous version and easier to use!"
    },
    {
      "reviews.date": "2016-01-03T00:00:00.000Z",
      "reviews.id": "44c55686-61b2-4689-9394-b87fa4c6db20",
      "reviews.rating": 5,
      "reviews.text": "This was on my wife's Christmas list. She loves it. Easy to use."
    },
    {
      "reviews.date": "2015-01-19T00:00:00.000Z",
      "reviews.id": "3a33e60a-1564-4daf-9c46-a86a074d23c0",
      "reviews.rating": 5,
      "reviews.text": "Everything about it is outstanding except the price!"
    },
    {
      "reviews.date": "2018-03-21T00:00:00.000Z",
      "reviews.id": "d4e518ee-0bb7-4b6e-853a-f3eeedf17191",
      "reviews.rating": 5,
      "reviews.text": "The Kindle voyager is absolutely a best product for reading ebooks. The product is easy to read in all types of light. I also like the ability to get word definitions and the expansion or text ability."
    },
    {
      "reviews.date": "2017-01-18T00:00:00.000Z",
      "reviews.id": "c15642ac-3535-4c92-aaf3-b9a5a321f203",
      "reviews.rating": 5,
      "reviews.text": "We got this for my wife to take with her when travelling. Although she still prefers printed books, she really likes this reader and it lightens her suitcase considerably. Excellent battery life and a good screen."
    },
    {
      "reviews.date": "2015-06-19T00:00:00.000Z",
      "reviews.id": "de4d442d-d7e1-4c16-88c5-c4a98d63ab6c",
      "reviews.rating": 5,
      "reviews.text": "Bought the original paper white and loved it. Even though there is not a tremendous difference between the two units, I have found that it is lighter and adjusts to light much better. Is it really worth the price difference is questionable. I would recommend this product to any avid reader."
    },
    {
      "reviews.date": "2014-10-25T00:00:00.000Z",
      "reviews.id": "838f0b6f-3065-4006-8c8a-e070de755e79",
      "reviews.rating": 5,
      "reviews.text": "I am a gadget guy and a big fan of tablets and e-ink readers. They each have their specialties and purposes, and e-readers are still best for reading. I have bitten a kindle supporter from the beginning, this latest model only further improves on that reputation.The back lighting is awesome and the touch screen is amazing. The clarity and definition is outstanding. I was do excited waiting for this to be released and was very pleased with the results!"
    },
    {
      "reviews.date": "2017-06-22T00:00:00.000Z",
      "reviews.id": "7b251891-ee7c-48dc-ba4c-5d97996be333",
      "reviews.rating": 5,
      "reviews.text": "I had to ask for help because they don't keep this model on display, it's \"behind the counter\". But other than that, in-store was a breeze. And the product exceeds my expectations. Although, it would be even better if it was waterproof--- but it does perfectly fit into a medium baggie."
    },
    {
      "reviews.date": "2015-09-18T00:00:00.000Z",
      "reviews.id": "b6f34c0b-51dc-4560-a101-f2a10ce16187",
      "reviews.rating": 5,
      "reviews.text": "The light from the page does not but a strain on your eyes when reading. I like how light it is to hold."
    },
    {
      "reviews.date": "2015-02-03T00:00:00.000Z",
      "reviews.id": "fd5c52e2-e6ac-449a-adb4-fbca466815ac",
      "reviews.rating": 5,
      "reviews.text": "The auto light adjust has worked great for me and I love the different options for page turning. Also, the smaller size and lighter weight is noticeable. If you are buying your first Kindle, I would recommend this. If you already have the Paperwhite, it's up to you but I've been happy I upgraded."
    },
    {
      "reviews.date": "2016-05-31T00:00:00.000Z",
      "reviews.id": "a11ea0f1-4a65-4ef5-b23e-004bd72e5f30",
      "reviews.rating": 5,
      "reviews.text": "Having had several models of Kindle readers, I can say that this is the best yet and is definitely worth the extra cost."
    },
    {
      "reviews.date": "2014-11-04T00:00:00.000Z",
      "reviews.id": "b2bb6b64-ee63-4eac-afb0-0216161c586c",
      "reviews.rating": 5,
      "reviews.text": "I can hold this next to my Kindle Paperwhite and see that is brighter, more evenly lit, sharper and faster. But $200 is pushing the price a little high. If a friend wasn't looking to buy my old one, not sure I would have paid that much."
    },
    {
      "reviews.date": "2016-06-13T00:00:00.000Z",
      "reviews.id": "d59dcd5f-3529-4bd0-94d5-bef0be035a92",
      "reviews.rating": 3,
      "reviews.text": "The Kindle is great for just reading books, and the battery power is pretty good.The experimental browser is not very user friendly."
    },
    {
      "reviews.date": "2014-10-27T00:00:00.000Z",
      "reviews.id": "a0ab519c-45d1-4441-a2b0-3306e3fe0bf7",
      "reviews.rating": 4,
      "reviews.text": "The newest Kindle eReader (Voyage) is a very good upgrade over the current model. It has several new hardware & coming software enhancements over the current model. However, unless you do an extreme amount of reading, I would not recommend upgrading if you owned the current PaperWhite generation. The high price does not justify it."
    },
    {
      "reviews.date": "2015-12-28T00:00:00.000Z",
      "reviews.id": "13d1f26b-f3bf-4fb4-a1eb-e2522257ed78",
      "reviews.rating": 5,
      "reviews.text": "Got this for my pre teen who took to it like a duck to water. It is great size and easy to pack"
    },
    {
      "reviews.date": "2015-04-09T00:00:00.000Z",
      "reviews.id": "f132eed7-04f4-4b14-9d61-b530edad05ad",
      "reviews.rating": 5,
      "reviews.text": "If you are in doubt about spending the extra money to buy the Voyage... don't be. If it hadn't been a gift I would have most like not spent the money but after using it I am so glad I have this one."
    },
    {
      "reviews.date": "2014-12-31T00:00:00.000Z",
      "reviews.id": "851b1b51-56b1-42b6-bdac-f5de24333796",
      "reviews.rating": 5,
      "reviews.text": "While generally a minor upgrade from the paperwhite, it's just the best e-reader on the market. X-ray seemed unnecessary until I was reading game of thrones and forgot who certain people were. The choice to swipe or pinch to change pages is nice too. It's a great device though if you're on a budget you would do fine with the last version."
    },
    {
      "reviews.date": "2015-03-13T00:00:00.000Z",
      "reviews.id": "1e64e044-0a15-4ba3-b4d3-e5bc966db936",
      "reviews.rating": 5,
      "reviews.text": "Fantastic E-Reader. Battery lasts a few weeks on a single charge (if you leave wifi turned off). Feels great in your hands. Is very lightweight."
    },
    {
      "reviews.date": "2016-12-02T00:00:00.000Z",
      "reviews.id": "c28ed6ee-94ac-400a-9bae-f06b75881479",
      "reviews.rating": 5,
      "reviews.text": "This E-reader makes reading ebooks very easy on the eyes and provides for a beautiful experience. The product feels like quality but gathers finger print marks on the back quickly if it doesn't have a case. Overall the e-reading experience is excellent though as the lighting and colors come across very pleasantly."
    },
    {
      "reviews.date": "2015-06-24T00:00:00.000Z",
      "reviews.id": "8e11cea0-28c8-4ed6-8842-12d9af233285",
      "reviews.rating": 5,
      "reviews.text": "Love the back light, fast response to changing pages. The kindle voyage is lite."
    },
    {
      "reviews.date": "2014-10-26T00:00:00.000Z",
      "reviews.id": "1ab4f1aa-5106-4be2-b870-74736d9ca3a8",
      "reviews.rating": 5,
      "reviews.text": "Best e reader yet ! The new voyage is much better then the first Paperwhite which was great !"
    },
    {
      "reviews.date": "2017-11-15T00:00:00.000Z",
      "reviews.id": "dd593389-0edc-4490-8ff2-93bddf6f2c12",
      "reviews.rating": 5,
      "reviews.text": "My wife won't put this thing down! She's an elder with poor vision but manages to read this."
    },
    {
      "reviews.date": "2015-08-03T00:00:00.000Z",
      "reviews.id": "fb2e1e83-6692-4490-bb1e-308a2486cc54",
      "reviews.rating": 5,
      "reviews.text": "This is my favorite kindle so far. The size is perfect and the weight is minimal. I love the fact it is back lit and I don't need a book light."
    },
    {
      "reviews.date": "2016-09-23T00:00:00.000Z",
      "reviews.id": "9b7a2ce7-f5b3-4c10-8694-90aca63caa09",
      "reviews.rating": 5,
      "reviews.text": "Exceeded my expectation. Easy to read, books load and store with ease ! Great for saving space for avid reader. I can travel with many books dont have to worry about space"
    },
    {
      "reviews.date": "2016-01-23T00:00:00.000Z",
      "reviews.id": "53af0fdf-8e24-4628-ac74-830c078972a0",
      "reviews.rating": 4,
      "reviews.text": "This kindle is a great buy, pretty simple to use, very convenient."
    },
    {
      "reviews.date": "2016-05-13T00:00:00.000Z",
      "reviews.id": "8978696b-2355-47b7-83b8-6842bfe8e65b",
      "reviews.rating": 5,
      "reviews.text": "I also have a Nook Glow but I miss having buttons. The \"squeeze the edge\" for a page turn is what sold me."
    },
    {
      "reviews.date": "2015-11-20T00:00:00.000Z",
      "reviews.id": "e5bcd5b5-e4ac-4392-84ac-5fbbaadc3d7b",
      "reviews.rating": 5,
      "reviews.text": "What a fun toy this is! It was easy to learn to use, and If I needed help, the online User's Guide is right there. Purchasing books couldn't be easier, and there's no \"hard copy\" to dispose of when you'e done. I was able to check out a book from the public library with little effort. With so many low-cost or no-cost books, as well as current best sellers, there's an endless number to choose from. You can use the search function to search by topic or title. I like using a stylus pen on the touch screen for that. I know I will enjoy my Kindle Voyage for a long time."
    },
    {
      "reviews.date": "2016-12-13T00:00:00.000Z",
      "reviews.id": "26bc4a03-062f-4ab5-95e4-325692c1ce10",
      "reviews.rating": 5,
      "reviews.text": "Neighbor has one, and just loves it. So I bought one."
    },
    {
      "reviews.date": "2017-08-16T00:00:00.000Z",
      "reviews.id": "93db6d71-d6d4-40a9-b5cf-870d6b3e72e7",
      "reviews.rating": 5,
      "reviews.text": "Got this for a relative, and he really likes it. It was pricey for what it is though."
    },
    {
      "reviews.date": "2015-10-02T00:00:00.000Z",
      "reviews.id": "9d8693bb-1c1e-470e-a861-65d9196bbf45",
      "reviews.rating": 5,
      "reviews.text": "Very good quality product. I bout as a gift for a friend, she loved it"
    },
    {
      "reviews.date": "2015-07-12T00:00:00.000Z",
      "reviews.id": "f6264d9d-960c-439c-a9d7-ca2984e82297",
      "reviews.rating": 5,
      "reviews.text": "I love to read books....paper and electronic (via my iPad), but had never owned a Kindle. When shopping at Best Buy, I mentioned to my husband that I might want to try a Kindle....went to another area and, when I returned, the Kindle VOYAGE was in our basket. OK so I though I would give it a try. I LOVE it! So compact, so easy to read my books and turn the pages without swiping or ??? I highly recommend the VOYAGE to existing and pending Kindle readers. So many great features in such a small package!"
    },
    {
      "reviews.date": "2017-05-03T00:00:00.000Z",
      "reviews.id": "9023626c-6b75-4870-b34d-50dab0155411",
      "reviews.rating": 5,
      "reviews.text": "As a nook user, I had to make a change, so I tried the kindle. It is good."
    },
    {
      "reviews.date": "2016-05-22T00:00:00.000Z",
      "reviews.id": "c44a704a-86bb-44e9-bbd0-7017cd20e0db",
      "reviews.rating": 4,
      "reviews.text": "I had the paperwhite, but this voyage is definitely better. The quality is better, screen is seamless with the edge, which makes it feel premium and delivers more comfortable reading experience. Lighter than the paperwhite, love the pressure sensors to change pages. Overall better experience reading experience than the paperwhite."
    },
    {
      "reviews.date": "2016-09-03T00:00:00.000Z",
      "reviews.id": "ed203f71-5976-444c-8baf-43a22be3c432",
      "reviews.rating": 5,
      "reviews.text": "My wife has had several Amazon Fire tablets. They all have one major flaw. Visibility in direct sunlight. This product addresses that issue. The Paper White screen is perfect for the days at the pool"
    },
    {
      "reviews.date": "2014-12-11T00:00:00.000Z",
      "reviews.id": "6933fa5a-9ec9-4075-b0ca-00ef5af728ec",
      "reviews.rating": 5,
      "reviews.text": "already toldpeople about fast pickup.the kindle is great as always."
    },
    {
      "reviews.date": "2015-06-20T00:00:00.000Z",
      "reviews.id": "04374d48-7f88-4b6a-b98d-74dca18b4172",
      "reviews.rating": 5,
      "reviews.text": "This was a gift for my wife who loves to read. She has the Kindle Fire and enjoys it. Her wishes were to have a smaller lighter reader that is also good to ready outside. She found it with the Voyage."
    },
    {
      "reviews.date": "2015-08-15T00:00:00.000Z",
      "reviews.id": "9b5461e2-6425-4b04-af91-5fb9b4433d20",
      "reviews.rating": 4,
      "reviews.text": "Was a gift. The receiver really enjoys it and was an upgrade from her previous kindle"
    },
    {
      "reviews.date": "2015-04-24T00:00:00.000Z",
      "reviews.id": "ee66101e-9009-44f7-910a-1659e5061485",
      "reviews.rating": 4,
      "reviews.text": "Good for leisure/reading for fun. Not for students."
    },
    {
      "reviews.date": "2016-12-09T00:00:00.000Z",
      "reviews.id": "a8af659d-56ea-439d-a731-04aa5c78481e",
      "reviews.rating": 4,
      "reviews.text": "Good for reading white and blackScreen is still small"
    },
    {
      "reviews.date": "2015-05-22T00:00:00.000Z",
      "reviews.id": "192aa110-55ed-4c26-96fd-df0d3caf40e6",
      "reviews.rating": 4,
      "reviews.text": "Small and light weight, easy to read from in bright light conditions"
    },
    {
      "reviews.date": "2017-09-16T00:00:00.000Z",
      "reviews.id": "089e417e-01ae-43db-9e25-d9991b2e96dd",
      "reviews.rating": 5,
      "reviews.text": "Always preferable to other pads, when reading books"
    },
    {
      "reviews.date": "2016-11-16T00:00:00.000Z",
      "reviews.id": "0fcb6f39-13b0-45ac-b1f9-0f831b101075",
      "reviews.rating": 4,
      "reviews.text": "Great gifts!! Very much enjoyed by my family members."
    },
    {
      "reviews.date": "2016-09-23T00:00:00.000Z",
      "reviews.id": "93684f20-c92e-40cf-8d93-02c385f3ba16",
      "reviews.rating": 5,
      "reviews.text": "Working efficiently, no complaints so far. Makes reading fun!"
    },
    {
      "reviews.date": "2017-01-30T00:00:00.000Z",
      "reviews.id": "a35d57af-6c6a-4990-b52c-9c815716c449",
      "reviews.rating": 5,
      "reviews.text": "This is a gift for friend, and she loves that! She told me this device helped her with concentration when read."
    },
    {
      "reviews.date": "2016-10-18T00:00:00.000Z",
      "reviews.id": "ae81b2bc-8a83-4b10-8952-651888ca3c8c",
      "reviews.rating": 4,
      "reviews.text": "I purchased my Voyage yesterday. It looked like I scratched the screen today and I contacted Amazon directly and they replaced my Voyage under the warentee I did not need to go thru bestbuy. Turns out it was food and not a scratch and canceled the replacement but point is Amazon backs up their products! I do not think its worth 199$ for there is a weird screen discoloration where the top appears orangeish and the bottom blueish but only under certain lighting conditions BUT its barely noticeable. In normal light it looks quite normal. Due to cost it will be a great first purchase but no real need to upgrade from paperwhite BUT in its defense the Voyage is much much lighter, thinner and more responsive and the page turn buttons are seamless. Over all this is a mighty nice product. Side note: I own a Nook glow-light plus which is cheaper and looks nicer and has a great feel to it as well. Nook glowlight plus is more stylish with the copperish color back and white textured front. The Voyage is attractive too BUT I think it will sell better if it had a \" two toned\" color Like maybe a white front and a colored back side. Voyage is much faster than the nook but prettymuch same features. I just feel Amazon can afford to make their product more stylish. Also best buy does not seem to offer and real choices for cases on their kindles and tablets. I had to order a cover at ebay."
    },
    {
      "reviews.date": "2015-04-15T00:00:00.000Z",
      "reviews.id": "d751a4f6-8f42-423c-9a48-28fbeb826314",
      "reviews.rating": 4,
      "reviews.text": "Great contrast and battery life with easy user interface."
    },
    {
      "reviews.date": "2017-05-31T00:00:00.000Z",
      "reviews.id": "125ef724-e202-41d0-ab51-77855d8abb69",
      "reviews.rating": 5,
      "reviews.text": "It is a good reading device. When the price drop to 100 dollar, it is a deal. You need to buy one at that level."
    },
    {
      "reviews.date": "2015-07-29T00:00:00.000Z",
      "reviews.id": "e722b708-ab41-40d6-a01a-d3ddfe93ff43",
      "reviews.rating": 5,
      "reviews.text": "The Kindle Voyage is the first new model that I finally felt was good enough to replace my Kindle4NT (non-touch with side buttons). The original 4T and paperwhite models worked poorly for me, and lacked buttons. The pressure sensitive edges of the Voyage work great, and the touch screen functions work better in this model.Voyage is still at least $50 overpriced, but I ultimately worth the money if moving off an older button-style Kindle."
    },
    {
      "reviews.date": "2016-09-23T00:00:00.000Z",
      "reviews.id": "b4630abd-b5d1-4719-9e64-7fa30ec15899",
      "reviews.rating": 4,
      "reviews.text": "Very good screen for outdoors and nighttime use. Lightweight."
    },
    {
      "reviews.date": "2016-02-27T00:00:00.000Z",
      "reviews.id": "1b855a10-c19a-45c4-ad70-078108aff688",
      "reviews.rating": 5,
      "reviews.text": "I love to read and using the Kindle has been great."
    },
    {
      "reviews.date": "2015-12-18T00:00:00.000Z",
      "reviews.id": "769dd7c8-fe98-4083-8973-335862d411a0",
      "reviews.rating": 5,
      "reviews.text": "The Kindle from Best Buy has made it easier for me to read. This is my first e-reader. I like the Voyage 6 for its brightness and speed, plus thelarge variety of reading material. I know Amazon is in the business ofmaking money by getting me to purchase Kindle books. However, I havefound several Kindle books available for free from my public library. I will, no doubt, buy some Kindle books elsewhere in the future. Best BuyHas been good to me. I did have a little problem finding someone in thestore who was well-informed on this product but finally got what I wanted."
    },
    {
      "reviews.date": "2015-11-21T00:00:00.000Z",
      "reviews.id": "f596586b-1ca1-4187-af94-1056e1279d3b",
      "reviews.rating": 5,
      "reviews.text": "Awesome thank goodness for the next week and we will have a good day"
    },
    {
      "reviews.date": "2017-07-19T00:00:00.000Z",
      "reviews.id": "0a834745-5dd6-4e20-be12-5838973ebf0e",
      "reviews.rating": 4,
      "reviews.text": "Great alternative to using tablet for reading. Only problem is trying to read a *.pdf file - it only enlarges the page and does not resize the document to easily move forward."
    },
    {
      "reviews.date": "2016-06-22T00:00:00.000Z",
      "reviews.id": "ab9cb4f4-9df4-4436-9864-ce01c62f15e0",
      "reviews.rating": 5,
      "reviews.text": "I wanted a simple reader for east of transportability and use. Although I still occasionally use my tablet to read I wanted something more light weight. I haven't tested this in the sunlight but so far I love it's smaller size and simplicity."
    },
    {
      "reviews.date": "2014-11-05T00:00:00.000Z",
      "reviews.id": "cef530cc-f0e0-4ab5-a7ce-05cec05e84af",
      "reviews.rating": 2,
      "reviews.text": "The Voyage, when it worked, was great - the page turns make the reading experience seamless and the ink is crisp, making it a real upgrade from the Paperwhite. That said, it started to freeze up quickly after I got it. Hopefully this is a software issue that will be resolved soon (and the price of early adoption, sometimes), because overall, I couldn't be more pleased with the (working) Voyage."
    },
    {
      "reviews.date": "2016-09-10T00:00:00.000Z",
      "reviews.id": "291bca39-9a96-4cb7-a22a-971dafc4f8d9",
      "reviews.rating": 5,
      "reviews.text": "Easy to read in the sunlight. I really like that it adjusts to the lighting available making it easy to read anywhere."
    },
    {
      "reviews.date": "2016-06-20T00:00:00.000Z",
      "reviews.id": "bc114dcc-62a2-4709-bc06-1a77d9381a96",
      "reviews.rating": 5,
      "reviews.text": "Purchased this kindle for a friend and they absolutely enjoy it."
    },
    {
      "reviews.date": "2015-10-12T00:00:00.000Z",
      "reviews.id": "d450028f-52a8-4a69-baf4-0b8cc184e970",
      "reviews.rating": 5,
      "reviews.text": "Light, easy to read, large capacity and multiple ways to turn pages. What else can I say, it's a wonderful reader, especially in the Florida sunlight. Also, the iPhone app that sync your ready progress is great for times you have your phone but not the kindle."
    },
    {
      "reviews.date": "2015-12-04T00:00:00.000Z",
      "reviews.id": "ef59d039-17e5-4bde-94af-b2d89d5422b6",
      "reviews.rating": 5,
      "reviews.text": "Best Reader ever. I've had a lot of Readers like Paper white 2013, Kindle DX, B&N nook and Kobo Aura HD before I get Kindle Voyage. But this one is really different.The only feature that I wish it'd support is memory slot! I guess Amazon will add it to the next generation of Kindles as well as Kindle Fires..."
    },
    {
      "reviews.date": "2015-02-04T00:00:00.000Z",
      "reviews.id": "5da52d8f-57dc-4353-a54e-a4cf6297c46d",
      "reviews.rating": 5,
      "reviews.text": "The reader is great, with a crisp display and excellent battery life. I like having the option of either using the buttons to flip pages, or just swipe it. The latter always required two hands, so the buttons can make it easier."
    },
    {
      "reviews.date": "2015-07-17T00:00:00.000Z",
      "reviews.id": "40c057db-ca95-4a57-b707-24124c17fbe2",
      "reviews.rating": 5,
      "reviews.text": "Love the ability to read in sunlight, create files."
    },
    {
      "reviews.date": "2016-01-06T00:00:00.000Z",
      "reviews.id": "84fb179b-fb95-4c98-9f7e-61dd02a69072",
      "reviews.rating": 5,
      "reviews.text": "The Voyage is worth the extra money. It's a wonderful device. Very responsive and easy to use. I would highly recommend!"
    },
    {
      "reviews.date": "2015-08-05T00:00:00.000Z",
      "reviews.id": "1288b02b-8d63-4db0-a34c-e69618b53f1c",
      "reviews.rating": 4,
      "reviews.text": "Bought this for easier reading and it meets my expectations. Great display fidelity."
    },
    {
      "reviews.date": "2017-01-16T00:00:00.000Z",
      "reviews.id": "d5009d3b-a412-48b7-84ac-92c4d99ed2c2",
      "reviews.rating": 5,
      "reviews.text": "Bought this as a Christmas gift. My daughter loves it. She specifically likes the screen lighting."
    },
    {
      "reviews.date": "2017-04-01T00:00:00.000Z",
      "reviews.id": "07e7524f-fb28-4f46-b7cf-30337c3c2277",
      "reviews.rating": 5,
      "reviews.text": "The quality of the display is amazing - the battery life is fantastic"
    },
    {
      "reviews.date": "2016-04-25T00:00:00.000Z",
      "reviews.id": "1cf43875-d9fb-4dc3-ae26-e06bf9ba1f43",
      "reviews.rating": 4,
      "reviews.text": "The text is sharp and paper like in well lit conditions. When using the backlight in dark conditions it becomes less paper like but is quiet useful if you wanna ditch clip on lights. Can set on automatic brightness level or manually set. Slim and lightweight when not using a case which I appreciate most about this kindle. Makes for easy holding and carrying/packing. Practically any book at the palm of my hand on this one device. I also like that it has page press which is outer press buttons for page turning. One con is its not all that speedy and responsive when going though the store, though it is the fastest kindle yet. I would NOT say it is 80 to 100 dollars well spent over the paperweight. In fact i would recommend the paper weight when its come down to price. Im just someone who wants the best of the best so I bought 2 of these. One for my love as a gift, then I went and bought myself one. It was a well recieved gift and I aquired major browny points. We give them 4 thumbs up. We can read together in bed, in the woods, on the road or wherever we like. This is the voyager after all and it is intended to be with you wherever you go. I would give it 4.5 if that was an option."
    },
    {
      "reviews.date": "2015-06-26T00:00:00.000Z",
      "reviews.id": "75759fa2-4ff0-4de8-acf3-6df5ebf0f632",
      "reviews.rating": 5,
      "reviews.text": "No issues whatsoever. Works well! Best e reader there is!"
    },
    {
      "reviews.date": "2016-08-05T00:00:00.000Z",
      "reviews.id": "397de4a8-06b9-4b23-a835-2ed986c4960f",
      "reviews.rating": 3,
      "reviews.text": "It is the top of the line e reader by amazon which is also the leader in e readers. The voyage is an excellent device and very versatile to carry on your trips. I feel the premium for the page turn sensors is little too high. In hindsight I would go with the paper white and save a few bucks."
    },
    {
      "reviews.date": "2014-10-25T00:00:00.000Z",
      "reviews.id": "62330e51-2985-4c5d-bf96-9b3247b3b76a",
      "reviews.rating": 5,
      "reviews.text": "Light weight, great upgrades from the paperwhite. Love it!"
    },
    {
      "reviews.date": "2015-04-29T00:00:00.000Z",
      "reviews.id": "3b75a9f5-19cc-4724-8ce2-2e5adb0476e3",
      "reviews.rating": 4,
      "reviews.text": "Although the Price point is a bit high for what it is I love the new kindle. The screen is beautiful, the back light with auto-adjust dimming is great, and it feels very sturdy to hold. I am very glad that I upgraded form the nook but can only give 4 stars due to price."
    },
    {
      "reviews.date": "2015-07-23T00:00:00.000Z",
      "reviews.id": "0c04d499-583d-4538-8c0a-e759344c4fed",
      "reviews.rating": 5,
      "reviews.text": "I like the small size and auto adjustable lighted screen. With my old Kindle I needed to have external light to read, but this one comes with the build one."
    },
    {
      "reviews.date": "2016-01-29T00:00:00.000Z",
      "reviews.id": "a9857a83-7d5a-4c62-886d-5dfcb10b722e",
      "reviews.rating": 5,
      "reviews.text": "I read often and love this e-reader. I previously had a nook and liked it, but it was old and did not have night reading option. The voyage is light and easy to hold. The backlighting is great at night. Overall very happy with this product for reading."
    },
    {
      "reviews.date": "2014-11-24T00:00:00.000Z",
      "reviews.id": "35bf4a83-a8b1-4b6b-a738-ae33574bd120",
      "reviews.rating": 4,
      "reviews.text": "If you already have a Paperwhite then there is no need to upgrade. But if you are in the market this has an excellent display and quick page turns. The reason to buy a dedicated e-reader is the 3 week long battery life. Love it"
    },
    {
      "reviews.date": "2015-04-19T00:00:00.000Z",
      "reviews.id": "3c42c37c-23af-4acb-8ef7-7530d00a9c71",
      "reviews.rating": 5,
      "reviews.text": "Small, light weight and battery lasts. I love this thing. Way better than lugging many paperback for long flights."
    },
    {
      "reviews.date": "2015-07-31T00:00:00.000Z",
      "reviews.id": "ccefbaa2-2f83-4104-98b0-11b8d63318f6",
      "reviews.rating": 5,
      "reviews.text": "This e-reader fits very nicely into my library of other electronic devices. It works great."
    },
    {
      "reviews.date": "2017-03-19T00:00:00.000Z",
      "reviews.id": "eaeb43a8-8555-4dbe-903d-a9a7032387eb",
      "reviews.rating": 5,
      "reviews.text": "This is my second Kindle (the first one lasted several years). I enjoy the ability to read in the dark without background light. The backlight works very well and does not have the eye strain that a tablet may have. With the touch surface, I find it a little too sensitive and have accidentally moved several pages. The side page turn works very well. Much easier to travel with this unit than a large book."
    },
    {
      "reviews.date": "2017-05-03T00:00:00.000Z",
      "reviews.id": "6ce8122f-96fa-4611-949c-39811f464264",
      "reviews.rating": 5,
      "reviews.text": "This is my second Kindle device. I enjoy using this to read in lower light conditions with the automatic adjustment. Touch screen is nice, but can accidentally move pagesif your fingers slip. No issues with readability in many light conditions."
    },
    {
      "reviews.date": "2015-01-31T00:00:00.000Z",
      "reviews.id": "85fafc29-5297-4a60-8651-bbb805d83302",
      "reviews.rating": 4,
      "reviews.text": "Bought this for my wife for Christmas. We have been using a Nook for the last 2 years (bought at Best Buy - got 2 and a great deal) Can't use Nook to read in sunlight. The Voyage is smaller, lighter and easier to use. Have not used it yet to read in sunlight. Wish it had some other features like - color display and sound. Waiting to see if I decide to get one until then I still am using a Nook. Very easy to download a book from public library. It is a tad expensive for what it does."
    },
    {
      "reviews.date": "2016-12-23T00:00:00.000Z",
      "reviews.id": "c59f49a6-ca8a-49bb-aeb7-a337bf4fc392",
      "reviews.rating": 5,
      "reviews.text": "The Kindle Voyager is the best E-reader you can buy! The resolution is absolutely amazing. The long lasting battery is, by far, the best feature."
    },
    {
      "reviews.date": "2016-06-17T00:00:00.000Z",
      "reviews.id": "13c317a9-a21a-4028-a2e5-d05452ba7142",
      "reviews.rating": 5,
      "reviews.text": "I had an older version of a Kindle e-reader that allowed me to download books on the go, but I felt like something was missing. Several upgrades later, I got this for a gift, and I think it basically includes everything that was missing. It is so lightweight and compact that I can easily slip it into my purse or use it with one hand. It has backlighting that doesn't disturb my sleeping husband or create a light so bright that it is distracting- it's just the right amount of light needed to read in different ligths. It can self-adjust from reading in a dark room to reading outside on a bright day."
    },
    {
      "reviews.date": "2015-01-10T00:00:00.000Z",
      "reviews.id": "e3e15d5d-82f5-4a89-a303-8034f68695ae",
      "reviews.rating": 5,
      "reviews.text": "This kindle has been great, I upgraded from an original kindle and haven't looked back.I think if you have one of the paperwhite's with the backlight you might not see enough bang for your buck to upgrade though."
    },
    {
      "reviews.date": "2016-09-30T00:00:00.000Z",
      "reviews.id": "054689ce-857f-44a6-8723-91ef5089647c",
      "reviews.rating": 5,
      "reviews.text": "Love it. Very happy with purchase. Does everything I expected ."
    },
    {
      "reviews.date": "2015-10-17T00:00:00.000Z",
      "reviews.id": "939992ac-d39a-463f-a3b0-53ed6fd7d6ff",
      "reviews.rating": 5,
      "reviews.text": "I like this reader.. It is easy to read in daylight with no glare. It has an auto backlight that works well in all lighting situations. I like the links to the dictionary, encyclopedia and internet links in the indigenous. This reader utilizes them all."
    },
    {
      "reviews.date": "2014-12-03T00:00:00.000Z",
      "reviews.id": "23135f81-33fa-4847-9361-57ef0d2685ca",
      "reviews.rating": 5,
      "reviews.text": "Great ebook reader with ambient light, page press, and sharp text. It is thin and light."
    },
    {
      "reviews.date": "2015-03-13T00:00:00.000Z",
      "reviews.id": "1722b6b9-74bf-4a33-9a9d-7c4663b11039",
      "reviews.rating": 5,
      "reviews.text": "The best ebook reader in the market. The text is crisp and I love the backlighting."
    },
    {
      "reviews.date": "2014-11-23T00:00:00.000Z",
      "reviews.id": "5d3d435d-d853-4185-9dcb-5f9dfa5eb289",
      "reviews.rating": 5,
      "reviews.text": "Excellent device. Screen is impressive. Happy with this purchase, and looking forward to reading many books on it!"
    },
    {
      "reviews.date": "2015-06-17T00:00:00.000Z",
      "reviews.id": "1803d605-2fdf-4a4c-9f73-a810350e45c8",
      "reviews.rating": 5,
      "reviews.text": "Fabulous new functionality love the night reading capabilities"
    },
    {
      "reviews.date": "2015-02-03T00:00:00.000Z",
      "reviews.id": "d4bf8cc9-7c1c-4428-841e-6fa4e09b35cb",
      "reviews.rating": 5,
      "reviews.text": "My last kindle died right before Christmas. I was lost with no way to read my books. Went to Best Buy to look at all the different ones available. Found that the Voyage was the best for my situation. Being backlit was perfect for the many different places I read, car, work, restaurants, and planes."
    },
    {
      "reviews.date": "2016-06-28T00:00:00.000Z",
      "reviews.id": "15067f83-a573-43ae-b692-ba2a5d42a5c4",
      "reviews.rating": 4,
      "reviews.text": "This is my third Kindle and by far the best. I know use this for 100% of all reading - including - and the reason I bought it, for reading in the pool. I still own 2 good tablets and a laptop. This does not compete with them. Absolutely outstanding outside in Dallas. This does not overheat, with absolutely zero glare. Yes I can read in the pool on a sunny day. I have about 300 books on this and don't charge it but once every other week. I use it 1-3 hours a day without fail. I wish the unit was truly water resistant and it's built in browser is almost worthless. This is an eReader and not a tablet."
    },
    {
      "reviews.date": "2015-09-04T00:00:00.000Z",
      "reviews.id": "08de47d1-a5b2-4e55-9fd1-d54bf731ab33",
      "reviews.rating": 5,
      "reviews.text": "very good e-reader. like the back light very much. very light for carrying around."
    },
    {
      "reviews.date": "2017-01-06T00:00:00.000Z",
      "reviews.id": "914b4385-d4b0-48d5-9b07-97d7e8d67378",
      "reviews.rating": 5,
      "reviews.text": "I love my kindle voyage. I get distracted when I read on my tablet, so I decided to purchase an eReader. I am very happy I did! I hope to meet my reading challenge now!"
    },
    {
      "reviews.date": "2016-03-11T00:00:00.000Z",
      "reviews.id": "4b34f120-8c8c-4860-83a6-d6e957067c67",
      "reviews.rating": 5,
      "reviews.text": "This readeri is compact and fits nicely in my bag. Easy to use, controls for children are very effective. Am glad I bought it."
    },
    {
      "reviews.date": "2016-05-21T00:00:00.000Z",
      "reviews.id": "acd8838b-3252-45f7-8220-d4328312278a",
      "reviews.rating": 4,
      "reviews.text": "This is the first e-reader I've gotten and I LOVE it! In general, kindles are awesome because there is a bunch of free material you can download on amazon that you can just carry around with you. The page turning function is a little weird to get used to but you can also swipe if you don't like the sensors on the side. When you turn off the kindle there is a screen saver that is typically some kind of ad, which is kind of annoying, but it's not really worth it to pay to have the ads taken off. Again, just something to get used to. It's really easy to navigate, you can even highlight and take notes. I don't really now too much about other e-readers or kindles but I'm really happy I bought this and I'd recommend it to anyone!"
    },
    {
      "reviews.date": "2017-01-06T00:00:00.000Z",
      "reviews.id": "1facafc9-3d21-4888-ab1f-a2f953303a17",
      "reviews.rating": 5,
      "reviews.text": "Love my new Kindle Voyage. I have an original Kindle but this one does so much more. Recommend it highly."
    },
    {
      "reviews.date": "2017-06-21T00:00:00.000Z",
      "reviews.id": "62036298-f52e-4d28-bf6a-7c147bc1c152",
      "reviews.rating": 5,
      "reviews.text": "I bought this as a gift for my wife who loves reading. She has really enjoyed being able to. Andy this sleek reader in her purse when she's on the go."
    },
    {
      "reviews.date": "2017-01-30T00:00:00.000Z",
      "reviews.id": "f22b38b0-3e3a-411d-8062-d259156dca58",
      "reviews.rating": 5,
      "reviews.text": "I upgraded from an old kindle. It's really nice to have the backlight and slightly larger screen."
    },
    {
      "reviews.date": "2016-06-11T00:00:00.000Z",
      "reviews.id": "332b5279-b664-4c97-b40a-13e8b1373468",
      "reviews.rating": 5,
      "reviews.text": "I purchased one of these for myself back in January, and when my mother remarked on it, I knew she wanted one as well. It works great for both myself and her, despite the differences in our reading habits and hand sizes."
    },
    {
      "reviews.date": "2017-06-23T00:00:00.000Z",
      "reviews.id": "8ba85a23-45d5-4fb7-9870-54b34676902c",
      "reviews.rating": 5,
      "reviews.text": "Great and easy read especially when outside in the sun."
    },
    {
      "reviews.date": "2016-04-16T00:00:00.000Z",
      "reviews.id": "34588122-03b4-42db-9013-15ec847de068",
      "reviews.rating": 5,
      "reviews.text": "This is an very good to use in all areas. The letters are very clear."
    },
    {
      "reviews.date": "2015-09-09T00:00:00.000Z",
      "reviews.id": "23e487d7-b9ec-4d97-af84-87ec0dc3f9cd",
      "reviews.rating": 4,
      "reviews.text": "I was impressed with the voyage overall. I especially like the light sensor feature because it makes reading enjoyable in all settings."
    },
    {
      "reviews.date": "2016-09-02T00:00:00.000Z",
      "reviews.id": "53209632-c0a6-4076-a4b3-e0d14e6400e0",
      "reviews.rating": 5,
      "reviews.text": "This is a replacement machine. Good reading experience. Great for travel - and reading in bed."
    },
    {
      "reviews.date": "2015-09-26T00:00:00.000Z",
      "reviews.id": "9d020291-5a06-4bc2-949c-85d77fa58415",
      "reviews.rating": 5,
      "reviews.text": "The Kindle Voyage 6 is better than the real thing. After wearing out a first generation Kindle in our home, we knew we wanted something with versatility of the original with a few added features. The background light is a big plus as it allows my wife to read at night without having to keep the lights on. It's a great ereader at the right price."
    },
    {
      "reviews.date": "2016-10-07T00:00:00.000Z",
      "reviews.id": "610980f3-df00-42de-86ac-daef570b3b02",
      "reviews.rating": 4,
      "reviews.text": "I wish it had 3G or 4G. Other than that it is great."
    },
    {
      "reviews.date": "2015-07-15T00:00:00.000Z",
      "reviews.id": "e2edfac7-9f95-4525-8911-0900e5b202d1",
      "reviews.rating": 4,
      "reviews.text": "The original electronic book. Bought it for my wife who reads paper book at two to three a week. She's hooked and loves the Kindle."
    },
    {
      "reviews.date": "2016-05-13T00:00:00.000Z",
      "reviews.id": "3de114f9-4606-4a4f-ba60-d86cc64df8d3",
      "reviews.rating": 5,
      "reviews.text": "Bought two for gifts. A huge hit!! They are readers and love not having to lug books."
    },
    {
      "reviews.date": "2017-01-18T00:00:00.000Z",
      "reviews.id": "6d186d34-72bb-4f25-a4d8-51ad0daa65ea",
      "reviews.rating": 5,
      "reviews.text": "Purchased this over the holidays and have enjoyed it since. The look and feel of a book is great."
    },
    {
      "reviews.date": "2017-02-18T00:00:00.000Z",
      "reviews.id": "3da89136-8bf4-435a-871c-31c322d202c0",
      "reviews.rating": 5,
      "reviews.text": "This is just what my father wanted. It is portable, light weight and has an amazing backlight."
    },
    {
      "reviews.date": "2016-11-18T00:00:00.000Z",
      "reviews.id": "88d43969-3c7a-44ee-94c2-4e4e6599be85",
      "reviews.rating": 5,
      "reviews.text": "highly recommend this product to all book lovers..."
    },
    {
      "reviews.date": "2016-12-07T00:00:00.000Z",
      "reviews.id": "d9755286-9458-4442-86d8-6a466100f0d6",
      "reviews.rating": 5,
      "reviews.text": "I bought if for my husband for our travel. Much lighter then taking books or ipad with us. Took him a little time to figure out the device and how to borrow e-books from our local public library. But now he loves it."
    },
    {
      "reviews.date": "2016-08-12T00:00:00.000Z",
      "reviews.id": "48cce6d1-a837-4951-ba6e-c74c1323452b",
      "reviews.rating": 5,
      "reviews.text": "Super light, the paper white is a huge success and the battery life is as advertised. However, it is so light and small it mandates a protective case-BUT they are never in stock or otherwise available."
    },
    {
      "reviews.date": "2016-05-10T00:00:00.000Z",
      "reviews.id": "0d79c766-58ae-4637-bc77-6b7c884d56e8",
      "reviews.rating": 5,
      "reviews.text": "A bit pricey, but worth the money in my opinion. Perfect size and great screen!"
    },
    {
      "reviews.date": "2016-09-10T00:00:00.000Z",
      "reviews.id": "3393ce24-28de-41f8-9cc1-96176a596c05",
      "reviews.rating": 5,
      "reviews.text": "I have had several variations of the Kindle in the past. My most recent being a paperwhite. I have to say this is the best. The size and balance are better. The adaptable light feature and brightness is good. Screen quality and construction are both an improvement. The overall reading experience is much improved over the paperwhite."
    },
    {
      "reviews.date": "2014-11-04T00:00:00.000Z",
      "reviews.id": "0126a664-1728-4361-8a1a-f9e31427d16a",
      "reviews.rating": 5,
      "reviews.text": "I never owned Kindle before. I tried to just be content with a PW 2, but after close comparison in store, I sticked to the Voyage. Luckily, I haven't been disappointed so far."
    },
    {
      "reviews.date": "2015-06-12T00:00:00.000Z",
      "reviews.id": "ccf3d8b9-6761-437b-90ff-a8f5816083d3",
      "reviews.rating": 5,
      "reviews.text": "My first Kindle, but the backlight feature is great"
    },
    {
      "reviews.date": "2016-12-31T00:00:00.000Z",
      "reviews.id": "9682cb79-f992-4daa-9110-3b605c88928d",
      "reviews.rating": 5,
      "reviews.text": "Nice size, nice look,love the feel of turning the page. Great reading experience."
    },
    {
      "reviews.date": "2015-08-14T00:00:00.000Z",
      "reviews.id": "c2d30300-b21e-4ee8-9719-9154a8cd97e2",
      "reviews.rating": 4,
      "reviews.text": "Perfect reading light and long battery life. I really love it."
    },
    {
      "reviews.date": "2015-01-23T00:00:00.000Z",
      "reviews.id": "847aeca5-c04e-4cbb-8453-41ca7042d881",
      "reviews.rating": 5,
      "reviews.text": "Purchased for my wife to replace her previous kindle. She loves it. Great product."
    },
    {
      "reviews.date": "2016-08-25T00:00:00.000Z",
      "reviews.id": "cf5fcfc4-e00f-4d27-a09f-c9cd70dbe79c",
      "reviews.rating": 5,
      "reviews.text": "this kindle is very light so easy to hold for a long time without getting tired - worth upgrading your older version kindle..."
    },
    {
      "reviews.date": "2016-07-28T00:00:00.000Z",
      "reviews.id": "1886242b-e266-4789-ae52-7205023fec50",
      "reviews.rating": 5,
      "reviews.text": "This kindle replaces a previous model. The size is great, fits easily into purse or gym bag. The touch screen is a nice improvement over my earlier model. The backlit screen is good. Bright enough but not too bright. Overall, I am very pleased"
    },
    {
      "reviews.date": "2016-09-10T00:00:00.000Z",
      "reviews.id": "5edc8a13-4e92-4905-9b54-c8585a90e213",
      "reviews.rating": 4,
      "reviews.text": "Very happy with this kindle. I purchased this kindle over the paperwhite due to the physical buttons."
    },
    {
      "reviews.date": "2015-07-23T00:00:00.000Z",
      "reviews.id": "43cf8cb4-2d85-42ab-9290-47044ba429e3",
      "reviews.rating": 5,
      "reviews.text": "bright screen which makes reading it day or night easy"
    },
    {
      "reviews.date": "2017-10-06T00:00:00.000Z",
      "reviews.id": "9447f571-e24a-49c1-9b72-8dec9a172355",
      "reviews.rating": 5,
      "reviews.text": "This beats my 2 older versions, hands down. Can either swipe or press to change pages. Easy. Really lightweight. Super!"
    },
    {
      "reviews.date": "2015-08-06T00:00:00.000Z",
      "reviews.id": "5dad7642-5f73-44c1-9553-367b5c9e90d5",
      "reviews.rating": 5,
      "reviews.text": "I'm So Happy I Bought This. It Goes Everywhere With Me. Best Thing I Have Purchased In A Long Time."
    },
    {
      "reviews.date": "2017-06-24T00:00:00.000Z",
      "reviews.id": "4269029f-be9c-44f3-b8e9-86b635a48631",
      "reviews.rating": 5,
      "reviews.text": "Bright backlight- amazing controls + Kindle features"
    },
    {
      "reviews.date": "2016-01-29T00:00:00.000Z",
      "reviews.id": "66ddd4c7-122a-429e-8181-a03db2b72ab2",
      "reviews.rating": 5,
      "reviews.text": "I love the new kindle. I have a third generation and the new features are awesome."
    },
    {
      "reviews.date": "2016-06-22T00:00:00.000Z",
      "reviews.id": "6ad0391a-8b48-4bb1-9642-929792414dc4",
      "reviews.rating": 5,
      "reviews.text": "Great, lightweight, easy to carry and great picture for reading."
    },
    {
      "reviews.date": "2015-04-24T00:00:00.000Z",
      "reviews.id": "7d1801f1-1559-46a7-82ce-436e13af8532",
      "reviews.rating": 5,
      "reviews.text": "Although the price is high, it is worth and useful."
    },
    {
      "reviews.date": "2016-09-07T00:00:00.000Z",
      "reviews.id": "3d49caaa-e570-455f-b5c2-d1db835d81cf",
      "reviews.rating": 5,
      "reviews.text": "Bought for my wife. She loves it. Reads it in bed and the light adjusts accordingly"
    },
    {
      "reviews.date": "2015-07-03T00:00:00.000Z",
      "reviews.id": "19c5e4d4-65b1-457a-b519-dca07930efc7",
      "reviews.rating": 4,
      "reviews.text": "I bought this game for my son, and he loves it..it is very entertaining."
    },
    {
      "reviews.date": "2016-10-09T00:00:00.000Z",
      "reviews.id": "1c9f9a45-99cb-474a-b8ed-860db3045792",
      "reviews.rating": 5,
      "reviews.text": "I purchased this for my mom and she is totally in love with this reader. This has replaced her older Kindle from about 4-5 years ago and she appreciates the upgrade, especially the built-in backlight.Great product and a must-buy for avid book readers."
    },
    {
      "reviews.date": "2017-04-07T00:00:00.000Z",
      "reviews.id": "e7350e99-0959-4ed5-bc74-0cdf343395d7",
      "reviews.rating": 4,
      "reviews.text": "I was expecting better battery life cause they claim 6weeks of battery life. I am getting 3weeks. I wish it was little better than that. But that's my only issue"
    },
    {
      "reviews.date": "2016-01-22T00:00:00.000Z",
      "reviews.id": "43d45a6f-e478-45a5-89ed-598a587176ee",
      "reviews.rating": 5,
      "reviews.text": "I would highly recommend this reader for anyone. Easy to download books and fast! Love the fonts and sizes. Lightweight. Great for travelers."
    },
    {
      "reviews.date": "2016-05-06T00:00:00.000Z",
      "reviews.id": "44c05fa2-fbb6-4df0-80d5-e72d195c130e",
      "reviews.rating": 5,
      "reviews.text": "My daughter loves this; she is reading voraciously"
    },
    {
      "reviews.date": "2017-04-21T00:00:00.000Z",
      "reviews.id": "fa957479-c50f-43b8-b18a-d42001d7ddc2",
      "reviews.rating": 4,
      "reviews.text": "The only issue with this kindle is the price, otherwise, it's awesome. Light, compact, with a long battery life and tons of features... like an automatic backlight which is useful if you read at night."
    },
    {
      "reviews.date": "2014-12-15T00:00:00.000Z",
      "reviews.id": "1e6c9b0a-22df-452e-8e94-e1773430d65a",
      "reviews.rating": 5,
      "reviews.text": "The screen is very sharp and easy to use. The letters are crisp and distinctive. The back light works well in the dark or light. I have no problem reading at night in the dark or during the day outside in direct sunlight. The new page press buttons are perfectly placed and very convenient. It's light weight and small enough to hold in one hand whole reading. I only have to charge it every 2 weeks.I would recommend this edition to anyone who enjoys reading."
    },
    {
      "reviews.date": "2015-04-01T00:00:00.000Z",
      "reviews.id": "ca4c1ee4-af13-48e0-9983-8ce1dccda1f0",
      "reviews.rating": 5,
      "reviews.text": "It took awhile to get this Kindle as it was out of stock, but it was worth the wait. It is easy to use and the text is very clear. I have had a Kindle before but this model is so much better. Most enjoyable."
    },
    {
      "reviews.date": "2016-05-20T00:00:00.000Z",
      "reviews.id": "6af5a8e1-7330-4bd4-a2b9-b847233e7f29",
      "reviews.rating": 5,
      "reviews.text": "I have several generations of Kindle readers, and this is far and away the best. It is relatively expensive, but the features are worth it."
    },
    {
      "reviews.date": "2017-08-16T00:00:00.000Z",
      "reviews.id": "2ab4ef01-5e01-4f0f-af83-f01106a58b83",
      "reviews.rating": 5,
      "reviews.text": "This was a gift for my wife, she had a previous version, and she loved the upgrade to tjis new version."
    },
    {
      "reviews.date": "2014-10-24T00:00:00.000Z",
      "reviews.id": "3d17fcf3-187f-4d49-bb26-3aec2d2753a5",
      "reviews.rating": 5,
      "reviews.text": "Upgraded from a Kindle paperwhite. I love the brighter screen and increased resolution. I am a book addict and the savings over printed material allows me to buy more books. The availability of reference texts is increasing which is a big plus."
    },
    {
      "reviews.date": "2015-07-24T00:00:00.000Z",
      "reviews.id": "188f212f-cbd1-4efe-b9b2-5a83af77fc08",
      "reviews.rating": 3,
      "reviews.text": "My son truly loves his Kindle. He uses it everyday."
    },
    {
      "reviews.date": "2017-04-28T00:00:00.000Z",
      "reviews.id": "e3a3c19e-5323-41d6-9f2a-4868ed6be421",
      "reviews.rating": 5,
      "reviews.text": "This kindle has better resolution and contrast ratio.It is light and comfortable. I would recommend this device at deal price."
    },
    {
      "reviews.date": "2015-09-25T00:00:00.000Z",
      "reviews.id": "19d45379-ed63-4da9-bd05-7337bac7f380",
      "reviews.rating": 5,
      "reviews.text": "Easy to use and get started with. Have had no issues at all and would recommend."
    },
    {
      "reviews.date": "2016-07-22T00:00:00.000Z",
      "reviews.id": "8c54a63d-8f34-4920-941e-18948f83e440",
      "reviews.rating": 5,
      "reviews.text": "Good reader for travelers. It allows for people to read in a variety of environments."
    },
    {
      "reviews.date": "2016-04-01T00:00:00.000Z",
      "reviews.id": "eb7d9a44-109f-47bc-a5b3-0a6c656f9a33",
      "reviews.rating": 5,
      "reviews.text": "I had been reading on my iPad mini most of the time, but around the pool or at the beach, that was almost impossible. The Voyage is great not only in bright sunshine but inside, even in a pretty dark room. The back light is great for just about any environment. The battery life is fantastic."
    },
    {
      "reviews.date": "2017-07-28T00:00:00.000Z",
      "reviews.id": "226baa07-ca60-4e11-ab52-4ceb0cf7592d",
      "reviews.rating": 5,
      "reviews.text": "I have both the Kindle Voyage and the low end Kindle Fire.While the $50.00 Fire is an amazing deal, for serious readin,g the Kindle Voyage is far easier on the eyes and has superior resolution. Now, it lacks many of the features of the less expensive Fire, such as color and online with Wifi; as a reader it is well organized and a pleasure.Truthfully, it isn't a whole lot better than the Paperwhite. It has a feature or two, but I'm not sure it's worth the extra 60 dollars. It is still an excellent device."
    },
    {
      "reviews.date": "2016-08-19T00:00:00.000Z",
      "reviews.id": "6231a81d-2486-405b-8f28-e53f7719fdf1",
      "reviews.rating": 5,
      "reviews.text": "I love the back light and has lots of memory. Very compact...easy to carry."
    },
    {
      "reviews.date": "2016-01-08T00:00:00.000Z",
      "reviews.id": "76ce8406-7529-4783-bc34-df3723df53c3",
      "reviews.rating": 5,
      "reviews.text": "I purchased this for my son overseas as he had broken the screen on his last one. When he opened it he was amazed at the size and weight of this one. He also was very elated that all his books that he purchased immediately downloaded to the new one with his bookmarks in place. All in all a great purchase from an excellent company."
    },
    {
      "reviews.date": "2015-04-20T00:00:00.000Z",
      "reviews.id": "8ae6ed0f-061f-4ed9-bbfc-586db63ba989",
      "reviews.rating": 4,
      "reviews.text": "I really enjoy reading on the new Kindle Voyage. Have had other Kindle models before this one. I especially like the brightness and lightness of it.Only drawback I needed to get use to was turning of pages being a little hesitant."
    },
    {
      "reviews.date": "2015-05-23T00:00:00.000Z",
      "reviews.id": "973f457d-c5b8-414c-a483-555d7a28d98d",
      "reviews.rating": 5,
      "reviews.text": "I wanted a reader that was easy to use indoor or outside. I am very pleased and so glad I purchased this product. Ordering books is also very easy."
    },
    {
      "reviews.date": "2015-04-10T00:00:00.000Z",
      "reviews.id": "8e364f0e-a851-4a81-8a74-b88eb1f9fbff",
      "reviews.rating": 4,
      "reviews.text": "The Kindle is very great reader and recommendable for people."
    },
    {
      "reviews.date": "2016-01-15T00:00:00.000Z",
      "reviews.id": "7a95a29e-a949-41dc-9ea3-45248ec9ff4e",
      "reviews.rating": 4,
      "reviews.text": "The technology just keeps getting better and better"
    },
    {
      "reviews.date": "2016-12-14T00:00:00.000Z",
      "reviews.id": "8305b4dd-9e68-401b-bec7-af698a046554",
      "reviews.rating": 5,
      "reviews.text": "this is my first foray into purchasing a reader...I reviewed multiple sites and opinions before I made a move on this purchase...and not disappointed, can read anywhere in any light"
    },
    {
      "reviews.date": "2017-04-22T00:00:00.000Z",
      "reviews.id": "699b9c65-59a3-41c4-a896-c5151afb833a",
      "reviews.rating": 5,
      "reviews.text": "Makes reading outdoors enjoyable and I spend more time at the beach!"
    },
    {
      "reviews.date": "2014-11-05T00:00:00.000Z",
      "reviews.id": "d27fbd82-067e-424a-a8f2-518387c09774",
      "reviews.rating": 5,
      "reviews.text": "I have never owned a Kindle and was using the Kindle ap for iPad for the last several years. This little device is remarkable. The page is crisp and clear, the navigation is so easy. Purchases are simple and straight forward. I love it!"
    },
    {
      "reviews.date": "2016-08-06T00:00:00.000Z",
      "reviews.id": "c52a0c07-eece-4aef-a6a4-e1f47480fc88",
      "reviews.rating": 5,
      "reviews.text": "The Kindle Voyager has a very easy to read screen with great resolution."
    },
    {
      "reviews.date": "2015-08-06T00:00:00.000Z",
      "reviews.id": "f36607c3-ba50-4f3c-afd1-b1e3fe206fd2",
      "reviews.rating": 5,
      "reviews.text": "the type resolution is fantastic and the screen brightness auto adjust compensates perfectly for both dark rooms and full sunshine on the beach!"
    },
    {
      "reviews.date": "2016-11-20T00:00:00.000Z",
      "reviews.id": "8c277d50-3ae3-419d-b08b-783c7ee68d9d",
      "reviews.rating": 5,
      "reviews.text": "Lightweight, easy on the eyes, easy to use, many wonderful features"
    },
    {
      "reviews.date": "2015-05-13T00:00:00.000Z",
      "reviews.id": "e38e4bb6-58c5-4f08-8645-83bf657249c9",
      "reviews.rating": 5,
      "reviews.text": "I have had several Kindles beginning with the 1st generation. I am an avid reader and I love that I can take my library with me. The Kindle Voyage is by far my favorite. The printed page is very clear and the lit page is wonderful. If you enjoy reading as much as I do, this is the e-reader for you."
    },
    {
      "reviews.date": "2015-07-10T00:00:00.000Z",
      "reviews.id": "9fb1e54c-682f-4259-915b-2dca1e249c2c",
      "reviews.rating": 5,
      "reviews.text": "I bought this after my Kindle Keyboard died. I like having a dedicated reader. Its easier on my eyes. Its light weight and fits in my purse with the cover on it. The ads don't bother me. Great purchase"
    },
    {
      "reviews.date": "2015-02-03T00:00:00.000Z",
      "reviews.id": "39e6b7f5-0e25-4fd0-bfea-652ed61b4ff1",
      "reviews.rating": 5,
      "reviews.text": "I had an original kindle that finally gave up the ghost after several years of service. I have been using my iPad mini as a reader, but it bothered my eyes after extended use. I like a dedicated reader like the voyager. It is about as close as you can come to an actual book. Love the adjustable backlot screen."
    },
    {
      "reviews.date": "2016-09-30T00:00:00.000Z",
      "reviews.id": "2be6611b-12f2-480a-8dda-2b749ef3f22c",
      "reviews.rating": 5,
      "reviews.text": "Though not super noticible the resolution is better on the voyage. Also the fact that the screen doesn't dip in and is flat all the way across was a huge plus for me, having a toddler that spills stuff on it if I leave it lying around. The page turn button features on the sides are kinda pointless though. All in all, love it!"
    },
    {
      "reviews.date": "2016-09-29T00:00:00.000Z",
      "reviews.id": "70bb0927-07b0-4b78-a6b1-81539e25dc18",
      "reviews.rating": 5,
      "reviews.text": "Great reader. Bought it for my wife and she loves it"
    },
    {
      "reviews.date": "2015-11-06T00:00:00.000Z",
      "reviews.id": "1ab6c476-9823-43a0-9901-ffa0ea0e0a99",
      "reviews.rating": 5,
      "reviews.text": "I've never really liked Kindle's for some reason or another. This one looked and felt really nice. I knew that I would love it as soon as I got it out of the box. It has a very premium feel and is a great substitute for a book."
    },
    {
      "reviews.date": "2014-11-08T00:00:00.000Z",
      "reviews.id": "6831a462-b1e8-49ab-9238-0d1d8e9bfec0",
      "reviews.rating": 5,
      "reviews.text": "This is my first kindle. I'm not sure how I lived without one now. The screen is excellent. I love being able to read outside (no glare!!) AND in bed (built in light!). Not sure how useful the automatic light adjuster is but it is a neat idea. Maybe as I use it more I will come to appreciate the automatic light adjustment."
    },
    {
      "reviews.date": "2015-09-27T00:00:00.000Z",
      "reviews.id": "2289baf2-193e-4ca7-bf31-d22893997d36",
      "reviews.rating": 5,
      "reviews.text": "I love my Kindle Voyage.... it's light and oh so easy to use... it's wonderful to have so many books in a portable format!"
    },
    {
      "reviews.date": "2016-09-09T00:00:00.000Z",
      "reviews.id": "e891d100-b80a-4076-bc95-8392133db2be",
      "reviews.rating": 3,
      "reviews.text": "Ive had the 1st kindle so it took time to get used to no keyboard but love the built in light that has auto adjusting. The homepage isnt as friendly"
    },
    {
      "reviews.date": "2016-10-21T00:00:00.000Z",
      "reviews.id": "5aafaf0b-282b-4d3c-bcdb-fac587a4e4a8",
      "reviews.rating": 4,
      "reviews.text": "More confusing. It would be nice to have a manual that is not online."
    },
    {
      "reviews.date": "2014-11-05T00:00:00.000Z",
      "reviews.id": "9fc5d48e-4949-4893-9ebc-283da5f0a867",
      "reviews.rating": 5,
      "reviews.text": "The flush bezel and display are a huge improvement. The text is crisp and easy on the eyes. The page press function and inclusion/position of the touch sensors is perfect. The price seems a bit high for something as simple as an E-Reader, but if you love to read this is a must have. You will not be disappointed."
    },
    {
      "reviews.date": "2017-05-15T00:00:00.000Z",
      "reviews.id": "caf62b44-f471-4b21-9c20-b1a2e60efa32",
      "reviews.rating": 4,
      "reviews.text": "My biggest gripe with it was the lack of directions. My first purchase went to the wrong card because I had no idea what the 1-click option was."
    },
    {
      "reviews.date": "2016-11-16T00:00:00.000Z",
      "reviews.id": "f0e2e7cf-5cf1-4ced-b421-55f61ebadeb9",
      "reviews.rating": 5,
      "reviews.text": "this was a choice between the Oasis and the Voyage. i made the right choice"
    },
    {
      "reviews.date": "2016-10-07T00:00:00.000Z",
      "reviews.id": "b0b566bc-ba29-4a22-b1b9-4857b5d58d7b",
      "reviews.rating": 4,
      "reviews.text": "this is a replacement for the kindle that i dropped. I love the new features of this model."
    },
    {
      "reviews.date": "2016-07-09T00:00:00.000Z",
      "reviews.id": "a89b69a0-be4f-4fbf-aee2-c442f0790c45",
      "reviews.rating": 5,
      "reviews.text": "Prefect for all reading conditions and environments. I take it everywhere."
    },
    {
      "reviews.date": "2015-06-01T00:00:00.000Z",
      "reviews.id": "0256610b-1b9e-4dd2-8f33-b34991ce1c4e",
      "reviews.rating": 5,
      "reviews.text": "Works great indoors & out. Very light weight & easy to carry, even in a pocket. Amazon downloads are easy & quick."
    },
    {
      "reviews.date": "2016-12-02T00:00:00.000Z",
      "reviews.id": "c7741d34-c328-4319-b266-5895c030ed71",
      "reviews.rating": 5,
      "reviews.text": "This item was a replacement for a misplaced/lost Kindle Voyage. It is my go-to eReader, compact, light-weight, and read anywhere (bright sun, shade, at nite) device. The Kindle Paperwhite could have been equally useful, but I was spoiled with the Voyage. As a note, I also have an iPadMini and an iPad Air2, but they are much heavier to lug around."
    },
    {
      "reviews.date": "2014-10-31T00:00:00.000Z",
      "reviews.id": "60f34da8-f024-47e3-8c71-2907e916bf20",
      "reviews.rating": 5,
      "reviews.text": "This is my first kindle but I'm loving it. I picked it up a few days after it was released. One of the things I love the most is I'm a reader but I am not a car owner so I get almost everywhere by bike. I got tired of lugging around heavy hardcover books from the library; now my Voyage weighs less than most paperback books. An extra bonus for me is, it fits in a pocket I wasn't using in my pannier I carry stuff to work everyday. I love the clarity of the text and pressure point page turning versus screen swipes. I also love that I charged it when I got 4 days ago and it is still more than have battery power."
    },
    {
      "reviews.date": "2015-04-23T00:00:00.000Z",
      "reviews.id": "8403abc3-cb67-4273-91d8-45ead01cac44",
      "reviews.rating": 4,
      "reviews.text": "I really like not having the bump on the bottom like the previous Kindle reader like the previous Kindle readerI dislike the fact that the screen is not recessed like the previous Kindle reader so that you cannot set the unit down facedown"
    },
    {
      "reviews.date": "2016-08-12T00:00:00.000Z",
      "reviews.id": "e8324c3a-011d-4d62-a4d1-ced4c115c374",
      "reviews.rating": 4,
      "reviews.text": "It is a very solid E-Reader. Nothing wrong with it at all."
    },
    {
      "reviews.date": "2016-01-20T00:00:00.000Z",
      "reviews.id": "71e3cdea-0879-4124-b267-54825bb117bd",
      "reviews.rating": 5,
      "reviews.text": "I had used the Kindle Paperwhite for quite awhile before I got intrigued by the Voyage seeing it in person. I was apprehensive about upgrading given the higher cost but it was entirely worth it. The Paperwhite is lite in weight but somehow the Voyage feels weightless. The screen is absolutely beautiful and to me the nicest feature is the screen is flush with the bezel around. Little learning curve to the page press on the side but tweaking the settings a little I have it down now."
    },
    {
      "reviews.date": "2014-12-26T00:00:00.000Z",
      "reviews.id": "235654a8-95a1-4bc9-9235-121726d335e4",
      "reviews.rating": 5,
      "reviews.text": "The better resolution and slightly smaller size makes a worthwhile investment if you read for hours. The commercials that tell you how much better it is to read on a Kindle Voyage vs a tablet are true. I read for hours at a time on weekly plane trips. If I use a tablet my eyes hurt after just a couple of hours. On a Kindle because of the side lighting I can read for 5 hours and my eyes never hurt ."
    },
    {
      "reviews.date": "2017-04-23T00:00:00.000Z",
      "reviews.id": "79b60eb7-39e3-4366-b9b3-59cad3d74168",
      "reviews.rating": 5,
      "reviews.text": "I love the kindle voyage. My favorite feature is that I can read while at the beach!! It's also very lightweight and fits in one hand."
    },
    {
      "reviews.date": "2014-11-04T00:00:00.000Z",
      "reviews.id": "58b5ab5f-953a-47cf-9ec9-6e09dbf83f42",
      "reviews.rating": 3,
      "reviews.text": "I have a Paper White 1 and 2. Honestly it is difficult to justify double the price value. I certainly like most added features but not sure its worth the extra money. To note it operates great just not sure its worth an upgrade to the latest greatest."
    },
    {
      "reviews.date": "2015-05-09T00:00:00.000Z",
      "reviews.id": "0930169d-8a4e-43af-b309-6a33aac19a1c",
      "reviews.rating": 5,
      "reviews.text": "Kindle is the best. In this version, storage and resolution screen has been improved."
    },
    {
      "reviews.date": "2016-06-22T00:00:00.000Z",
      "reviews.id": "32768a0c-2a79-4be1-b13b-c6cb5a632073",
      "reviews.rating": 5,
      "reviews.text": "This is an incredible product. I would much rather read on this than my iPad!"
    },
    {
      "reviews.date": "2015-04-17T00:00:00.000Z",
      "reviews.id": "698a5c94-d064-465d-ad44-f51f079459dd",
      "reviews.rating": 5,
      "reviews.text": "Reallllllllllllllllllllllllllllllllllllllllllllllly"
    },
    {
      "reviews.date": "2014-11-07T00:00:00.000Z",
      "reviews.id": "6e20c4e2-e896-4c56-99ff-ecb3c126926d",
      "reviews.rating": 5,
      "reviews.text": "User friendly and features a 4GB capacity for ample storage. PagePress provides reimagined page turns, and an adaptive front light promotes visibility in dimly lit areas. So far so good!"
    },
    {
      "reviews.date": "2015-07-28T00:00:00.000Z",
      "reviews.id": "b5d2a59c-7327-4bce-8fe2-ce19e78d8871",
      "reviews.rating": 5,
      "reviews.text": "Kindle Voyage is great, screen resolution is awesome, love the new page turn buttons (I missed these ones from my previous Kindle keyboard)."
    },
    {
      "reviews.date": "2015-09-16T00:00:00.000Z",
      "reviews.id": "72ab8af7-5b53-48ca-939e-3ac13641bb7b",
      "reviews.rating": 5,
      "reviews.text": "I like this Kindle Voyage. There is plenty of storage. The page turning is perfect."
    },
    {
      "reviews.date": "2015-08-01T00:00:00.000Z",
      "reviews.id": "72701137-b1c2-4878-8d2f-6d9066d7479d",
      "reviews.rating": 5,
      "reviews.text": "Amazon nailed it. Its readability is superior to the book. The new page turning feature is a great improvement over the previous version. And, BTW, you can carry a library with you wherever you go."
    },
    {
      "reviews.date": "2015-07-17T00:00:00.000Z",
      "reviews.id": "754d36db-0086-4c49-a46f-4fc2555c22df",
      "reviews.rating": 4,
      "reviews.text": "Hy husband loves his kindle.the back light so he can read anywhere with low eye strain is awsome"
    },
    {
      "reviews.date": "2015-11-27T00:00:00.000Z",
      "reviews.id": "4eb08092-0c85-4fbe-8dd5-e065b57cc099",
      "reviews.rating": 5,
      "reviews.text": "I love my kindle! It never runs out of battery. Used it on a three week detachment and never had to charge it."
    },
    {
      "reviews.date": "2017-07-19T00:00:00.000Z",
      "reviews.id": "385dcb08-ceb5-4269-b55b-92be27126a34",
      "reviews.rating": 5,
      "reviews.text": "Purchased after theft in Seattle. It was on sale and works great."
    },
    {
      "reviews.date": "2015-07-19T00:00:00.000Z",
      "reviews.id": "1420834b-6496-4c93-9f1a-77d3efceacdb",
      "reviews.rating": 5,
      "reviews.text": "so far so good,,,, wife very happy. misses her old one...."
    },
    {
      "reviews.date": "2016-12-19T00:00:00.000Z",
      "reviews.id": "2e078c71-54af-4ad1-a99d-9e3c2c93e37b",
      "reviews.rating": 4,
      "reviews.text": "Lost my \"paper white\" in airplane, have to buy new one. Voyage is latest model, I like it. Friend of mine wants one as well with my recommendation, so, bought two. Nice to have them!"
    },
    {
      "reviews.date": "2015-08-20T00:00:00.000Z",
      "reviews.id": "061a476c-eac7-490e-992a-fbc361b72d3e",
      "reviews.rating": 4,
      "reviews.text": "It is a great investment. Can read at night without disturbing partner. Only disadvantage is if you lose your place it is a little difficult to find it. This could be user problem."
    },
    {
      "reviews.date": "2015-04-17T00:00:00.000Z",
      "reviews.id": "bebb9bf0-4ba7-4b27-b95e-819b1a79539a",
      "reviews.rating": 5,
      "reviews.text": "I like the size and battery life. It would be nice to have instant definitions for foreign language books. I really like the vocabulary review."
    },
    {
      "reviews.date": "2017-01-25T00:00:00.000Z",
      "reviews.id": "778cf0cd-d52c-484e-94ea-f55e726da001",
      "reviews.rating": 5,
      "reviews.text": "Got this for a family member who had on older Kindle that stopped working. They absolutely love it."
    },
    {
      "reviews.date": "2016-07-24T00:00:00.000Z",
      "reviews.id": "ab6e7ee5-7023-430e-950f-7acafa11f4cf",
      "reviews.rating": 5,
      "reviews.text": "Purchased for my 83 years young husband who is an avid reader. Getting his books instantly was worth his fear of going to a kindle. He's surprised at the ease of use."
    },
    {
      "reviews.date": "2016-06-19T00:00:00.000Z",
      "reviews.id": "a9bad9c6-1b08-4cd8-a339-2ac4debaa0ff",
      "reviews.rating": 5,
      "reviews.text": "Goal: get an e- reader that allows one to read in any light situation. Goal achieved. Reading on the patio, beach is great. Easy to download books, lightweight, good battery life are all pluses"
    },
    {
      "reviews.date": "2015-04-25T00:00:00.000Z",
      "reviews.id": "3bb38094-e112-4a97-99ef-c1de379c49e9",
      "reviews.rating": 5,
      "reviews.text": "Better than older kindles. Reading a book on a kindle is easier than holding a book."
    },
    {
      "reviews.date": "2015-12-19T00:00:00.000Z",
      "reviews.id": "777b543a-94e9-4725-8318-efd11764b2d7",
      "reviews.rating": 5,
      "reviews.text": "When my Kindle Paper White was damaged (my fault), I was looking for a replacement. After reading many reviews online, both from \"experts\" and normal users, I chose the Voyager. I've been very satisfied with it. I particularly like the pressure sensitive edges for turning pages."
    },
    {
      "reviews.date": "2015-08-06T00:00:00.000Z",
      "reviews.id": "273801f1-f336-4a9b-bd89-51026e84d62e",
      "reviews.rating": 4,
      "reviews.text": "I had an old Sony e-reader that I loved but it wasn't working too well anymore. I decided that a Kindle was the only viable replacement on the market right now. (Looked at Kobo also). So far, I like it. Great screen, backlight on mine doesn't have the problems that others have complained about."
    },
    {
      "reviews.date": "2014-10-24T00:00:00.000Z",
      "reviews.id": "2351ae0d-1199-4bda-8045-576d182a1c83",
      "reviews.rating": 5,
      "reviews.text": "I am an avid reader, and have purchased both the first and second generations of the Kindle Paperwhite products. Upon reading about the Voyage, I knew I had to have one. Although it's a bit pricey for an e-reader, it's definitely worth it for me. As much as I read, I believe the new screen will result in less eye strain. It's a beauty to look at. Especially when held next to the Paperwhite 2nd gen and compared."
    },
    {
      "reviews.date": "2015-06-17T00:00:00.000Z",
      "reviews.id": "370644b0-c6c2-4e50-a1cc-107bb3a3f247",
      "reviews.rating": 5,
      "reviews.text": "The new voyage is so much better. They've made some major improvements. I love that you can swipe, or use the side controls. The writing is crystal clear. The batter life lasts forever. I recommend this to anyone!"
    },
    {
      "reviews.date": "2014-11-05T00:00:00.000Z",
      "reviews.id": "82bbdae6-fa84-49de-92a8-f0458e018856",
      "reviews.rating": 5,
      "reviews.text": "I know it is entirely a personally bias, but I love Kindles and this is one of the best Kindles ever."
    },
    {
      "reviews.date": "2015-06-08T00:00:00.000Z",
      "reviews.id": "0ec2034f-ad10-424c-be6f-0354dbfe0b9b",
      "reviews.rating": 4,
      "reviews.text": "It will be great if the screen is larger. Otherwise it is good."
    },
    {
      "reviews.date": "2016-09-10T00:00:00.000Z",
      "reviews.id": "0ec1e945-235e-4f43-8c37-d7fd2d619d60",
      "reviews.rating": 5,
      "reviews.text": "I read a lot so I wanted a light weight device. It's user friendly. You can adjust the brightness of light and turn pages easily. It fits nicely in my bag. I take it everywhere. I highly recommend it!"
    },
    {
      "reviews.date": "2016-08-19T00:00:00.000Z",
      "reviews.id": "c675bd83-ddd0-4997-8096-974611af3442",
      "reviews.rating": 4,
      "reviews.text": "Pros - weight is super light, small size, long battery, I fell it to floor a few times and screen didn't breakCons - it takes half second for the next page to appear on screen when turning pages, similar to \"fade in\" animation in PowerPoint. I would prefer more seemless appearance of next page."
    },
    {
      "reviews.date": "2015-01-29T00:00:00.000Z",
      "reviews.id": "7c6e907d-8642-4cef-8bbd-0fedf71658e3",
      "reviews.rating": 4,
      "reviews.text": "To begin with this is the best reader available right now. Brighter than the pw2. Just awesome. Whether or not its a worthwhile upgrade from the paperwhite is another topic. Either way, it's a great piece of hardware- light, good grip, light etc. there is one HUGE issue however! The background light is not uniform- it is tinged yellow towards the top and blue towards the bottom of the device. For a $200 device thats unacceptable! How much that bothers u will be subjective and u wont notice it as much once u get into your book. The problem was present on all 3 devices I purchased (and returned), to the exact same degree. I kept the last one because it still is an awesome reader and it seems like its a production issue. Going through amazon reviews, various online forums- it seems to be present on a large number of devices if not all. Amazon refuses to address the issue, probably because they'll get sued or something for releasing a wonky product, like the iphone antenna problem bottom line- great device, but you have a high risk of receiving a unit with the gradient issue (youtube it if u cant visualize what I'm talking about, tons of videos out there describing it) . How bad it is seems to depend on your personal luck, or which batch your local bestbuy has stock from, and most importantly it will bother you / what youre willing to settle for. In my case, i hated it but there was no alternative- the pw2 seemed like a huge downgrade in a head to head comparison so i decided to keep my voyage and live with it. If thats a problem for you, wait for the 2015 edition. The pw1 had this issue apparently and it was addressed quietly by amazon in the pw2."
    },
    {
      "reviews.date": "2015-11-06T00:00:00.000Z",
      "reviews.id": "688980d3-5e57-4fff-8c71-41398962abbe",
      "reviews.rating": 4,
      "reviews.text": "Love the backlight, great feature. Very light weight almost too much so."
    },
    {
      "reviews.date": "2015-04-18T00:00:00.000Z",
      "reviews.id": "e154d356-ba36-41e9-b6e6-c8b667bfe75a",
      "reviews.rating": 5,
      "reviews.text": "I upgraded my Kindle to the Kindle Voyage because I read in bed and the lamp kept my husband awake. I thought I would be able to use this Kindle without the lamp, but for me it is hard to read with the room completely dark even though the back lighting is adjustable. I still use the Kindle with the lamp on, but tilted to the floor so that there is just a little light in the room....I bought the magnetic case so when I open the lid, the Kindle wakes up. It is a little smaller than my old Kindle and fits in my purse perfectly. All in All I LOVE it and would highly recommend it."
    },
    {
      "reviews.date": "2014-11-28T00:00:00.000Z",
      "reviews.id": "5b61826d-ac66-4567-8fae-1aaa64544f7d",
      "reviews.rating": 5,
      "reviews.text": "The Kindle Voyage is light weight, slim. easy to use and so far has been a good product. The page turns very easily and the light works very well. The anti glare screen is the best!"
    },
    {
      "reviews.date": "2015-03-20T00:00:00.000Z",
      "reviews.id": "13819346-fad8-4d6f-864d-6674bdae6502",
      "reviews.rating": 5,
      "reviews.text": "had the larger paper white replaced with this model. LOVE IT!"
    },
    {
      "reviews.date": "2016-07-02T00:00:00.000Z",
      "reviews.id": "f3759b1f-6265-4042-8ade-1011338c38fc",
      "reviews.rating": 5,
      "reviews.text": "Has an efficient battery and works well. I've had every Kindle since the second generation and it is my favorite to date. I love the Amazon distressed leather cover."
    },
    {
      "reviews.date": "2016-07-23T00:00:00.000Z",
      "reviews.id": "c0af7668-bb6d-4643-a083-99edd27e8d92",
      "reviews.rating": 5,
      "reviews.text": "The more I thought about using my phone to read ebooks, the less I wanted to read. But the Voyage has gotten me back into reading. Light. Holds charge for week at least. Only request is I wish it could do white letters on black at night."
    },
    {
      "reviews.date": "2016-02-15T00:00:00.000Z",
      "reviews.id": "15660622-eedc-496b-92d8-ace68a4e9a51",
      "reviews.rating": 5,
      "reviews.text": "The new design is lighter, has a longer battery life and the page displays are crisp and clear. The light adapts to the environment you are reading in to keep the image consistent. The new Kindle Voyage is amazing!"
    },
    {
      "reviews.date": "2016-01-15T00:00:00.000Z",
      "reviews.id": "2c749ac4-636b-42eb-9fb8-4ba0af8fe658",
      "reviews.rating": 5,
      "reviews.text": "have owned 2 kindles this is far the best. no light required. simple to use"
    },
    {
      "reviews.date": "2016-03-28T00:00:00.000Z",
      "reviews.id": "7b965d77-94a5-400c-b2d3-17127f88bcd2",
      "reviews.rating": 5,
      "reviews.text": "Great product love the auto adjusting black lightLove the weight of the kindle light enough I can hold it with one hand an turn the pages"
    },
    {
      "reviews.date": "2014-11-04T00:00:00.000Z",
      "reviews.id": "b00e5f82-6bb1-4df4-adad-8407bb13a5b6",
      "reviews.rating": 5,
      "reviews.text": "i really like the voyage, it looks great, and worth the money."
    },
    {
      "reviews.date": "2016-08-19T00:00:00.000Z",
      "reviews.id": "cddb6f68-3e96-4bcd-8c12-cb4ca83abdbd",
      "reviews.rating": 5,
      "reviews.text": "I purchased both this and paperwhite, but it turns out I like it better than paperwhite even it cost me 20 bucks more."
    },
    {
      "reviews.date": "2014-12-25T00:00:00.000Z",
      "reviews.id": "8dba535b-96a5-44f1-986c-70c3a28e2787",
      "reviews.rating": 5,
      "reviews.text": "I never owned a Kindle before. This was easy to setup and get going.It also looks really good. The text is super easy to read even at smaller fonts. I also really like the buttons on the side that turn the pages because it is a lot easier to flip pages compared to tapping the screen."
    },
    {
      "reviews.date": "2017-01-06T00:00:00.000Z",
      "reviews.id": "58eb1438-dcf3-4d1a-9f6c-a89641ded0c7",
      "reviews.rating": 5,
      "reviews.text": "Previous one lost so wanted the same kind since I knew this was the best. It is my third Kindle and I love it."
    },
    {
      "reviews.date": "2015-01-02T00:00:00.000Z",
      "reviews.id": "102e0464-4115-4c46-bf09-e53d15c10918",
      "reviews.rating": 5,
      "reviews.text": "I have used both paperwhite and voyage, and voyage has improved its support on the files, allowing you to customize the format especially when you are reading in a foreign language."
    },
    {
      "reviews.date": "2016-11-02T00:00:00.000Z",
      "reviews.id": "c3f293db-0b7d-474f-a23d-2d0cfd340f44",
      "reviews.rating": 5,
      "reviews.text": "i was skeptical but glad I purchased. much faster than Nook or the paperwhite. Thin and easy to use. Screen appears brighter and wider than the paperwhite. Very thin and lightweight"
    },
    {
      "reviews.date": "2015-10-25T00:00:00.000Z",
      "reviews.id": "ce024cbd-cf7d-4028-b908-a7573ef0868f",
      "reviews.rating": 5,
      "reviews.text": "I love the adjustable font size and the front light which allows me to read in any lighting even without my glasses. Pagepress allows me to turn page effortlessly and i can close my book turning it off and when i resume reading I'm right back where i left off. Love it. Capacity is unbelievable."
    },
    {
      "reviews.date": "2016-01-16T00:00:00.000Z",
      "reviews.id": "778e0e32-3001-4e50-9577-973297a2f32e",
      "reviews.rating": 5,
      "reviews.text": "Had the older model that didn't light up... Was always having to get to a lamp. Now I can read anywhere without any worries. The light adjusts as needed. I get lost in my book without any worries. The screen is perfect size with great clarity and easy to travel with."
    },
    {
      "reviews.date": "2016-01-06T00:00:00.000Z",
      "reviews.id": "b6c2badd-867a-4dc5-8f6a-c18bd0ccdbed",
      "reviews.rating": 5,
      "reviews.text": "Always great to upgrade new from old version when the staff is always knowledgeable"
    },
    {
      "reviews.date": "2015-07-08T00:00:00.000Z",
      "reviews.id": "e214fdf4-0997-4918-ab06-1bf7f71c4694",
      "reviews.rating": 5,
      "reviews.text": "Do most of my reading on one of my Kindles. Reading in sun light to no light is great. Easier to take anywhere size wise compared to a paperback. Really great for traveling. Download several books so I have a variety to read from. Long charge life."
    },
    {
      "reviews.date": "2016-09-09T00:00:00.000Z",
      "reviews.id": "110e2851-721d-4ffa-9a48-a48c045b6bd9",
      "reviews.rating": 5,
      "reviews.text": "Easy to navigate, I love it despite the charging port. Charging port doesn't last very long though. Just purchased my second one."
    },
    {
      "reviews.date": "2015-04-24T00:00:00.000Z",
      "reviews.id": "a2cb1388-fa72-43b7-9416-0d9d09f5bd50",
      "reviews.rating": 5,
      "reviews.text": "even my luddite spouse loves it. Easy to use. Read in full sunlight."
    },
    {
      "reviews.date": "2015-08-05T00:00:00.000Z",
      "reviews.id": "5b085999-48fe-4ab4-b9b7-64b5c7df31d1",
      "reviews.rating": 4,
      "reviews.text": "Great ereader. Light and easy to use. Only issue is a bit pricey."
    },
    {
      "reviews.date": "2015-04-17T00:00:00.000Z",
      "reviews.id": "e17f7093-9d2b-4cce-84f6-5e21a8051ef4",
      "reviews.rating": 5,
      "reviews.text": "I love the new kindle. So much brighter then my old one."
    },
    {
      "reviews.date": "2017-06-22T00:00:00.000Z",
      "reviews.id": "faf0437f-231f-4b5f-9836-996dd111e078",
      "reviews.rating": 5,
      "reviews.text": "I love this. We love to travel and now I can download a bunch of books to read on our trips. Now that I have this I don't know how I survived those long flights without it."
    },
    {
      "reviews.date": "2016-10-07T00:00:00.000Z",
      "reviews.id": "a2cfe96d-997d-4bd0-9c6d-7a99810c2acf",
      "reviews.rating": 5,
      "reviews.text": "It took me a long time to buy an e-reader because I just love real books. But I am happy I bought this and so far, after a few months, I've experienced none of the discoloration that other users have mentioned about previous versions. Very happy with it."
    },
    {
      "reviews.date": "2015-03-20T00:00:00.000Z",
      "reviews.id": "39229e81-1961-489e-be45-800dc3168d9f",
      "reviews.rating": 5,
      "reviews.text": "My daughter enjoys her kindle. Lovethis product!!"
    },
    {
      "reviews.date": "2016-09-21T00:00:00.000Z",
      "reviews.id": "1d6884b6-cc75-4839-b491-309a336ba44a",
      "reviews.rating": 5,
      "reviews.text": "My first ebook reader. Read some reviews, decided to go with this because of the backlight and adaptive light. Sometimes I have to adjust the light manually but no biggie, quick and easy on the eyes."
    },
    {
      "reviews.date": "2016-03-21T00:00:00.000Z",
      "reviews.id": "94369401-73e6-421d-be3f-0e0e7a6904e1",
      "reviews.rating": 5,
      "reviews.text": "My husband loves his new kindle. Lightweight, fast, and the origami cover is great."
    },
    {
      "reviews.date": "2016-12-09T00:00:00.000Z",
      "reviews.id": "1084b976-5ebc-492d-aba5-5620ed5894f3",
      "reviews.rating": 5,
      "reviews.text": "My paperwhite died, so I went with the voyage, and I'm loving it. It's basically the same as the paperwhite, with the addition of sensors on the side to turn the page if you don't want to swipe the screen. And of course faster processor, etc."
    },
    {
      "reviews.date": "2016-11-02T00:00:00.000Z",
      "reviews.id": "2181b651-1b69-40a3-8a6c-d4354a2f77ca",
      "reviews.rating": 5,
      "reviews.text": "So much better than reading on an iPad, completely worth it. I guess my only complaint is the operating system still seems a little weak in terms of responsiveness and fluidity but doesn't really impact regular usage of just page turning, only felt while browsing the library/store etc."
    },
    {
      "reviews.date": "2015-05-14T00:00:00.000Z",
      "reviews.id": "6ef9d763-378a-40df-8e07-dc06c9f73a51",
      "reviews.rating": 5,
      "reviews.text": "why carry a book when you can have a library at your fingertips? Get one now!"
    },
    {
      "reviews.date": "2015-02-06T00:00:00.000Z",
      "reviews.id": "ea1a5a0d-62a9-4c0a-8bff-0ce3205c1a93",
      "reviews.rating": 5,
      "reviews.text": "I really missed my first kindle when my husband gave me a fire 2 years ago. I love to read outside and could not do that with a fire. The voyage is perfect, easy to read anywhere, much longer battery life than a fire. Very happy with it and the buttons are easy to use or you can just tap the screen to turn the page."
    },
    {
      "reviews.date": "2016-06-22T00:00:00.000Z",
      "reviews.id": "b1f7e674-473e-489d-9a6f-fbcbc893c777",
      "reviews.rating": 5,
      "reviews.text": "Absolutely love my new Kindle Voyager. Lightweight and compact size makes it easier to carry with me everywhere I go. Wish I had bought one sooner."
    },
    {
      "reviews.date": "2014-12-12T00:00:00.000Z",
      "reviews.id": "358a1966-8bff-4bdc-8529-5da9cfa3775d",
      "reviews.rating": 5,
      "reviews.text": "Great looking display. Text is sharp and easy to read. The lighting of screen is wonderful for reading in lower light environments. This is a little more compact than the paper white model. I really love the page press button areas. Makes it so you can turn pages without adjusting your hand (as long as you are holding the voyage with your thumb resting in the button area). Sounds like a minor thing, but to me it's a big convenience!"
    },
    {
      "reviews.date": "2015-06-08T00:00:00.000Z",
      "reviews.id": "d6c2e582-754e-499f-8e7a-45f39b462eba",
      "reviews.rating": 5,
      "reviews.text": "Highly recommend. Battery is perfect. Light weight too!"
    },
    {
      "reviews.date": "2014-11-04T00:00:00.000Z",
      "reviews.id": "d5fabed4-fe5f-4be5-9876-ab067309400e",
      "reviews.rating": 5,
      "reviews.text": "The Voyage is my first eReader and I am not disappointed. It is light, clear and a joy to use"
    },
    {
      "reviews.date": "2016-06-05T00:00:00.000Z",
      "reviews.id": "3320052f-a42a-4bc9-977b-8ae0b55725a5",
      "reviews.rating": 5,
      "reviews.text": "Small and easy to carry in my purse. I like that I can change the page on the sides without consistently dirtying the screen with fingerprints."
    },
    {
      "reviews.date": "2016-07-15T00:00:00.000Z",
      "reviews.id": "84a4b56e-db71-48c4-bb49-78bdcc93cb9f",
      "reviews.rating": 4,
      "reviews.text": "Very light weight and easy to read in different lighting conditions. Does not strain my eyes like the kindle fire if reading at night. I do wish Bestbuy carried more options for cases to fit the Voyage. They have none in the store at all."
    },
    {
      "reviews.date": "2015-06-17T00:00:00.000Z",
      "reviews.id": "d5053149-042c-4af1-b2e8-a484351c5e81",
      "reviews.rating": 5,
      "reviews.text": "I love my kindle for reading over my iPad now. Best buy gave me a good deal on this kindle, and fast and friendly service. This kindle is easy on my sensitive eyes and a pleasure to hold. I would recommend this to anyone looking for an e-reader."
    },
    {
      "reviews.date": "2017-03-31T00:00:00.000Z",
      "reviews.id": "21505394-b4cd-428b-b419-802090d7ffc5",
      "reviews.rating": 5,
      "reviews.text": "I had one of the original Kindles and I found that I just absolutely quit reading and it was because of the bulk and size of the Kindle. I decided to give this one a try and I absolutely love it and I'm back to reading every day and the reason is because it is more the size of a paperback. It's lightweight and I love that I can read at night without having have a light on. I did however purchase The Geek Squad protection after my dog that was sitting in my lap almost said it flying to the floor when he jumped up out of my lap"
    },
    {
      "reviews.date": "2015-01-10T00:00:00.000Z",
      "reviews.id": "37306fe4-c2cb-4937-981b-22e31d8e5450",
      "reviews.rating": 5,
      "reviews.text": "This is my second Kindle purchased. First one was 15 years ago and now the Kindle Voyage 2. I love my Kindle. You can read anywhere even outside in the sun. I read more than ever :)"
    },
    {
      "reviews.date": "2014-11-22T00:00:00.000Z",
      "reviews.id": "20761a12-1233-4d27-8555-3fd350c4b33e",
      "reviews.rating": 5,
      "reviews.text": "This kindle is a great product. I really enjoy it."
    },
    {
      "reviews.date": "2016-02-27T00:00:00.000Z",
      "reviews.id": "e1bca6f2-5340-4b14-8000-d99e606ef884",
      "reviews.rating": 5,
      "reviews.text": "I am very please with my Kindle Voyage. The size is perfect and the control lighting is exactly what I was looking for. Would recommend this to anyone."
    },
    {
      "reviews.date": "2016-01-06T00:00:00.000Z",
      "reviews.id": "04967c90-8c01-4251-b199-d23aea032cf9",
      "reviews.rating": 5,
      "reviews.text": "This is the best Kindle yet and I am loving it! For someone who suffers from eye strain but loves to read, the 300 dpi image resolution and the liquid ink technology are beyond compare. Buy it, you won't regret it!!"
    },
    {
      "reviews.date": "2014-11-27T00:00:00.000Z",
      "reviews.id": "6c185d74-d0fe-47da-b904-9d080b061ff5",
      "reviews.rating": 4,
      "reviews.text": "I waited for weeks to get this new model and am happy I did. I love the new features on the Kindle Voyage. Didn't give it 5 stars due to some difficulty with the pressure sensitive buttons. I don't know if it is a flaw with the design or operator error, but sometimes it is more challenging than I think it should be to get the page to turn. It is far easier to swipe the screen so this is what I typically do. But, regardless. . . I love the Voyage! It was definitely worth the wait!"
    },
    {
      "reviews.date": "2016-10-22T00:00:00.000Z",
      "reviews.id": "602e0cc0-3358-49a3-9a5a-297b4e83f416",
      "reviews.rating": 5,
      "reviews.text": "So happy with this Kindle! It's very easy to use, lightweight so you can carry it in your bag like you would with a paper book, except here you have an entire library with you."
    },
    {
      "reviews.date": "2016-05-23T00:00:00.000Z",
      "reviews.id": "3053b31b-b575-4475-8eb6-104001651a08",
      "reviews.rating": 5,
      "reviews.text": "Love it, love it!!! Have had several different models. like this one the best. The Kindle Fire was nice but had a hard time reading at night."
    },
    {
      "reviews.date": "2015-08-20T00:00:00.000Z",
      "reviews.id": "09c652f6-783a-42fc-aa0d-ec70ee66ab3f",
      "reviews.rating": 5,
      "reviews.text": "New kindle is so much better than paperwhite. Kitty hair always used to get stuck around the borders of the paperwhite - not a problem with the voyage."
    },
    {
      "reviews.date": "2015-12-20T00:00:00.000Z",
      "reviews.id": "d94caeb5-9989-4992-9ee9-471964cc72a0",
      "reviews.rating": 5,
      "reviews.text": "One of the things I love the most about my new Kindle is it's size. It slides so nicely into my compact purse, protective case and all. Another thing I've noticed is the lack of glare that I experienced with my old Kindle. It automatically adjusts to the light and I'm looking forward to being able to read it on the beach without a struggle. I also love the battery life - it goes on forever. The case I bought makes it possible to stand my Kindle up in front of me and read while I'm eating - a must for me - I never eat alone ;)"
    },
    {
      "reviews.date": "2016-01-16T00:00:00.000Z",
      "reviews.id": "417b69a9-edc0-49b9-bc69-e21fb638d7ee",
      "reviews.rating": 4,
      "reviews.text": "The touch page Turner is great, you don't have to finger swipe. Although it does take a little more pressure to use than I like I still think it is a great feature."
    },
    {
      "reviews.date": "2017-01-18T00:00:00.000Z",
      "reviews.id": "245bf25c-76e8-490b-b2bb-c56b687c227f",
      "reviews.rating": 5,
      "reviews.text": "I upgraded from the Kindle Touch so I could have a built in light. The light is fantastic. While it took some getting used to the press buttons for page turning on the side, I love that too. Can use it with one hand, and don't have to take hands off to touch the screen. The documentation could use some work. A diagram with what all those icons are that they refer to would be a big help. Took me a long time to figure out how to get the reading progress to what I wanted. One thing, I HATE the new bookmark method. The old 'corner fold' was easier and less intrusive. Still can figure out how to delete from My Clippings. Also I wish Amazon would come out with a case similar to an Otter Box. I don't want leather OR auto turn on, which seems to be problematic on nearly every case I look at."
    },
    {
      "reviews.date": "2016-09-24T00:00:00.000Z",
      "reviews.id": "e2d92d06-4966-49e0-bb20-fb67f21e9322",
      "reviews.rating": 5,
      "reviews.text": "It is more lightweight than my keyboard kindle 3. Love it"
    },
    {
      "reviews.date": "2017-03-15T00:00:00.000Z",
      "reviews.id": "82af93f9-398f-47c9-a56e-88800a3a84bc",
      "reviews.rating": 5,
      "reviews.text": "I would recommend this product. It works great and ver compact."
    },
    {
      "reviews.date": "2016-05-20T00:00:00.000Z",
      "reviews.id": "ca862be2-05fa-4c39-ac76-26c44892976e",
      "reviews.rating": 5,
      "reviews.text": "I previously had a first edition paper white and finally pulled the trigger on a voyage. I'm so glad I did, the resolution is great and it seems easier to read. I also like that the screen is completely flat. I don't really use the page turn buttons like I thought i would but it is nice to have the option."
    },
    {
      "reviews.date": "2015-02-04T00:00:00.000Z",
      "reviews.id": "ab59c425-7aba-4a64-9b68-a4522e13c9dd",
      "reviews.rating": 5,
      "reviews.text": "I previously own a kindle paperwhite version one then upgraded to kindle voyage.big difference. Worth the price!"
    },
    {
      "reviews.date": "2016-10-19T00:00:00.000Z",
      "reviews.id": "31b5cf8d-667b-474b-b3b7-03860b88f9c7",
      "reviews.rating": 5,
      "reviews.text": "Replacing my original white page Kindle. I love these readers! Like the new auto adjust backlight! Also like the new page turner slides on the sides of the screen. Great product!"
    },
    {
      "reviews.date": "2015-09-30T00:00:00.000Z",
      "reviews.id": "85b7f857-7244-4b1c-8001-36c8455a2ff5",
      "reviews.rating": 5,
      "reviews.text": "Easy to use. Comfortable to hold-lightweight and good size. The light adjustment is great. Easy to inadvertently turn the page-sometimes more than one-still trying to figure out how not to do that. Over all, though very happy with it"
    },
    {
      "reviews.date": "2016-09-02T00:00:00.000Z",
      "reviews.id": "4e75e47f-e166-4cae-8c5c-622492cd8044",
      "reviews.rating": 5,
      "reviews.text": "I was in need of a new Kindle. We were going on several trips and I needed it immediately . The person at Best Buy that helped me was excellent! He helped thru the entire setting up process. I walked out a very satisfied customer."
    },
    {
      "reviews.date": "2014-12-31T00:00:00.000Z",
      "reviews.id": "88d09437-f38e-401a-8c7f-f72de4828e44",
      "reviews.rating": 5,
      "reviews.text": "Was a late christmas gift to myself. Updated from the paperwhite 2 and the difference is very noticeable."
    },
    {
      "reviews.date": "2016-01-12T00:00:00.000Z",
      "reviews.id": "006a7f0e-4c0e-4ce4-addf-11e030cb23a7",
      "reviews.rating": 4,
      "reviews.text": "First, the good news. The screen is a nice brightness and the words are crisp and clear. Best of all, it is so light and tiny (esp. in the Origami case) that it is super-easy to carry around in a purse. Love that. Also it has an amazing battery life; I have never had it run out on me and I don't even have to recharge it all the time. I thought this would be perfect but I am having two problems: (1) turning pages is not as easy or pleasant as my much-older, now-defunct Kindle. If I don't touch the screen in the right place, the page won't turn, and it usually has an annoying split-second black flash on the screen. The ancient Kindle was easier. (2) About half the time, when I return to reading, the screen is \"frozen\" on the ad. It says \"swipe to open\" but no amount of swiping gets it going. I have to reach to the rear of the kindle (which means disassembling the crimp in the Origami) to press the button on the back to get it to function again. There is no rhyme nor reason to when this happens but it's about half the time. Perhaps I am doing something wrong regarding both flaws but there is no one to ask about it, Best Buy staff doesn't know."
    },
    {
      "reviews.date": "2015-08-14T00:00:00.000Z",
      "reviews.id": "bd2fa178-b49d-4a84-85d8-d4421935b2f5",
      "reviews.rating": 5,
      "reviews.text": "This reader is much more comfortable to hold than the Paperwhite. It is not quite as light as the Nook Glowlight, but the screen is much sharper."
    },
    {
      "reviews.date": "2017-09-30T00:00:00.000Z",
      "reviews.id": "3585f426-0197-4317-8080-1165f4b2ee13",
      "reviews.rating": 5,
      "reviews.text": "The screen is great outside but the biggest difference is the speed of page refresh. Having the page turn buttons back on the side is awesome!"
    },
    {
      "reviews.date": "2015-09-04T00:00:00.000Z",
      "reviews.id": "d2a8d85d-c825-4e9c-9456-9e3d84e41363",
      "reviews.rating": 5,
      "reviews.text": "Lightweight easy read easy page turning self adjusting read light great too."
    },
    {
      "reviews.date": "2015-03-13T00:00:00.000Z",
      "reviews.id": "6abac8fe-57aa-4628-a3ee-5be1fe96566c",
      "reviews.rating": 5,
      "reviews.text": "So many improvements over previous models. Love the new page turn feature."
    },
    {
      "reviews.date": "2016-10-12T00:00:00.000Z",
      "reviews.id": "0caafe20-4140-4be3-b663-612159982d74",
      "reviews.rating": 5,
      "reviews.text": "love kindles and this one is the best one made by amazon. but expensive."
    },
    {
      "reviews.date": "2014-11-04T00:00:00.000Z",
      "reviews.id": "ea3b4331-21fe-4ca3-98a7-3e5073e92892",
      "reviews.rating": 5,
      "reviews.text": "Wow! it is so nice to have a light and easy to hold device that only carries tons of books! No distractions like on my iPad, with email messages pinging in and facebook updates to check...just books and lots of them!The Kindle Voyage is everything they said it would be...light, back lit with self adjusting levels, page turners, all the bells and whistles. I am so glad I waited and splurged for this one!"
    },
    {
      "reviews.date": "2015-08-29T00:00:00.000Z",
      "reviews.id": "a3049e00-5f53-4def-a116-4a777f62b06b",
      "reviews.rating": 5,
      "reviews.text": "So user friendly that I had it for over a month before I read the owners guide to learn all the other features. Makes reading a book effortless. A must have for the avid book reader."
    },
    {
      "reviews.date": "2015-01-16T00:00:00.000Z",
      "reviews.id": "353ddcbe-5054-4435-9107-45ae562fdd93",
      "reviews.rating": 5,
      "reviews.text": "Purchased for my mother for Christmas. She hasn't put it down since."
    },
    {
      "reviews.date": "2018-03-21T00:00:00.000Z",
      "reviews.id": "aa7ae67d-411a-4257-9d9f-1df09fdf5553",
      "reviews.rating": 4,
      "reviews.text": "Son loves it and uses it all e time but I wish it would share my audible acct so e would read what I listen to without us having to buy some items in two formats.. Recommended"
    },
    {
      "reviews.date": "2015-05-12T00:00:00.000Z",
      "reviews.id": "f794ddef-1c0d-4855-b9e8-b36843a824eb",
      "reviews.rating": 5,
      "reviews.text": "This is my 3rd Kindle and I think its the best yet! Love the new features and will never go back to paperback books again"
    },
    {
      "reviews.date": "2017-01-18T00:00:00.000Z",
      "reviews.id": "9dfc280f-3134-4fc1-b171-6647d2f10831",
      "reviews.rating": 5,
      "reviews.text": "Since my Kindle Paperwhite died, this new Voyage has been a good replacement."
    },
    {
      "reviews.date": "2015-03-13T00:00:00.000Z",
      "reviews.id": "f701dd08-8c57-4c4e-9c95-4ebd14ff59d2",
      "reviews.rating": 5,
      "reviews.text": "I like it. However, when reading the page number is not shown. Also unable to use the dictionary. Still in the 'new' stage."
    },
    {
      "reviews.date": "2016-05-31T00:00:00.000Z",
      "reviews.id": "f27ba717-9a35-404d-80f7-dfb99c1cc190",
      "reviews.rating": 4,
      "reviews.text": "I exchanged the paper white that I had bought for this Voyage. This is thinner, lighter and just easier to hold than the paperwhite. Still getting used to the archive system since I had a Nook before, bit of a learning curve. But I like the Kindle interface better than the Nook, the book suggestions and shopping for books is much better. The only thing I miss is that the Kindle doesn't tell you what % battery you have left, it just shows you the bar in the battery symbol."
    },
    {
      "reviews.date": "2015-04-09T00:00:00.000Z",
      "reviews.id": "487d8ab7-6769-44c9-a485-566157b7592c",
      "reviews.rating": 4,
      "reviews.text": "the reader is very compact so it can easliy fit into a bag or pocket. The auto light feature is also a plus.it takes a little bit to get adjusted to the side tabs and presume that future versions of this device will be improved upon."
    },
    {
      "reviews.date": "2016-06-26T00:00:00.000Z",
      "reviews.id": "fb6f4693-619f-40a4-b998-999580dc75a3",
      "reviews.rating": 4,
      "reviews.text": "I bought this as a replacement for an older model Kindle my father wore out. Unfortunately, he cannot remember the email and password for the older model, so I cannot transfer the thousands of books he has to the new Kindle. Always write down that important information somewhere, it will make life a lot easier!"
    },
    {
      "reviews.date": "2015-08-15T00:00:00.000Z",
      "reviews.id": "9ab05547-b4a5-43fe-9906-d5bdd5f35c49",
      "reviews.rating": 3,
      "reviews.text": "I replaced my older Kindle Keyboard, which is larger and heavier than this kindle. Page turning takes some getting used to - I keep touching screen and turning page by mistake. You're able to turn the \"side buttons\" page turning off, but can't turn the touchscreen page turning off - it sure would be nice to allow page turns only with the \"side buttons\" - I think this is a major design flaw. Also, the audio option seems to be missing - you can't have books read aloud to you anymore. Also, no 3G. I almost returned this, but didn't get around to it, so I'm stuck with it."
    },
    {
      "reviews.date": "2015-11-02T00:00:00.000Z",
      "reviews.id": "69a3d1c4-fc2a-4285-ae7b-5422afbb0dd3",
      "reviews.rating": 4,
      "reviews.text": "Very nice and easy to use and the kindle is great."
    },
    {
      "reviews.date": "2014-12-19T00:00:00.000Z",
      "reviews.id": "8e56c8de-f48d-4532-acf1-394fa148a1c1",
      "reviews.rating": 3,
      "reviews.text": "Was a Christmas gift and I ended up returning it because it wasn't exactly what I was looking for."
    },
    {
      "reviews.date": "2015-11-02T00:00:00.000Z",
      "reviews.id": "e9bc75db-615e-438f-a1e6-c812079ce5bf",
      "reviews.rating": 5,
      "reviews.text": "We bought this reader to replace a Fire HDX that had seemed to go wonky. Turns out a couple of system resets and the HDX is back to normal so I get the old one, she gets the new one.But I can highly recommend this reader - the clarity of the text and the overall functionality is excellent."
    },
    {
      "reviews.date": "2017-01-06T00:00:00.000Z",
      "reviews.id": "8a34c428-2f6e-431a-b0e8-6def969e1efc",
      "reviews.rating": 4,
      "reviews.text": "Good value, enjoy using it! I recommend this highly!"
    },
    {
      "reviews.date": "2016-03-25T00:00:00.000Z",
      "reviews.id": "9654887c-cecd-4235-b18d-15fdcaabc7e7",
      "reviews.rating": 5,
      "reviews.text": "Nice, nice, nice, nice, nice, nice, nice, nice, nice"
    },
    {
      "reviews.date": "2016-02-27T00:00:00.000Z",
      "reviews.id": "493efa03-5709-474f-b031-f41508e0c010",
      "reviews.rating": 4,
      "reviews.text": "Extra features are nice and upgrading from the Kindle Paperwhite was fairly simple. Amazon did an automatic system update which was not cool. There should have been an option to update when we wanted, not when they wanted."
    },
    {
      "reviews.date": "2014-11-04T00:00:00.000Z",
      "reviews.id": "9e380872-3ba1-4387-befa-a5126ae32c63",
      "reviews.rating": 4,
      "reviews.text": "New Kindle Voyage is a nice upgrade from the basic model. Smaller e reader with a brighter light. So far so good."
    },
    {
      "reviews.date": "2016-02-27T00:00:00.000Z",
      "reviews.id": "4ceb36d3-184e-450a-988b-dafb0ce63f01",
      "reviews.rating": 5,
      "reviews.text": "Great for reading any book, light weight, easy to use best Kindle on the market."
    },
    {
      "reviews.date": "2015-03-17T00:00:00.000Z",
      "reviews.id": "7cc7bc53-c2b9-4de4-88f1-89462c065f73",
      "reviews.rating": 3,
      "reviews.text": "It has what i wanted click to turn page and that is the only reason i paid that price for it. there is nothing special about it. i thhought that the battery would last longer and as an avid reader it doesn't last long enough."
    },
    {
      "reviews.date": "2015-07-27T00:00:00.000Z",
      "reviews.id": "fbef70f3-2ac6-4639-835f-4b4fc90bbbc6",
      "reviews.rating": 3,
      "reviews.text": "Replaced a v1 nook but this is not better for reading"
    },
    {
      "reviews.date": "2015-11-27T00:00:00.000Z",
      "reviews.id": "ca859eea-6a71-498f-b284-f521445097bf",
      "reviews.rating": 4,
      "reviews.text": "Clear screen, buttons act up a little. After numerous days of review I feel that this was the best option."
    },
    {
      "reviews.date": "2016-10-14T00:00:00.000Z",
      "reviews.id": "70810b6b-7e30-4c8a-a780-152c533e92c9",
      "reviews.rating": 3,
      "reviews.text": "Have had it for a while noe. A littlebit unusual to press so hard to change page but now starting to get used to it."
    },
    {
      "reviews.date": "2015-02-04T00:00:00.000Z",
      "reviews.id": "c9ea516f-4b75-4965-9247-0c0b490e6804",
      "reviews.rating": 5,
      "reviews.text": "My wife and I both enjoyed our Kindle Voyage so much that we had to buy a second one. This is our first E-reader, and it could not be more user-friendly. It works well in all kinds of environments and lighting conditions. A definite winner!"
    },
    {
      "reviews.date": "2016-06-10T00:00:00.000Z",
      "reviews.id": "5cb4f051-c517-48e9-9dc7-7b8b8cbc5b0a",
      "reviews.rating": 4,
      "reviews.text": "Turning,sometimes the pages turn when your not aware of it. The battery length is much better."
    },
    {
      "reviews.date": "2015-01-25T00:00:00.000Z",
      "reviews.id": "94be53c5-864d-438d-8c78-e56bc813d104",
      "reviews.rating": 5,
      "reviews.text": "the best feature of this Kindle is the page forward/back buttons which allow you to turn pages without taking hards off the unit."
    },
    {
      "reviews.date": "2016-03-11T00:00:00.000Z",
      "reviews.id": "db279fcc-c226-4696-b15b-bc0556d37056",
      "reviews.rating": 4,
      "reviews.text": "the screen flush with the sides is great. The glass feeling is really nice. I don't use the side buttons for page turning but only because of habit. They are great and the need for pressure allows me to hold the kindle without changing pages. But, the price is painful. It is a splurge purchase since the paperwhite is just about as good in nearly every respect."
    },
    {
      "reviews.date": "2017-03-03T00:00:00.000Z",
      "reviews.id": "a5264862-9290-438c-8a82-9a42de7c005f",
      "reviews.rating": 5,
      "reviews.text": "The voyage is light and has a battery life of Two weeks. In different light settings the Voyage automatically adjusts. My eyes do not get tired from bad lighting. Reading outside is no problem for the Voyage."
    },
    {
      "reviews.date": "2015-06-26T00:00:00.000Z",
      "reviews.id": "2ec61874-d6eb-4ff7-a5c0-f22d5316e303",
      "reviews.rating": 5,
      "reviews.text": "Perfect e-reader with great screen and backlight. Works great in every condition. Definitely recommend the Kindle Voyage!"
    },
    {
      "reviews.date": "2017-01-09T00:00:00.000Z",
      "reviews.id": "57ff7b2d-5ea6-409a-a551-6f84bb782278",
      "reviews.rating": 4,
      "reviews.text": "Love this product. Glad I upgraded! The features make it easy to read while traveling by car or plane."
    },
    {
      "reviews.date": "2015-03-06T00:00:00.000Z",
      "reviews.id": "2174a23d-ea17-4ade-aa41-68aae9c6d719",
      "reviews.rating": 5,
      "reviews.text": "I find myself reading even more now that I have the Kindle Voyage. It is easy to hold and maneuver, the perfect size, small and sleek. Page turning is easy with one hand and the back light makes reading in any setting a pleasure."
    },
    {
      "reviews.date": "2015-05-19T00:00:00.000Z",
      "reviews.id": "1673481d-83b2-481d-b580-ede916df1e02",
      "reviews.rating": 5,
      "reviews.text": "I've enjoyed the original Kindle (with keyboard) for many years, and it was finally time to upgrade. The light is great, and I use the page press buttons exclusively. Very happy with the size, weight, and appearance of this product."
    },
    {
      "reviews.date": "2017-09-29T00:00:00.000Z",
      "reviews.id": "da681e17-fdfd-4259-a493-afe63b1cf522",
      "reviews.rating": 5,
      "reviews.text": "My wife cannot put this device down. Crystal clear image and great for those long airplane rides. This is a very lightweight device, very functional and very user-friendly."
    },
    {
      "reviews.date": "2016-04-23T00:00:00.000Z",
      "reviews.id": "477dc392-81a5-4785-96a0-4cd27dc3477d",
      "reviews.rating": 5,
      "reviews.text": "Love my Kindle! I take it with me everywhere! I would recommend this to all my friends and family!"
    },
    {
      "reviews.date": "2017-04-28T00:00:00.000Z",
      "reviews.id": "419d6923-030d-4815-a038-ea7643c6fe6e",
      "reviews.rating": 5,
      "reviews.text": "If you are a digital reader, you need a Kindle. This is excellent, but expensive. If you are a casual reader you will probably be happy with a less expensive Kindle. I do recommend a case."
    },
    {
      "reviews.date": "2015-07-10T00:00:00.000Z",
      "reviews.id": "b5bbf56a-436d-4f6c-97df-80e167b501de",
      "reviews.rating": 4,
      "reviews.text": "pros - light compact bright fast response from touch screencons- hard to navigate. I use my old kindle with buttons to browse. This kindle can be frustratingwith its overly sensitive touch screen.Overall a very good reader but no need to purchase if happy with paperwhite versions. For someone new to kindle it is worth the price as long as have another electronic device to browse the kindle site."
    },
    {
      "reviews.date": "2017-04-22T00:00:00.000Z",
      "reviews.id": "47e97fbe-18ac-4b7d-be36-36d6708c7a6b",
      "reviews.rating": 5,
      "reviews.text": "Ergonomic and easy to get new books. My house is full of books and I need to quit stockpiling them. And I can't remember what I read years ago. This device helps."
    },
    {
      "reviews.date": "2016-06-22T00:00:00.000Z",
      "reviews.id": "dcc5f599-2b41-40b3-b122-0873bd2e1c32",
      "reviews.rating": 5,
      "reviews.text": "I have had both older E-ink Kindle and Nook readers as well as the larger color screen versions and this new one is the best one yet. Very light, portable, battery lasts a long time. The screen is much better than the older E-ink Kindle. I recently binged through the 4th book of Game of Thrones, and it was an easy read on the Kindle. I highly recommend this to any reader. My teenage daughter also enjoys reading on the Kindle as well as opposed to the regular books."
    },
    {
      "reviews.date": "2017-12-21T00:00:00.000Z",
      "reviews.id": "500f93c9-7ea1-46a8-88eb-180ac325170f",
      "reviews.rating": 5,
      "reviews.text": "Coming from a nook reader. Love the even backlighting and weight."
    },
    {
      "reviews.date": "2016-01-06T00:00:00.000Z",
      "reviews.id": "e7bd47cb-7d5e-41fc-ae11-844122eae55e",
      "reviews.rating": 5,
      "reviews.text": "Never thought I would enjoy reading again because reading a boundbook made my eyes to tired to finish one. With the Voyage, I don't get that feeling."
    },
    {
      "reviews.date": "2017-01-06T00:00:00.000Z",
      "reviews.id": "16d37b62-673f-498c-bcf5-6e4529c49ed5",
      "reviews.rating": 5,
      "reviews.text": "Very easy and portable I take it everywhere with me"
    },
    {
      "reviews.date": "2015-04-15T00:00:00.000Z",
      "reviews.id": "0699122c-40ae-47fb-a731-8e1d4937e3ca",
      "reviews.rating": 4,
      "reviews.text": "I enjoy how small this version is, although if you are looking for a lot of features, I would recommend other Kindle products. Pretty much, this is similar to carrying around a paperback book in size and portability."
    },
    {
      "reviews.date": "2014-10-27T00:00:00.000Z",
      "reviews.id": "5eb6de4f-e296-40d3-887c-164618ae8eef",
      "reviews.rating": 5,
      "reviews.text": "First of all I'm amazed I could buy it from Best Buy, while Amazon says it will be in stock on December 1st (in more than a month from now). Best Buy is indeed the best!The Voyage itself is simply fantastic. The size is right, it's very lightweigh, quite zippy, text is super crisp, and I love the auto-brightness feature."
    },
    {
      "reviews.date": "2015-02-03T00:00:00.000Z",
      "reviews.id": "1d04d2e8-7b6d-4b0e-96fd-82767209238c",
      "reviews.rating": 4,
      "reviews.text": "The automatic light adjustment is pretty cool, but I find myself accidentally covering the sensor which really throws it off.I like being able to press the buttons on either side instead of touching the screen. I also appreciate the flat surface, it doesn't seem to attract as much dust in the corners like my other kindles."
    },
    {
      "reviews.date": "2016-03-26T00:00:00.000Z",
      "reviews.id": "f8ed4b74-3ac7-4b2d-8a06-ac714acd7e53",
      "reviews.rating": 4,
      "reviews.text": "I like the small, light weight size, and the adaptive lighting. But the page turning is too sensitive, skipping ahead many pages when I am just moving the Kindle, and going back and then forward when I am trying to change just one page."
    },
    {
      "reviews.date": "2014-10-26T00:00:00.000Z",
      "reviews.id": "476e0190-c3b5-4743-9851-ca945e2a65b6",
      "reviews.rating": 4,
      "reviews.text": "The new Kindle Voyage is quite a step forward for the Kindle dedicated reader line. It is a beautiful device - almost like something from Apple. I like the lighted screen and the page forward and back \"buttons\" on the sides of the device. But it is rather pricey - not yet convinced it is worth the upcharge."
    },
    {
      "reviews.date": "2014-11-21T00:00:00.000Z",
      "reviews.id": "a577c394-2920-4a5c-96e8-dfda8cdc9a5e",
      "reviews.rating": 5,
      "reviews.text": "I love my new Kindle! I have owned them all and each one improves on the last. It's a great way to read! I have the origami book cover as well and did not expect to like it but actually, I love it!"
    },
    {
      "reviews.date": "2017-09-09T00:00:00.000Z",
      "reviews.id": "7f8915da-a330-46b6-a924-afab9784dd00",
      "reviews.rating": 5,
      "reviews.text": "This is my first e-reader and it was just the best choice I could have ever made."
    },
    {
      "reviews.date": "2015-08-21T00:00:00.000Z",
      "reviews.id": "d9f134b1-118c-4b08-ba68-f238c8776d78",
      "reviews.rating": 5,
      "reviews.text": "Love the new look and feel of my new Kindle Voyage. I especially love how it adjusts the reading light automatically."
    },
    {
      "reviews.date": "2015-07-05T00:00:00.000Z",
      "reviews.id": "73cc95d6-bd1a-43fa-9180-0303eadcb41c",
      "reviews.rating": 5,
      "reviews.text": "This new kindle is so much easier to read than my second generation kindle that I had for years. It is faster, and the back-light can be adjusted easily to get the right amount of light for your reading pleasure. If you love books, you should get this."
    },
    {
      "reviews.date": "2016-11-18T00:00:00.000Z",
      "reviews.id": "b1fedb01-e9ef-4227-889e-eccc6fe82565",
      "reviews.rating": 5,
      "reviews.text": "I enjoy my kindle and would recommend to anyone. There is a good choice of books and reading material also."
    },
    {
      "reviews.date": "2014-11-02T00:00:00.000Z",
      "reviews.id": "a79bc5ed-03fd-46a4-a985-9e671a45e6d8",
      "reviews.rating": 5,
      "reviews.text": "Got this as an upgrade to my Kindle Touch. Page turns are crisp (the pressure-sensitive page buttons on the sides are a nice addition). I especially like the self-adjusting brightness. Very happy with the purchase. Battery life is great so far, even with the backlight on."
    },
    {
      "reviews.date": "2015-07-26T00:00:00.000Z",
      "reviews.id": "c3e59b05-ccd3-46ec-8037-244db6336d39",
      "reviews.rating": 5,
      "reviews.text": "I am extremely pleased with my Kindle Voyage. It lives up to the hype. It is slightly smaller and lighter than the previous version. The ambient light monitor works well. Text is clear and very readable. My only negative comment would be that the battery does not seem to last as long as I expected. I have recently retired; so I am reading more. I recharge the reader about every week and a half. That said, I am reading indoors and perhaps the ambient backlighting is on more than normal."
    },
    {
      "reviews.date": "2016-10-14T00:00:00.000Z",
      "reviews.id": "d36d458d-c2d9-4009-a2a0-5cf5c013a8a1",
      "reviews.rating": 5,
      "reviews.text": "It's a great screen and extremely lightweight to hold. Perfect!"
    },
    {
      "reviews.date": "2015-04-15T00:00:00.000Z",
      "reviews.id": "398f6875-37c2-4ec9-bee0-dfa6cc7bf78e",
      "reviews.rating": 5,
      "reviews.text": "I purchased this for my girl friend and she absolutely loves it. She reads around 3-4 books a week."
    },
    {
      "reviews.date": "2016-06-17T00:00:00.000Z",
      "reviews.id": "4bb12540-72a6-49e6-b25b-f9882d8835b6",
      "reviews.rating": 4,
      "reviews.text": "This is by far the best reader for all lighting environments. The only drawback I see are the constant ads when you log on to the device, and the library interfaceneeds to be more intuitive. However, I'm very satisfied with my purchase and use of this Voyage. I've already read over six books with it in just 3+ weeks."
    },
    {
      "reviews.date": "2015-12-11T00:00:00.000Z",
      "reviews.id": "f865ff6e-7560-416f-8432-2d6122f577ac",
      "reviews.rating": 5,
      "reviews.text": "my 8 year old son has a new found passion for reading now that he is using this kindle."
    },
    {
      "reviews.date": "2016-09-23T00:00:00.000Z",
      "reviews.id": "19c93905-7d16-405e-a6b9-64667c8c57a7",
      "reviews.rating": 5,
      "reviews.text": "This Kindle makes reading even more enjoyable. Very light in the hand, amazing back light. Very highly recommended."
    },
    {
      "reviews.date": "2014-11-04T00:00:00.000Z",
      "reviews.id": "fd98435e-b123-4e66-b370-ef9db8951165",
      "reviews.rating": 4,
      "reviews.text": "The Kindle Voyage is the best e-reader experience available. Text is super-sharp, it's comfortable to hold, the built-in self-adjusting light is awesome, and you change the page by either swiping with your finger or pushing down on the bezel. Unfortunately, all those great features come at a $199 price that is $80 more than Amazon's Kindle Paperwhite and more than double the cost of the company's entry level reader, both of which are excellent in their own right. So five stars for the device itself and minus one star for the high price."
    },
    {
      "reviews.date": "2015-04-10T00:00:00.000Z",
      "reviews.id": "6bea8cd4-1d52-4877-8ced-5c317f9f65d8",
      "reviews.rating": 5,
      "reviews.text": "Love the small size and the auto light. Use this every day."
    },
    {
      "reviews.date": "2015-04-16T00:00:00.000Z",
      "reviews.id": "ccb43143-4382-4b3f-bc5e-7b59176b5a71",
      "reviews.rating": 5,
      "reviews.text": "excellent screen, the small changes to the form make a huge different (I adore the flatness so much), and the brightness is a perfect for daylight. IMO, worth the cost"
    },
    {
      "reviews.date": "2015-04-15T00:00:00.000Z",
      "reviews.id": "1a50bcac-d943-492e-9384-1b535809979d",
      "reviews.rating": 5,
      "reviews.text": "when I compare the screen of this voyage to my previous paperwhite, the qualify of the display was much better. light is more even and soft."
    },
    {
      "reviews.date": "2015-07-12T00:00:00.000Z",
      "reviews.id": "e7cdf53b-aeeb-4378-8ff9-cd1ba57317e9",
      "reviews.rating": 4,
      "reviews.text": "Hands down the best ereader available. I researched several devices and it came down to the Paperwhite and the Voyage. There is a pretty hefty price premium for the Voyage. Most people will probably be very satisfied with the Paperwhite. I typically need reading glasses to read regular size print. On an eReader the font can be adjusted to make it large enough so I don't need to use the glasses. That means less text on each page and many more page turns. The physical \"buttons\" hep make the page turns easier and extra light brightness helps to add contrast to the text. These were enough to sell me on the Voyage. It was the right decision and I love the device."
    },
    {
      "reviews.date": "2016-05-13T00:00:00.000Z",
      "reviews.id": "cf1b7625-11c0-46af-bb2d-d6e715fc492d",
      "reviews.rating": 5,
      "reviews.text": "I was a little bit hesitant to get the Voyage over the Paperwhite and after holding the two I knew I wanted the Voyage. This device has been perfect! (Advice: Ask Amazon to remove the ads if you're a Prime member!)"
    },
    {
      "reviews.date": "2017-09-21T00:00:00.000Z",
      "reviews.id": "df67a70f-ba49-4be0-ad7a-882de5314f71",
      "reviews.rating": 5,
      "reviews.text": "To advance the page or go back to the previous one, just press lightly on a pair of gray lines and dots on either side of the front bezel. Is nice to see the transition. This Kindle is readable in any light. There‚Äôs even an optional \"Nightlight\" mode that gradually changes the brightness. Lastly, the power button has been moved back here from the bottom edge."
    },
    {
      "reviews.date": "2015-07-09T00:00:00.000Z",
      "reviews.id": "eb9a0a1b-679f-47ae-93a8-7b348a02dccf",
      "reviews.rating": 5,
      "reviews.text": "I have been a Kindle reader for years now but this is the first device I have used with a backlight and I have to say the eye strain is lower and the reading experience better than ever. For a pure reading device I do not know how it could be better other than lowering the price tag."
    },
    {
      "reviews.date": "2016-10-20T00:00:00.000Z",
      "reviews.id": "129cefa5-73f7-4f3f-81ca-bbd3b9b6aeb2",
      "reviews.rating": 5,
      "reviews.text": "I bought this unit for my daughter who loves to read but sometimes get frustrated by the size format of paper books and the weight of traditional tablets. The e-ink is super easy to read and the unit weighs next to nothing. A bit spendy for something you can only use to read on but so so nice to use."
    },
    {
      "reviews.date": "2015-06-21T00:00:00.000Z",
      "reviews.id": "3b9cb11c-da48-4966-8095-2173448208db",
      "reviews.rating": 5,
      "reviews.text": "This is a really great upgrade from the regular Kindle, however, it's not such an appealing product after Amazon updated the base Kindle to the same hi-resolution screen. May be worth waiting to see if Amazon upgrade the Voyage over the coming months."
    },
    {
      "reviews.date": "2016-12-03T00:00:00.000Z",
      "reviews.id": "8009e722-99ea-4711-96b1-213562fb2155",
      "reviews.rating": 5,
      "reviews.text": "This is my third kindle and is the best by far. The smaller size is great because it fits nicely in my purse so I never leave home without it. Other great features are page turning, adjusting light and weight."
    },
    {
      "reviews.date": "2015-04-14T00:00:00.000Z",
      "reviews.id": "244d89b0-7dda-4a11-a10a-dd0249f13b1f",
      "reviews.rating": 5,
      "reviews.text": "This is the reading machine I will recommended for everyone. The sharp font and responsiveness is unparalleled"
    },
    {
      "reviews.date": "2015-08-24T00:00:00.000Z",
      "reviews.id": "c7bbf73d-0f09-4a5b-8952-1c54c345ca7a",
      "reviews.rating": 5,
      "reviews.text": "We upgraded from an older paper white and couldn't be happier."
    },
    {
      "reviews.date": "2015-02-04T00:00:00.000Z",
      "reviews.id": "25057524-3ad8-4568-9ecc-3624ef3e09a7",
      "reviews.rating": 5,
      "reviews.text": "Text is clear. Nice not to have the battery die every few days like a conventional tablet."
    },
    {
      "reviews.date": "2016-06-03T00:00:00.000Z",
      "reviews.id": "a9378725-6a87-4f69-b65e-c7d6726ffe52",
      "reviews.rating": 5,
      "reviews.text": "This is very easy to read and just the right size and weight to carry."
    },
    {
      "reviews.date": "2017-02-17T00:00:00.000Z",
      "reviews.id": "d27308b4-a912-4a4b-8b44-d4a04846bb4d",
      "reviews.rating": 5,
      "reviews.text": "Good replacement for a paperwhite. The addition of the page forward and page backward buttons is huge!"
    },
    {
      "reviews.date": "2016-03-11T00:00:00.000Z",
      "reviews.id": "177d093b-2215-408f-8ed5-eb1b1a9c1ba2",
      "reviews.rating": 5,
      "reviews.text": "easy to read, great product When I use different readers they keep tract of where I am in each."
    },
    {
      "reviews.date": "2015-03-20T00:00:00.000Z",
      "reviews.id": "d7d9e5f1-8073-4a3c-9bd0-db68bc7db07a",
      "reviews.rating": 4,
      "reviews.text": "This is definitely an improvement over the paperwhite, not sure is worth the premium though. While faster than paperwhite it is still way less responsive than an iPad, it is very hard to type on it (when searching or sharing on goodreads for instance).I like the navigation areas on the edge of the screen but I'm not crazy about them. I'm not sure what would be a better alternative but they are not all that comfortable while reading in bed. I guess a thumb swipe would still be better if the device would respond more nicely.I previously had a Paperwhite which got lost and I thought I'd better buy the latest kindle now.When I bought the paperwhite it has been an experiment, as I'm not an avid reader and I have a hard time reading paper book since I got surrounded by gadgets. I actually read few books on the paperwhite and I enjoyed it. So when I lost it (misplaced it) I was longing for it as I had few books I wanted to read.If this would be priced at least $50 cheaper I think it would be a 5 star proposition. Like it is now, it is a tad too expensive for the scope and the shortcomings. Closer to $100 it would be a sweet price.Prefered buying at BestBuy over Amazon as the loyalty programs are better (vs nonexistent) and I also used a movers coupon."
    },
    {
      "reviews.date": "2017-05-31T00:00:00.000Z",
      "reviews.id": "2c3af783-5c69-48fc-a0f0-f2f882512c4e",
      "reviews.rating": 1,
      "reviews.text": "very good produ ct and service will defintely refer to a freind."
    },
    {
      "reviews.date": "2015-07-21T00:00:00.000Z",
      "reviews.id": "c6218984-495d-4125-8051-d0526536efeb",
      "reviews.rating": 5,
      "reviews.text": "I purchased this to replace my first gen Paperwhite. The shadows on the bottom of the Paperwhite always bothered me. I decided to upgrade to the Voyage and it is much better. I like the physical page turn buttons, the higher dpi, and the consistent back lighting. I think the only issue I have with the Voyage is the auto brightness seems a little finicky and I sometimes have to adjust the brightness manually. But that's a small issue for an otherwise great e-reader."
    },
    {
      "reviews.date": "2016-07-24T00:00:00.000Z",
      "reviews.id": "7852168e-5a6a-44f6-972b-711092fc2c59",
      "reviews.rating": 5,
      "reviews.text": "This good e-reader is a gift for my daughter and she love it."
    },
    {
      "reviews.date": "2015-09-07T00:00:00.000Z",
      "reviews.id": "c48542b7-0ec0-42fb-bd07-7349a55c12c5",
      "reviews.rating": 5,
      "reviews.text": "This was a move up from the Paper White reader. I like the option of touch screen or using the pressure switches on on the side which you can adjust to your pressure that you prefer. Sharp fonts refresh is fast and clean."
    },
    {
      "reviews.date": "2016-01-15T00:00:00.000Z",
      "reviews.id": "bdedbcb9-013f-4580-9cff-e54444afe2e6",
      "reviews.rating": 5,
      "reviews.text": "I purchased this for my wife as a Christmas present. She loves it, much better than the old Sony reader she had which had limited books and was much more expensive."
    },
    {
      "reviews.date": "2016-01-06T00:00:00.000Z",
      "reviews.id": "d97bddf8-45ac-4c41-a71a-86c160afed3d",
      "reviews.rating": 4,
      "reviews.text": "Got this product for a relative for christmas who had a kindle fire and was looking for an upgrade. With how far technology has grown on phones she was only looking for a reader and something that was lighter on her thumbs when reading then her kindle fire. This product was not only lighter on her thumbs but also worked great in any light."
    },
    {
      "reviews.date": "2016-04-15T00:00:00.000Z",
      "reviews.id": "44541252-0288-4761-bc36-22252b225700",
      "reviews.rating": 4,
      "reviews.text": "I like this Kindle, but I am not sure it is worth the premium over the Paperwhite. I previously had a Kindle Fire, which was fine, but this is definitely nicer for reading. But it all depends on what you need it for, and how often you will use it."
    },
    {
      "reviews.date": "2016-06-24T00:00:00.000Z",
      "reviews.id": "6fa67ca0-076f-488e-9bae-99107997b308",
      "reviews.rating": 5,
      "reviews.text": "This Kindle is exactly what my wife wanted and has worked out wonderfully."
    },
    {
      "reviews.date": "2014-12-13T00:00:00.000Z",
      "reviews.id": "1ca2c631-8032-4de8-894a-fde6361af90f",
      "reviews.rating": 5,
      "reviews.text": "I love my Kindle Voyage. It truly is almost like reading a paper book."
    },
    {
      "reviews.date": "2014-11-04T00:00:00.000Z",
      "reviews.id": "6eaae653-6ec4-4077-b25a-63a432ded4d4",
      "reviews.rating": 5,
      "reviews.text": "I bought this for my kids and very happy with that."
    },
    {
      "reviews.date": "2016-01-06T00:00:00.000Z",
      "reviews.id": "171f3fb6-695f-4d50-9bb1-934adf6fe44d",
      "reviews.rating": 4,
      "reviews.text": "Bought this reader for a present for my mom. She loves it. Able to take her book with her in a smaller form loves how it looks like paper pages. Easy to order a new book."
    },
    {
      "reviews.date": "2016-02-19T00:00:00.000Z",
      "reviews.id": "3a1fe4f3-d3e3-4f2c-b082-63ffce87026c",
      "reviews.rating": 5,
      "reviews.text": "Bought this for my cousins and he absolutely loves it."
    },
    {
      "reviews.date": "2016-09-02T00:00:00.000Z",
      "reviews.id": "5b167aef-daeb-4b45-9044-c50473b34f73",
      "reviews.rating": 5,
      "reviews.text": "This kindle has easier viewing and the light adjustment is great."
    },
    {
      "reviews.date": "2015-04-23T00:00:00.000Z",
      "reviews.id": "93ae2f8f-1c71-46a2-a1f2-8047e86f7564",
      "reviews.rating": 5,
      "reviews.text": "My husband is bed bound and sometimes very weak. The kindle is great for him ,light easy to use and the back light allows him to read in bed without waking me to turn the lights on."
    },
    {
      "reviews.date": "2015-03-27T00:00:00.000Z",
      "reviews.id": "21932779-e2e7-4bd7-a18c-fa54947a8b1a",
      "reviews.rating": 5,
      "reviews.text": "Although expensive....is exactly what you would expect."
    },
    {
      "reviews.date": "2016-05-15T00:00:00.000Z",
      "reviews.id": "ab4a778e-efc8-43eb-983a-2d1c09bc652d",
      "reviews.rating": 5,
      "reviews.text": "Works great, looks great, readable in bright sun..."
    },
    {
      "reviews.date": "2017-06-02T00:00:00.000Z",
      "reviews.id": "3e6e8171-cf9a-40a6-b386-01b957d68c73",
      "reviews.rating": 5,
      "reviews.text": "Great product. She uses it everyday. Super light and easy to navigate."
    },
    {
      "reviews.date": "2015-09-23T00:00:00.000Z",
      "reviews.id": "52c083af-8de2-44a7-80e1-6e3fd387946d",
      "reviews.rating": 5,
      "reviews.text": "I purchased this to replace a 2nd generation Kindle for my wife. She wanted it because of the backlight. The item exceeded her expectations. Great battery life too. I took he old kindle but plan to buy me one of these in the future."
    },
    {
      "reviews.date": "2016-10-08T00:00:00.000Z",
      "reviews.id": "ca5e138a-39cb-4570-b7d7-5baafa3089e0",
      "reviews.rating": 5,
      "reviews.text": "Bought this for my wife as a birthday gift. She has really enjoyed it. It is easy on her eyes, light weight, and keeps a god charge. It is easy to use, but she does already have experience using the original Kindle."
    },
    {
      "reviews.date": "2016-01-05T00:00:00.000Z",
      "reviews.id": "a1985e4a-805b-4dd6-80f4-6402f2b76925",
      "reviews.rating": 5,
      "reviews.text": "The KINDLE VOYAGE is a wonderful product and I use it everyday for my reading. I take it to lunch and dinner each day."
    },
    {
      "reviews.date": "2015-08-27T00:00:00.000Z",
      "reviews.id": "0b6b2aa7-d836-49b9-9bd1-b762fda762ed",
      "reviews.rating": 5,
      "reviews.text": "I know there's a separate product page for the origami cover, but it's worth mentioning here as it is the \"official\" cover. The origami cover is ugly and I was skeptical, but I actually love it. It's weird because it opens by flipping over the top like a notepad. This actually makes it more comfortable to hold when the cover is open, in my opinion. It's hard to describe, but there are a lot more ways to hold the Voyage when it's attached to this cover, and just generally is more comfortable to use. The origami part of the case works great as well... it stands vertically or horizontally (if you're laying down and reading, this is amazing)."
    },
    {
      "reviews.date": "2015-04-08T00:00:00.000Z",
      "reviews.id": "d12c0adb-69b1-4d2e-8fba-8da789cb1385",
      "reviews.rating": 4,
      "reviews.text": "Definitely easy on the eyes for long reading sessions, especially when compared to the LCD screens of smart phones and tablets. The only issues we had were that it drops the connection to our WiFi network and then won't connect to the Kindle store. I don't think it's an issue with my network since all our other devices don't have the connectivity issues we had with this."
    },
    {
      "reviews.date": "2015-03-31T00:00:00.000Z",
      "reviews.id": "b8705f72-180c-41d9-8edf-2bee7145a82e",
      "reviews.rating": 5,
      "reviews.text": "No regrets with this device. The Paperwhite from Amazon is a cheaper model that's worth looking into if this model is too much. I used to read on various iOS/Android tablets but wanted to get something that allows me to read ebooks but also have weeks of battery life on a single charge. All those books on such a small and thin device is still amazing to me. This and the official Amazon case is what I use."
    },
    {
      "reviews.date": "2015-06-28T00:00:00.000Z",
      "reviews.id": "8cf5166e-a609-4cf8-a0ff-ccf77bbd8c04",
      "reviews.rating": 4,
      "reviews.text": "It's a great eReader and the font is much clearer than that of the Paperwhite, but that may not be enough to justify the extra $$$. The page turn buttons are a great addition too.Would be good if Amazon would add audiobook capability though."
    },
    {
      "reviews.date": "2015-10-28T00:00:00.000Z",
      "reviews.id": "80121a0f-a757-4449-a89a-37fa9e51c891",
      "reviews.rating": 5,
      "reviews.text": "Upgraded from an old 2nd gen kindle and this is much better"
    },
    {
      "reviews.date": "2017-08-12T00:00:00.000Z",
      "reviews.id": "c2b49e15-69cc-49d9-9028-8aee57404365",
      "reviews.rating": 5,
      "reviews.text": "I originally purchased the Paper White and after a week of that, I decided to upgrade to the Voyage for a couple reasons. 1) Perhaps my phone has made me lazy but I've grown accustomed to auto-brightness. It's something that I don't even really think of at all... until you have to manually adjust it. The Voyage is currently the only Kindle that automatically adjusts the brightness of the screen. I've read reviews that question the efficacy of it, and those people tend to say it's hit or miss. I humbly submit that that is because it's a 'smart' auto-brightness that adjusts to your preferences at certain light levels. For instance if you're in a dimly lit room and the screen is too bright for you there, and you manually turn it down a few notches the next time you're in that room, the Kindle will remember what your screen brightness preference was at that light level and adjust. I have had NO problems with this feature and consider it the most indispensable feature on the Kindle. It's brilliant.2) Page turn haptic buttons. These are great, and allow me to not need to move my hand at all to turn a page, I simply squeeze. I do wish they had been placed slightly higher on the device as I find I've needed to adjust my grip lower than I normally would have held on to the device. It's very nice having the option to not need to swipe the page to turn it.3) The flush screen. This makes a big difference to me - I was not a fan of the recessed screen on the Paper White and even the Nook has a flush screen! Amazon really needs to introduce waterproof Kindles and a flush screen is going to be necessary for that. This is also my only negative about the device - the screen appears to be slightly more reflective than the Paper White and I've heard (wether it's true or not) that is because the Voyage has a glass screen, while the Paper White has plastic? I'm not sure, but the ONLY time I notice this is when I'm reading the the sun is directly behind me. I may need to tilt the screen 5 degrees in any direction and it's easily readable again.4) The general design is sleeker and feels better in my hand than the Paper White. This also allows the device to be slightly lighter than the Paper White, which is always a good thing.To recap - This is the ONLY Kindle to feature the auto-brightness feature (not even the Oasis has it--probably to save on weight) and in my opinion a worthy upgrade over the Paper White."
    },
    {
      "reviews.date": "2015-08-21T00:00:00.000Z",
      "reviews.id": "2fa95811-d4d0-4b70-8ec3-135954c2e9db",
      "reviews.rating": 5,
      "reviews.text": "This eReader is great, I have started reading more now that I have this kindle than when I read paperbacks. If you are torn on buying this for yourself or someone else I can almost guarantee anyone would love this. With enabled dictionaries and X-ray I'm finally able to tackle books with a heavy character list like Game of Thrones. I'm serious, this is so convienent and user friendly. The only negative about this device is the amount of money you will spend on new books in excitement when you first connect to Amazon with it."
    },
    {
      "reviews.date": "2015-04-15T00:00:00.000Z",
      "reviews.id": "28917c33-9e7e-44d1-9cf2-eda668f9c4ed",
      "reviews.rating": 5,
      "reviews.text": "I am an avid reader. I use to have to pack multiple books on any vacation or trip for business. This has replaced all that. This is my second kindle and I am very impressed. The back light helps for reading at night or in bright places."
    },
    {
      "reviews.date": "2015-02-12T00:00:00.000Z",
      "reviews.id": "522869d7-9580-480a-8766-b7be967607a0",
      "reviews.rating": 5,
      "reviews.text": "I love the Voyage. The display is clean and crisp and I have found the auto adjusting lighting to work perfectly for me. I love the side page turning buttons. I no longer have to use two hands to read a book anymore."
    }
  ]
}