{
  "id": "AVqkIj9snnc1JgDc3khU",
  "dateAdded": "2017-03-06T14:59:52Z",
  "name": "Fire HD 8 Tablet with Alexa, 8 HD Display, 32 GB, Tangerine - with Special Offers",
  "asins": "B01AHB9C1E",
  "brand": "Amazon",
  "categories": "Fire Tablets,Tablets,All Tablets,Amazon Tablets,Computers & Tablets",
  "primaryCategories": "Electronics",
  "keys": "amazon/b01ahb9c1e,amazon/53004765,0841667104577,firehd8tabletwithalexa8hddisplay32gbtangerinewithspecialoffers/b01ahb9c1e,firehd8tabletwithalexa8hddisplay32gbtangerinewithspecialoffers/5620411,841667104577",
  "manufacturer": "Amazon",
  "reviews": [
    {
      "reviews.date": "2017-03-16T00:00:00.000Z",
      "reviews.id": "82baa34a-845a-47f8-8082-73eda727db6c",
      "reviews.rating": 5,
      "reviews.text": "The clarity of the screen and the back-lit text makes this an improvement from my old tablet. I now can read this in low light and enjoy the color as well. I am enjoying my new Kindle, but it did present some challenges in its set up. I would recommend getting help in the store to get you started."
    },
    {
      "reviews.date": "2017-01-30T00:00:00.000Z",
      "reviews.id": "b636f5d4-36fb-44e6-b0b8-ae655ed8d346",
      "reviews.rating": 5,
      "reviews.text": "Purchase was to replace Fire HD 8.9 that was left on a plane (found & return 50 days later). Like this smaller version due to size & it's 3 years newer on the technology side."
    },
    {
      "reviews.date": "2017-05-18T00:00:00.000Z",
      "reviews.id": "26a6a9db-81a1-4b4a-8c40-0035332819b8",
      "reviews.rating": 3,
      "reviews.text": "meh. it works. i find it difficult to navigate. i also have an ipad mini. this seems to be less intuitive than the ipad."
    },
    {
      "reviews.date": "2017-01-18T00:00:00.000Z",
      "reviews.id": "13cf12d5-00ce-4aa4-83c5-69ed82135d00",
      "reviews.rating": 5,
      "reviews.text": "Solid Amazon tablet for those invested in the Amazon ecosystem."
    },
    {
      "reviews.date": "2017-03-28T00:00:00.000Z",
      "reviews.id": "6a2d20c0-1f9c-4b7e-aae8-5fe49a2bf9e4",
      "reviews.rating": 5,
      "reviews.text": "She loves it, the only problem I have is getting it away from her, even while riding in vehicles. LOL"
    },
    {
      "reviews.date": "2017-03-28T00:00:00.000Z",
      "reviews.id": "862ee4af-5d6a-461d-b18e-c96d8b5cdf5f",
      "reviews.rating": 5,
      "reviews.text": "This is the right device to play with puzzles, you can avoid samsung/verizon constant advertisements. Only wish the battery would last longer or charge faster."
    },
    {
      "reviews.date": "2016-12-27T00:00:00.000Z",
      "reviews.id": "69f04d46-858c-4275-a91d-25d8cd0727e9",
      "reviews.rating": 5,
      "reviews.text": "Just love my Kindle. Easy to use and carry around and more books to purchase!!!!!"
    },
    {
      "reviews.date": "2017-05-26T00:00:00.000Z",
      "reviews.id": "e24569d2-0c67-4aea-9f4e-1c88575e2388",
      "reviews.rating": 5,
      "reviews.text": "Easy-to-use. Lots of books obviously but also lots of apps."
    },
    {
      "reviews.date": "2017-03-10T00:00:00.000Z",
      "reviews.id": "b4a3aa69-fa37-410f-818e-eacd835f1cea",
      "reviews.rating": 5,
      "reviews.text": "Love my new Kindle fire. This replaces my old one and is just as good. Videos are as good as my tv with cable. Well with every penny spent and better deal than when I tried Amazon."
    },
    {
      "reviews.date": "2017-01-06T00:00:00.000Z",
      "reviews.id": "19cc479c-c6f6-4b74-9081-05a1a9fcecda",
      "reviews.rating": 5,
      "reviews.text": "Grandson is enjoying the new games on it. It's much bigger than his ipod."
    },
    {
      "reviews.date": "2016-11-18T00:00:00.000Z",
      "reviews.id": "55b611a4-f379-4851-84cf-806f4d7c0a71",
      "reviews.rating": 5,
      "reviews.text": "My husband loves this. He is happy that he can read anything he chooses from his library and that he also has WiFi access to get to his email and the internet whenever he wants."
    },
    {
      "reviews.date": "2017-03-16T00:00:00.000Z",
      "reviews.id": "df05f1f3-dff8-4092-9a03-475455ccb6f3",
      "reviews.rating": 5,
      "reviews.text": "Never without my Amazon HD 8 - great for reading, games and surfing the networks."
    },
    {
      "reviews.date": "2017-02-05T00:00:00.000Z",
      "reviews.id": "8d93ac62-1b84-4641-ab30-4be44f2cc767",
      "reviews.rating": 5,
      "reviews.text": "Fixed alot of issues that were complained about with the 7\"."
    },
    {
      "reviews.date": "2017-04-07T00:00:00.000Z",
      "reviews.id": "10ff6a64-1c71-46ae-8232-07bf54bff44f",
      "reviews.rating": 4,
      "reviews.text": "I'm a Windows person & this is not Windows. I'm still learning. I am happy with the size as it fits easily in to my purse, but I HATE touch items - I always seem to touch the wrong area (like spelling something, I go for a letter & get one of the letters next to - so it slows down my typing - one of the reasons I don't have a smartphone). All in all it's pretty good. I guess I would recommend it because it's the way this world is turning. However, they don't make a glass protective screen cover - only plastic."
    },
    {
      "reviews.date": "2017-01-06T00:00:00.000Z",
      "reviews.id": "6269901d-dee8-4317-893e-119197033664",
      "reviews.rating": 4,
      "reviews.text": "Bought this for my wife. She is a constant reader and put away her previous Kindles for this one. She now has internet access also, so she can find more books anytime she wants."
    },
    {
      "reviews.date": "2016-11-16T00:00:00.000Z",
      "reviews.id": "85ba45f6-11ba-4d31-a1ec-15c3b41577f2",
      "reviews.rating": 5,
      "reviews.text": "Love this Kindle. There are to many apps and games offered for download. Love the book selection Easy to navigate The charger seems a bit loose, though"
    },
    {
      "reviews.date": "2016-12-09T00:00:00.000Z",
      "reviews.id": "157e8076-b7b4-423a-bd68-ce25e02bc34c",
      "reviews.rating": 4,
      "reviews.text": "Does a lot more than old tablet.It Hasmore memory."
    },
    {
      "reviews.date": "2017-04-09T00:00:00.000Z",
      "reviews.id": "51f54a48-a11e-4d11-9e7b-410925403717",
      "reviews.rating": 4,
      "reviews.text": "This tablet is small, compact and easy to handle. It's easy to figure out the main functions. My one complaint is that it does not support some big apps such as Dropbox or Google Drive."
    },
    {
      "reviews.date": "2017-01-07T00:00:00.000Z",
      "reviews.id": "d6ed8ce4-4316-4c61-b07b-52928b9dd864",
      "reviews.rating": 5,
      "reviews.text": "My daughter absolutely loves her new fire, lots of space, easy to set up and lots of apps"
    },
    {
      "reviews.date": "2017-02-13T00:00:00.000Z",
      "reviews.id": "5c69fc8e-a389-4cae-84ae-4282956af4cd",
      "reviews.rating": 5,
      "reviews.text": "I would recommend the Fire Tablet to anyone. IT is very easy to set up, download apps and use. Movies are crisp and clear."
    },
    {
      "reviews.date": "2016-12-23T00:00:00.000Z",
      "reviews.id": "a4605dbf-9b9f-4ce2-9f38-3d82b23c21d2",
      "reviews.rating": 5,
      "reviews.text": "This works great. I read a LOT and I needed something that would handle all my eBooks. It has all the other bells and whistles as any tablet but I use it for the eBooks and one game. Excellent!"
    },
    {
      "reviews.date": "2016-12-06T00:00:00.000Z",
      "reviews.id": "8cbb13ef-1565-4f67-a537-7f7c5e4ebf88",
      "reviews.rating": 5,
      "reviews.text": "I have put off buying a tablet because all the ipads I tried with friends were hypersensitive making it difficult for me to navigate easily. This one is the bomb - I am 68 and not a techie but quite intelligent - this Kindle Fire is a perfect fit for me and does everything I want it to do and more with great speed and wonderful resolution. I am new at tablets and look forward to enjoying learning all that this Kindle Fire will provide for me - so far each step has been a breeze. I just love it."
    },
    {
      "reviews.date": "2017-05-17T00:00:00.000Z",
      "reviews.id": "4530b1b3-3f52-4102-b8fc-8a86fbb484af",
      "reviews.rating": 5,
      "reviews.text": "Love my new Kindle! Only had to login, and all my books were there from older Kindle...Excellant Purchase!!"
    },
    {
      "reviews.date": "2016-12-31T00:00:00.000Z",
      "reviews.id": "028d25c7-223b-40dc-8c12-8408ec6ab287",
      "reviews.rating": 5,
      "reviews.text": "Does everything we wanted. Great value for the price."
    },
    {
      "reviews.date": "2017-01-18T00:00:00.000Z",
      "reviews.id": "1eb5632c-17ea-4970-9f96-12a76261e60e",
      "reviews.rating": 5,
      "reviews.text": "Perfect for my 9-yr old....small enough to tuck into a bag easily & very easy to use...perfect price point for no worries & has been great!!"
    },
    {
      "reviews.date": "2016-11-18T00:00:00.000Z",
      "reviews.id": "1bb08b8b-81c8-4a62-a822-2e12b175ec21",
      "reviews.rating": 5,
      "reviews.text": "Awesome and best e-book reader. I love the smooth page translations, bedtime shade and perfect hand held device. Kindle Fire has took their e reader to the next level. Great apps, music, and storage expansion for the price."
    },
    {
      "reviews.date": "2017-01-15T00:00:00.000Z",
      "reviews.id": "7e9a5555-db40-4653-8177-9d4d7581135e",
      "reviews.rating": 5,
      "reviews.text": "This is my 2nd tablet. Kindle Fire hd 8 reviewed throughly elsewhere many times for its solid performance for money. I mainly wanna talk about excellent buying experience at local best buy. It was not in Stock but employee we extra miles to locate the stock somewhe re but I like my local store much so ended up ordering there. Keep up the good work !. Very pleasant buying experience."
    },
    {
      "reviews.date": "2017-01-31T00:00:00.000Z",
      "reviews.id": "8cd1ec09-392a-45fb-8c73-fa8e5f94d684",
      "reviews.rating": 4,
      "reviews.text": "This tablet is designed primarily to sell, distribute and store media purchased from the Amazon.com product line, ie Kindle e-books, movies viewed or stored from their online movie streaming service, etc., and it does that very well.Reasonably sharp screen, good sound, good battery life and decent component materials. It uses their version of the Android OS which they call the Fire OS which is decently responsive and fairly intuitive to use - Be aware that you cannot install or run most apps purchased from the Google Play store, but must rely on Amazon's own app store which is decent, but not as extensive as either Apple's or Google's."
    },
    {
      "reviews.date": "2017-01-06T00:00:00.000Z",
      "reviews.id": "ecc1eba9-2a9b-42de-a238-ff98fafe6fd1",
      "reviews.rating": 5,
      "reviews.text": "I bought this as an affordable alternative to the iPad mini. I liked the expandable storage option and size. Super easy to use. Unfortunately granddaughter wanted and iPad mini to go with her other apple products. So I ended up returning it. In hindsight I should've kept it for myself."
    },
    {
      "reviews.date": "2016-11-06T00:00:00.000Z",
      "reviews.id": "347459d0-dd4c-437f-a97e-1dd743a8429f",
      "reviews.rating": 5,
      "reviews.text": "This tablet is excellent considering the price. It has a very clear display, is a fairly large tablet, and has plenty of memory to store a lot of apps, music, pictures and more. Considering the price, this tablet has the best value out of all tablets to date in my opinion."
    },
    {
      "reviews.date": "2017-05-15T00:00:00.000Z",
      "reviews.id": "663bcc76-1f49-40e9-8486-ac6d6bbb19f8",
      "reviews.rating": 5,
      "reviews.text": "can not do without my kindle fire.I had an earlier model 4 years ago.it is still going , just wanted a backup."
    },
    {
      "reviews.date": "2017-03-10T00:00:00.000Z",
      "reviews.id": "bde083ce-fe01-48de-b7ea-3bad11dadaf3",
      "reviews.rating": 5,
      "reviews.text": "I would recommend anyone buy this product., just awesome."
    },
    {
      "reviews.date": "2016-12-25T00:00:00.000Z",
      "reviews.id": "52817d6b-ef63-45c6-9e6d-fc0f8224a729",
      "reviews.rating": 5,
      "reviews.text": "Got for my aunt for her first tablet. It has been user friendly for her, she yours it mostly for reading"
    },
    {
      "reviews.date": "2017-02-08T00:00:00.000Z",
      "reviews.id": "142b4c78-d5a2-41c7-bc0a-775317b234e5",
      "reviews.rating": 5,
      "reviews.text": "This is my second Fire. Wanted a larger size to make eBooks easier to read. Very pleased with the size and clarity of this tablet. Easy to take along in a tote. Perfect for what I wanted it for."
    },
    {
      "reviews.date": "2016-12-17T00:00:00.000Z",
      "reviews.id": "15fa3360-026b-4fe9-bd59-470e7bacaf12",
      "reviews.rating": 5,
      "reviews.text": "So easy to use and navigate. Easy easy Amazon downloads from books to apps etc. I'm in the older generation that finds it hard to navigate electronics but not this tablet and Best Buy employees were great in helping me decide by giving a tutorial and info on the tablet ."
    },
    {
      "reviews.date": "2017-01-18T00:00:00.000Z",
      "reviews.id": "ef5073bc-c536-41bc-910b-87b50f5c5f63",
      "reviews.rating": 4,
      "reviews.text": "I've love kindles for years and was looking for a bit larger reading area. That is what I got and more. I very satisfied EXCEPT it just goes blank repeatedly and for no apparent reason stay on and I am back to satisfaction."
    },
    {
      "reviews.date": "2017-02-03T00:00:00.000Z",
      "reviews.id": "a3cc68a6-ab3e-4632-b45e-09a201c466fa",
      "reviews.rating": 4,
      "reviews.text": "Video quality is very good. Works well with Amazon Prime Video and Music - no surprises there. Apps are VERY disappointing - many common apps are not available - even though there are Android versions! Not bad if you have modest expectations."
    },
    {
      "reviews.date": "2017-05-07T00:00:00.000Z",
      "reviews.id": "526306ba-d66a-42ed-9172-bbc483658011",
      "reviews.rating": 4,
      "reviews.text": "Pretty decent tablet. Good for mindless games and Netflix. You get what you pay for."
    },
    {
      "reviews.date": "2017-01-16T00:00:00.000Z",
      "reviews.id": "7fdbc809-b296-4ba3-81cf-b86a7dc2b095",
      "reviews.rating": 5,
      "reviews.text": "The size is just right for me to carry anywhere and it's simple to figure out the functions. 32 G would help me store many ireader books for a long time. I have read 3 books so far."
    },
    {
      "reviews.date": "2016-12-12T00:00:00.000Z",
      "reviews.id": "d831b445-0fcb-49b1-a522-bc08521eb471",
      "reviews.rating": 3,
      "reviews.text": "Decent little tablet if you are not a game player. Tablet shuts down and I cant get it back on when I play games for long periods of time. It's not my ipad, that's for sure."
    },
    {
      "reviews.date": "2017-01-30T00:00:00.000Z",
      "reviews.id": "b3e5900d-cd19-4c3e-81b4-3c6fa93f5f89",
      "reviews.rating": 4,
      "reviews.text": "This is my 2nd tablet and it works great with downloading"
    },
    {
      "reviews.date": "2017-01-18T00:00:00.000Z",
      "reviews.id": "196e45df-37d0-40bf-ae20-3dc4c0796cb5",
      "reviews.rating": 4,
      "reviews.text": "Bought 2 of these for my 6 and 8 yr old and it said it came with 32gb storage but actual storage was a little less, cant remember exactly how much probably around 20gb with the other necessary programs that come already pre-installed. They mainly use it for games and have downloaded many games on them. There is room for external storage and it also has a front and rear camera. love the product. comes in different color as well. I got the blue!"
    },
    {
      "reviews.date": "2017-05-05T00:00:00.000Z",
      "reviews.id": "dc29a180-cf28-4fca-8a07-2669531685d3",
      "reviews.rating": 5,
      "reviews.text": "good quality, low cost compare to iPad, i like this."
    },
    {
      "reviews.date": "2017-02-18T00:00:00.000Z",
      "reviews.id": "8b46627d-16ea-4b57-827e-4809168bc815",
      "reviews.rating": 4,
      "reviews.text": "I don't know much about tablets but the sales associate recommended this one for me. It does what I need and more but I just don't know how to use it yet."
    },
    {
      "reviews.date": "2017-05-02T00:00:00.000Z",
      "reviews.id": "d088a131-7280-41f5-8ec9-6c205e273533",
      "reviews.rating": 4,
      "reviews.text": "I was going to have to be face down after eye surgery recently and decided to get a tablet to be able to look at the internet and movies on something other than my phone. While there are ones which have more features (and better software), the Fire HD8 had a good price and was available. It had gotten good reviews, and it performs well, with great battery life. If you're looking for a good, basic tablet, this is a nice option."
    },
    {
      "reviews.date": "2016-12-14T00:00:00.000Z",
      "reviews.id": "08ba8d7c-d131-4c79-93bc-a89d71b9c1f9",
      "reviews.rating": 5,
      "reviews.text": "Fantastic tablet fire one is great. Small and portable"
    },
    {
      "reviews.date": "2017-01-20T00:00:00.000Z",
      "reviews.id": "45ea35ce-9ebe-47c6-b877-2d5d73ed7bc7",
      "reviews.rating": 5,
      "reviews.text": "Holds a long charge. Fast great space, no freezing or resetting."
    },
    {
      "reviews.date": "2016-12-29T00:00:00.000Z",
      "reviews.id": "833363aa-aeb1-4c1f-86f3-2ab22bf81547",
      "reviews.rating": 5,
      "reviews.text": "It was easy to set up and use. Best Buy employees were a huge help teaching me about the many features."
    },
    {
      "reviews.date": "2017-01-24T00:00:00.000Z",
      "reviews.id": "8da9e10c-60d7-4249-807d-46e81fd83399",
      "reviews.rating": 5,
      "reviews.text": "If you love Amazon, you'll love the Kindle HD8. It's a great size for reading all those books, streaming movies and tv shows, and has great sound for listening to your favorite music. For less than $100, you can't beat the versatility of this little device!"
    },
    {
      "reviews.date": "2017-05-17T00:00:00.000Z",
      "reviews.id": "9a8162f2-b8c9-4ab9-a058-d195e712dca3",
      "reviews.rating": 4,
      "reviews.text": "Great tab for my kids. This is the third fire tablet that we have purchased for our kids."
    },
    {
      "reviews.date": "2017-01-19T00:00:00.000Z",
      "reviews.id": "1e0b58be-f982-4cb3-a33b-e6009a7b9bea",
      "reviews.rating": 4,
      "reviews.text": "Wanted a tablet but did not want to pay for an iPad. The fire is a great tablet with a crystal clear hd videos. The perfect inexpensive alternative to the iPad"
    },
    {
      "reviews.date": "2016-11-17T00:00:00.000Z",
      "reviews.id": "36a80e49-e1e5-42b9-9bfd-d2157170347e",
      "reviews.rating": 5,
      "reviews.text": "All I wanted was a Kindle to read books. I got this instead!! Excellent choice because I can read books and do so much more!!"
    },
    {
      "reviews.date": "2017-03-16T00:00:00.000Z",
      "reviews.id": "bf7dbc73-de81-4ed9-842e-3834a56bbff8",
      "reviews.rating": 5,
      "reviews.text": "I have had this for several weeks. It works great. I am very satisfied with it so far."
    },
    {
      "reviews.date": "2016-12-02T00:00:00.000Z",
      "reviews.id": "75f09e2f-3e0b-4594-9e38-1b80c7f14537",
      "reviews.rating": 5,
      "reviews.text": "Many improvements than the older model with an excellent screen and great battery life."
    },
    {
      "reviews.date": "2017-01-06T00:00:00.000Z",
      "reviews.id": "859d1082-14bd-4c89-8b6f-64936dfc3d0c",
      "reviews.rating": 5,
      "reviews.text": "Purchased for my son who loves to read books. Saw him watching old TV show. He sat down with me and showed me what all it could do. Who would figure. I thought it was just for reading books. Now I want one too!"
    },
    {
      "reviews.date": "2017-01-08T00:00:00.000Z",
      "reviews.id": "7f0115ed-0da1-4dd2-ae42-75153a33f9fe",
      "reviews.rating": 4,
      "reviews.text": "A great Christmas gift, the kids love the gifts..."
    },
    {
      "reviews.date": "2016-12-30T00:00:00.000Z",
      "reviews.id": "a5262df9-4ce1-43b4-8fa4-39018d6004b9",
      "reviews.rating": 5,
      "reviews.text": "this tablet is great for reading the text is not a good as it is on my tab s2 9.7 in but this is about $200 cheaper i got it because i wanted a more natural book feel reading my books and the tab s2 was not doing it for me"
    },
    {
      "reviews.date": "2017-04-14T00:00:00.000Z",
      "reviews.id": "023cd75f-9941-4f6a-8e3a-b40828097fb9",
      "reviews.rating": 5,
      "reviews.text": "Fast on internet, easy connection. Easy to use. Clear display. Was looking at iPad mini. After reading reviews of both Kindle fire and iPad I bought the Kindle for so much less $$$ And I don't have to put up the Apple's native apps etc."
    },
    {
      "reviews.date": "2016-12-24T00:00:00.000Z",
      "reviews.id": "7c597a33-844e-494d-a46c-6bf140d04e34",
      "reviews.rating": 5,
      "reviews.text": "Easy to set up, great picture love it! Keeps my kids entertained and they love it also ....it was a gift."
    },
    {
      "reviews.date": "2017-01-01T00:00:00.000Z",
      "reviews.id": "0069b3b4-52d9-4765-94da-72ac660f4085",
      "reviews.rating": 5,
      "reviews.text": "When you can get this thing on sale it's an amazing deal. Have all of your Amazon features right in your face. Books, Manga, Gaming, Amazon. It's easy to hold, has amazing battery life and has a pretty decent screen. Sure the Galaxy tablets have better specs, but it's the price and features you get from Amazon that make this device amazing!"
    },
    {
      "reviews.date": "2017-01-26T00:00:00.000Z",
      "reviews.id": "b1dd1cd5-68b6-4e28-838a-a627e36d076b",
      "reviews.rating": 5,
      "reviews.text": "Got this for my 8 year old granddaughter and she loves it. Uses it for game play, homework, etc. Mom and Dad loves the parental controls. Not having to worry so much."
    },
    {
      "reviews.date": "2016-11-11T00:00:00.000Z",
      "reviews.id": "0f3731ca-26b0-4281-b34d-73ac2736dbd8",
      "reviews.rating": 5,
      "reviews.text": "I like the ease of use and good support from Amazon. A reasonable price for a versatile tablet."
    },
    {
      "reviews.date": "2016-12-23T00:00:00.000Z",
      "reviews.id": "d97aeca6-9de5-46a5-bab9-d001340c5520",
      "reviews.rating": 5,
      "reviews.text": "This product was purchased for my Grandson. He had a fire 6. He however loves the HD 8. He uses it for music & gaming mostly. Great electronic device."
    },
    {
      "reviews.date": "2016-12-17T00:00:00.000Z",
      "reviews.id": "c26dbc37-9d00-4c3d-8627-fcfa391d2b30",
      "reviews.rating": 5,
      "reviews.text": "Bought this for my adult son who had a long flight and he absolutely loved it! Definitely recommend!"
    },
    {
      "reviews.date": "2017-01-17T00:00:00.000Z",
      "reviews.id": "7036c408-69f9-45c9-b97f-29ee20be3178",
      "reviews.rating": 5,
      "reviews.text": "This was a Christmas present. The person that received it was very happy with it.. She has other Kindles but this new one is an obvious improvement over the previous ones."
    },
    {
      "reviews.date": "2016-12-15T00:00:00.000Z",
      "reviews.id": "3c8a91b3-7e81-4499-9323-161a5e483b91",
      "reviews.rating": 5,
      "reviews.text": "I bought this to replace a damaged much more expensive tablet of my daughters. Great item and just as nice as the more expensive one. She absolutely loves it."
    },
    {
      "reviews.date": "2017-01-09T00:00:00.000Z",
      "reviews.id": "e0de0987-6390-49f9-9c14-acbddacaf86b",
      "reviews.rating": 5,
      "reviews.text": "Ok so in order to get three working well I needed to get four but the one that needed to be returned was quite easy. All is great! Kids love them!"
    },
    {
      "reviews.date": "2017-01-06T00:00:00.000Z",
      "reviews.id": "cfdbdbd5-f37f-4a4f-951a-473303b84d70",
      "reviews.rating": 5,
      "reviews.text": "I purchased two for my grandchildren. They loved it. Reading, games and videos"
    },
    {
      "reviews.date": "2017-03-07T00:00:00.000Z",
      "reviews.id": "ed06c9c5-9fe3-4b13-8953-e89566d19e4c",
      "reviews.rating": 5,
      "reviews.text": "Nice little tablet with great features. Bought one for my mom so she can read without all the weight of a big book. She also loves the nice backlight so she can be on her tablet at night without the lights on."
    },
    {
      "reviews.date": "2017-01-16T00:00:00.000Z",
      "reviews.id": "4a95c011-b313-411c-8396-40338363d343",
      "reviews.rating": 4,
      "reviews.text": "Love the choice of colors. Have two kindles of my own and purchased this for a gift."
    },
    {
      "reviews.date": "2016-10-05T00:00:00.000Z",
      "reviews.id": "df5c1161-463c-422d-bfdd-d7fd8088f037",
      "reviews.rating": 4,
      "reviews.text": "I've had lots of tablets in the past, mostly from the Samsung line, but this is my first Amazon Fire, so I want to write this review for others who have never tried one of these. At the time that this was written, Alexa had not been added to the tablet.First, while this device runs an Android type of operating system, Amazon puts its own spin on the operating system. I don't feel like I'm using Android. This feels different to me. It doesn't have the same level of customization that Android users have come to appreciate. That being said, if you are an Amazon Prime member, this device has been tailored to be your content entertainment machine. It's simply a fun way to consume your magazines, books, etc.There are 3 on-screen buttons on the bottom of the device. The middle button immediately takes you to your home screen. The button to the left acts as a sort of \"back\" button. It also lets me get rid of my keyboard when I don't need it on screen, but it's open. The button to the right is super important. It took me a couple of days to realize what it does. That square shaped button is what you press you see what apps you have open. It lets you switch between apps, but it also lets you see which apps you have open and close them out. You can close them by pressing the \"X\" button in the corner of the window that appears or by touching the app window and swiping to the right. If you leave all of those apps open and you never close them, you'll drain your battery. Make sure you use that little square button to clear your apps.The device has several menus that you swipe left to view. First, you start with your home screen. You literally can stay on this screen and do anything you need to do on the tablet. All of your apps are housed here. You swipe up to view all of them. The tablet comes with several apps pre-installed such as Slik, Amazon's own internet browser, Audible, Good Reads, the Amazon app store, a weather app, etc. You can go to the Amazon app store to download other apps such as Twitter, Facebook, etc. You can combine the apps on this page into folders. You just drag one app to another app and a folder appears. This made my home screen much more manageable. You can change the size of the font on the home screen from normal to large or small in the device settings. This feature doesn't necessarily increase the size of the font within your apps, however. I believe it only changes the font on your main screens.If you have a magazine or newspaper subscription that is connected to your device, when you have a new issues, it will show up at the top of your home page screen under the heading of \"new items.\" The device comes with a free 6 month subscription to the Washington Post. You'll see that under \"new items\" when you initially activate your tablet.You can change the wallpaper on the screen to use one of your own photos. You can do this through the settings menu on the device. If you want to use one of your own photos, however, you need to either take it on the device or move it into Amazon's Photos app, which is a cloud-based app.So far, I haven't found a way to effectively use a different photo management app that will let me change my wallpaper. I'm not crazy about the Amazon Photo app. I found it annoying to move my photos from my phone into Amazon's cloud just so I could view them on my tablet. That being said, I'm not planning to take photos on this device. I just wanted a few pet photos on there and the ability to change my wallpaper.Beyond the home screen, you can swipe to the right to view your other screen. They are pre-arranged to be: books, videos, games, shop, apps, music, audiobooks, and newstand. All of those screens are connected to your Amazon account. For example, if you have Kindle books you've already purchased, they automatically will appear under the Books menu. Your magazines and newspaper subscriptions will appear under the newstand menu. There doesn't seem to be a way to change the order of the menu pages. That bugs me, but it's not the end of the world. There's also one menu to the left of the \"home\" menu. It's the \"recent\" page. It shows you what you've received looked at on the tablet. I never use it, but it might be handy for some people.One of my favorite features of this tablet is Amazon's \"On Deck\" capability. If you're an Amazon Prime member, Amazon will periodically download a video to your device that it thinks you might like. The items don't count against your pre-installed memory and they automatically deleted off if your memory starts getting full. You can turn off the \"on deck\" feature if you don't like it. I've been content with the video playback capability. This isn't my major use of the device, but the images look fine and the audio is OK. I'll talk more about the speakers later. My other favorite feature of this tablet is viewing magazine content through the Newstand. I've tried 3 magazines on here and they all look gorgeous. Now, I can always have my magazines with me so if I'm stuck at the airport or at the doctor's office, I always have them. One of my regular magazines includes a free digital version of the magazine for free. I just had to connect my account to the device. This allows me to download the back issues of the magazine for as long as I've had an account. My other magazine didn't include a digital edition so I canceled the print edition of it and switched to the digital version. (It was an inexpensive magazine, anyway.) There are several magazines that you can try free for 30 days on the device. I did this with a third magazine and decided to keep it for a year. Viewing magazines on this gadget is a pleasure.The Kindle Fire doesn't come with the Google Play store installed. You can side load it to the device without rooting it (and breaking your warranty.) You can Google to find the instructions to do this. It's not difficult to do if you're fairly comfortable with technology. It probably took me 10 minutes. Most of the apps I wanted were in the Amazon store, but there were a handful that I had paid for through Google Play. The only way I could have them was to go back to access that store. They have worked fine so far. I despise the keyboard that Amazon pre-installed on this device. There are no lines between the letters on the keyboard. I suppose it designed to be better for swyping through keys, but I hate it. I fixed that problem by going to Google Play and downloading a new keyboard. It was a pretty easy problem to solve so I can't complain.Apps that are connecting to the Internet can be a little slow to load on this device compared to my other gadgets, but that generally doesn't bother me. If you were using this tablet to replace your personal laptop, however, that might drive you crazy. The screen on this device isn't bad. If I compare it to my fancy phone, it's not as shape, but when you think about the price of this device compared to my smartphone, the screen is outstanding.The speakers are OK. There are two of them located on the bottom of the screen. I won't say that they are fantastic. They aren't. In my opinion, they are fine for watching YouTube or a television show. They are not OK for listening to music if you are an audiophile. You can make it a little better by downloading a different music app instead of relying on the pre-install app, but still your music will sound tinny. That being said, you can always connect your tablet to a bluetooth speaker, use a pair of headphones, etc.This device wasn't made for taking pictures. It has a front and back camera, but they aren't designed to be spectacular. I'm not using them.I find this device a little difficult to hold in my hands. I think that's partly because of the size and partly because it feels very slick. Also, I do have some hand problems (similar to someone who has Carpal Tunnel syndrome). I think it will be easier to handle once my case arrives. I'm still waiting for it. I'm greatly enjoying this device. It's simply fun to use the tablet. There are weaknesses that come with that lower price tag, but you legitimately get a lot of bang for your buck, particularly if you regularly use Amazon services. If you don't typically use Amazon and you are just looking for a tablet for viewing the Internet and you're looking for a low price tag, this device may be OK for you."
    },
    {
      "reviews.date": "2017-01-18T00:00:00.000Z",
      "reviews.id": "49d02fd4-ef04-46af-8a1d-10ca4255ebd0",
      "reviews.rating": 5,
      "reviews.text": "I am really enjoying my new kindle fire hd 8. The picture is awesome even for a movie. I use it mostly to read with an occasional game or movie too. Colors are great and the size of the screen is very nice. I have a 7 inch fire and there is enough size difference for movies etc to make it worthwhile. Plus there was a great black Friday price."
    },
    {
      "reviews.date": "2016-12-23T00:00:00.000Z",
      "reviews.id": "723e8e45-3b1b-4b55-9fd5-3451ab035ac9",
      "reviews.rating": 5,
      "reviews.text": "I think this is a great product and I would recommend it."
    },
    {
      "reviews.date": "2017-01-06T00:00:00.000Z",
      "reviews.id": "bf45f579-cdd1-4659-9c6c-d48b50ea0a85",
      "reviews.rating": 5,
      "reviews.text": "this is my second one and must have one of these at all times"
    },
    {
      "reviews.date": "2016-12-03T00:00:00.000Z",
      "reviews.id": "1effef49-f07f-468d-a27c-8febfb59fe9f",
      "reviews.rating": 5,
      "reviews.text": "Larger size more.memory, better price great product and wonderful service"
    },
    {
      "reviews.date": "2017-04-04T00:00:00.000Z",
      "reviews.id": "b0b6ca5d-cfa8-4723-855e-4cac3d49bfbb",
      "reviews.rating": 5,
      "reviews.text": "Ordered for my daughter to replace an older version and she loves it. Larger screen and colored case are a big plus."
    },
    {
      "reviews.date": "2016-12-25T00:00:00.000Z",
      "reviews.id": "38273764-62ee-4382-85c7-664928657cb5",
      "reviews.rating": 5,
      "reviews.text": "my daughter just loved this kindle fire. she said it was the perfect gift that she could receive."
    },
    {
      "reviews.date": "2016-12-24T00:00:00.000Z",
      "reviews.id": "8ffccd22-db46-41c9-a19a-0788848c6096",
      "reviews.rating": 4,
      "reviews.text": "I love my kindle fire. Its a great reading device."
    },
    {
      "reviews.date": "2016-12-24T00:00:00.000Z",
      "reviews.id": "94ed7724-8715-4595-bfd5-524876c0ecda",
      "reviews.rating": 5,
      "reviews.text": "Easy to use with great picture. I would recommend it to a friend."
    },
    {
      "reviews.date": "2017-01-24T00:00:00.000Z",
      "reviews.id": "92fb5e71-ea17-4055-9632-805a28b7693d",
      "reviews.rating": 5,
      "reviews.text": "Got this for my Daughter-in-Law and she loves it. Does exactly what she needs it to do."
    },
    {
      "reviews.date": "2017-01-16T00:00:00.000Z",
      "reviews.id": "687d53a3-9b21-411c-aea5-f2c767257b98",
      "reviews.rating": 4,
      "reviews.text": "Got this tablet for my spouse who has never had one before and it's perfect for him!"
    },
    {
      "reviews.date": "2016-12-28T00:00:00.000Z",
      "reviews.id": "5f3ad65e-a966-4844-96e4-9f67c9835ee7",
      "reviews.rating": 5,
      "reviews.text": "Great tablet for those invested in the Amazon system. Nice screen and functions well."
    },
    {
      "reviews.date": "2017-05-17T00:00:00.000Z",
      "reviews.id": "91d817d9-8d15-406a-91b5-b877ac71ec51",
      "reviews.rating": 5,
      "reviews.text": "I had one of the first Kindle fires for years and I loved it. So I wanted another newer one and it's great! Has a good battery."
    },
    {
      "reviews.date": "2017-05-17T00:00:00.000Z",
      "reviews.id": "bc325f93-47d5-427f-ad06-a9b271763ec9",
      "reviews.rating": 5,
      "reviews.text": "My mom loves the kindle fire hd 8. She had the first kindle and it was time for an upgrade! Great buy for her birthday present!!"
    },
    {
      "reviews.date": "2017-02-10T00:00:00.000Z",
      "reviews.id": "242c6f07-160e-46c4-b0ee-c7bc090a4c7a",
      "reviews.rating": 4,
      "reviews.text": "This is a very good tablet. The only con is you may have to reboot it too often."
    },
    {
      "reviews.date": "2017-02-18T00:00:00.000Z",
      "reviews.id": "a7edbd8a-b888-422b-8c0b-abc1443a179a",
      "reviews.rating": 5,
      "reviews.text": "This is the third Fire tablet I have bought. The larger size is nice."
    },
    {
      "reviews.date": "2017-02-24T00:00:00.000Z",
      "reviews.id": "443d5fa7-5983-4233-9057-faaa6e46f4bc",
      "reviews.rating": 4,
      "reviews.text": "Bought as gift for my granddaughter who is 10. She loves it. Plays games, watches videos and listens to music."
    },
    {
      "reviews.date": "2017-03-17T00:00:00.000Z",
      "reviews.id": "9446bf80-67b5-4bab-9b86-0cf1cce4147e",
      "reviews.rating": 5,
      "reviews.text": "Only negative is the apps. Thought they were from android but they're an Amazon version and limited."
    },
    {
      "reviews.date": "2017-01-26T00:00:00.000Z",
      "reviews.id": "b39fe494-fa44-4a16-8f6e-64f55744514a",
      "reviews.rating": 5,
      "reviews.text": "Got this for my 10 year old granddaughter and she loves it. Uses it for game play, homework, etc. Mom and Dad loves the parental controls. Not having to worry so much."
    },
    {
      "reviews.date": "2016-12-19T00:00:00.000Z",
      "reviews.id": "4e422c05-240a-49cf-9b06-1d666abd65c2",
      "reviews.rating": 5,
      "reviews.text": "I bought this for a daughter, who would be taking this to school for BYOD. It's perfect size table offers, loads of amazon goodies if you are prime member. For our need, it was good enough, but one of the requirement was to have Google App support on this. Since this runs Fire OS, it's everything Amazon proprietary. There as \"howto\" on web on getting google play store and its app on this, but the integration with the device lacks upon those \"fixes\" from the articles on how to get Google app store working on this tablet. Since it would not be useful for her in school because of requirements for Google apps, we're returning it. Otherwise, Great tablet, but Fire OS restricts Google Apps."
    },
    {
      "reviews.date": "2016-12-16T00:00:00.000Z",
      "reviews.id": "2f910fff-d038-43ad-9fa8-cad914ec322e",
      "reviews.rating": 4,
      "reviews.text": "Bought this for a work fundraiser and the recipient enjoyed it"
    },
    {
      "reviews.date": "2017-04-17T00:00:00.000Z",
      "reviews.id": "aea01db8-106b-4653-a763-08301218f755",
      "reviews.rating": 5,
      "reviews.text": "I bought this kindle for my 11yr old granddaughter for Christmas. Me and my husband both had kindles several years prior, and she and my 6 year old grandson love watching and playing on them. Both children have all kinds of game systems but use the kindle way more. My 6 yr old grandson still plays with mine and loves watching you tube, videos and playing games on it. He has several game systems, Xbox, sega, ds but still uses my kindle all the time over those systems.my husband used his all the time for everything from internet to watching movies and shows. I'm getting ready to buy my grandson a new kindle( mine is a bit older and has cracked screen now but still works good).He would like one to call his own. I'm looking at a 16 GB or 32 GB.they are really durable and tough."
    },
    {
      "reviews.date": "2016-12-14T00:00:00.000Z",
      "reviews.id": "e2a35c44-aad6-485e-b5e8-9ee77928af4a",
      "reviews.rating": 5,
      "reviews.text": "I purchased this product with an eye on simply trying out a tablet. It has become a product I use every day. You have to get used to the Amazon app store, which is different than the Google Play store, though it is still android-based. The tablet is fast and the user experience is satisfying. I purchased the 32Gb. model for the extra storage space. It is a great tablet for under $100!"
    },
    {
      "reviews.date": "2017-03-03T00:00:00.000Z",
      "reviews.id": "8fcdf859-cd48-483b-b474-965c9d899801",
      "reviews.rating": 5,
      "reviews.text": "I have one, purchased this one for my mother in law, she had a 7 inch, between the bigger screen and HD, this one is much easier on her eyes and she can use it for longer periods of time without her eyes bothering her."
    },
    {
      "reviews.date": "2017-03-31T00:00:00.000Z",
      "reviews.id": "b3ad1817-6537-4dec-b04b-4cfb65c81495",
      "reviews.rating": 5,
      "reviews.text": "I love the internet, tweeting and facebook. No computers can complete me!! My kindle takes care of all my needs ;) !!!Juju"
    },
    {
      "reviews.date": "2017-06-03T00:00:00.000Z",
      "reviews.id": "8090e9e4-9ff2-4a72-a02b-6e2749bdb494",
      "reviews.rating": 5,
      "reviews.text": "My grandkids play on my smaller one. Thought I better get a back up for me."
    },
    {
      "reviews.date": "2017-03-13T00:00:00.000Z",
      "reviews.id": "8e94abd1-fabc-442d-9b74-f5c7966e1d1e",
      "reviews.rating": 4,
      "reviews.text": "The kindle over all is great. There's only one thing I would want better and that is the speaker. My last kindle was louder. I really miss the louder speaker."
    },
    {
      "reviews.date": "2017-02-25T00:00:00.000Z",
      "reviews.id": "7791cdce-bef6-4e27-b023-4086a9d5fd0a",
      "reviews.rating": 4,
      "reviews.text": "It's great to some extent but I was expecting more. It's unfortunate that it does not work with lots of apps. Perhaps I'm not using them correctly. I'm still learning."
    },
    {
      "reviews.date": "2017-02-23T00:00:00.000Z",
      "reviews.id": "5075af03-fafb-4ed7-9504-f095c7656fa2",
      "reviews.rating": 5,
      "reviews.text": "GREAT MEMORY,GREAT MOVIES,GREAT READING, GREAT GAMES,DO I HAVE TO SAY MORE"
    },
    {
      "reviews.date": "2017-05-09T00:00:00.000Z",
      "reviews.id": "30f15fd6-ed6c-4538-875b-9579c5317435",
      "reviews.rating": 5,
      "reviews.text": "Through all of my research this was the best value for what I was looking for in an e-reader with additional options I was not sure I would use or not. Turns I do because of the ease of usage."
    },
    {
      "reviews.date": "2017-02-17T00:00:00.000Z",
      "reviews.id": "9a94ec59-31ee-40f4-a2ff-313e4ce45c0d",
      "reviews.rating": 3,
      "reviews.text": "In my opinion it's very slow for internet use. Good for our 5 yr old to use but we purchased this for her to do online curriculums, which is almost impossible to do with this tablet because of the speed. Our internet connection is great with every other laptop and computer in the house."
    },
    {
      "reviews.date": "2017-01-16T00:00:00.000Z",
      "reviews.id": "85387c16-5685-43a3-a9d2-59f456e0c67e",
      "reviews.rating": 5,
      "reviews.text": "New Kindle Fire 8 is easy to setup, great for reading, no issues at all when trying to connect to my home network. I would recommend this item for anyone who wants to read and get on the internet."
    },
    {
      "reviews.date": "2017-02-11T00:00:00.000Z",
      "reviews.id": "811b6c95-ef3c-4005-bc44-9d9e148a04a0",
      "reviews.rating": 1,
      "reviews.text": "Bought this mostly as a backup.and to read a few books, since I have a larger cell phone and a back up. Used it occasionally may 40 or 50 hours of use till this week when I sent my laptop in for repairs. so I probably used it a tot this week. I was watching my 3rd Primetime video this week and it simply turned off. It will not turn on using any power trick such as safe mode. It is gone, It is toast. Bought it October 11, 2016 , It quit on February 9, 2015. My old Fire lasted 4 or 5 years with more use. it had stereo speakers, lasted a week on a charge not 2 or 3 days.Sturdier built. This is full of junk, I am not just offered more apps, it is constantly trying to add them. JUNK JUNK JUNK"
    },
    {
      "reviews.date": "2016-12-31T00:00:00.000Z",
      "reviews.id": "93ebaada-f6c4-4128-90c8-54f5720b3d2f",
      "reviews.rating": 4,
      "reviews.text": "A little more complicated than my original kindle, but I lIke it."
    },
    {
      "reviews.date": "2017-02-13T00:00:00.000Z",
      "reviews.id": "3e561034-dc7b-4595-90c5-e2bbf150378c",
      "reviews.rating": 5,
      "reviews.text": "easy to use. nice sides and easy to read ,, also very easy to load"
    },
    {
      "reviews.date": "2016-11-18T00:00:00.000Z",
      "reviews.id": "b716fbd1-e34d-4f24-b8ad-f000edbde723",
      "reviews.rating": 5,
      "reviews.text": "I love new Kindle Fire. I love the convenience having books with me all the time being able to have an entire library at my fingertips."
    },
    {
      "reviews.date": "2017-04-11T00:00:00.000Z",
      "reviews.id": "3996818d-5c9f-431f-ab8a-f85d6119cb9d",
      "reviews.rating": 5,
      "reviews.text": "Thanks. We really like this tablet . It's easy to use"
    },
    {
      "reviews.date": "2017-03-15T00:00:00.000Z",
      "reviews.id": "54a9bc45-3449-4220-8c7a-5bfb27a7ac5d",
      "reviews.rating": 5,
      "reviews.text": "I talk myself into the 32g and I am so glad I did!!! I have used only kindles for the past 5 years and I love them.... I love the color as well!!!"
    },
    {
      "reviews.date": "2016-12-08T00:00:00.000Z",
      "reviews.id": "edf13eed-03a0-40c3-b9d8-bccff21872a7",
      "reviews.rating": 5,
      "reviews.text": "Excellent value, lets me lug all my favorite books around and read whenever. Wouldn't be without it."
    },
    {
      "reviews.date": "2016-12-30T00:00:00.000Z",
      "reviews.id": "b8f3c03b-8c34-401a-9100-b39ce6a704d0",
      "reviews.rating": 5,
      "reviews.text": "It is amazing that you can get this much tech for such a low price. This thing does everything I need, and it's so much faster than my old Kindle."
    },
    {
      "reviews.date": "2017-03-16T00:00:00.000Z",
      "reviews.id": "a07d4062-44c3-476b-85ac-4aa7e93634f1",
      "reviews.rating": 5,
      "reviews.text": "This is my 3rd Kindle upgrade. I love everything about it. The ebooks read to me at night, the games and the movies show extremely well...feels as though I am right there. My kids have ipads...but I'm stuck on my Kindle."
    },
    {
      "reviews.date": "2017-01-16T00:00:00.000Z",
      "reviews.id": "4c366fd0-6293-4160-8c73-261c94d429bf",
      "reviews.rating": 5,
      "reviews.text": "This is my second kindle. Have a few more items to learn. But love it. Easy to get around the apps."
    },
    {
      "reviews.date": "2017-03-03T00:00:00.000Z",
      "reviews.id": "63ab6f6b-728f-48d1-adc5-ae3a17a6c741",
      "reviews.rating": 4,
      "reviews.text": "I was literally still using my first gen Kindle Fire and finally upgraded. I love the new one. The only negative is the speakers. My first one is louder than this one."
    },
    {
      "reviews.date": "2016-12-25T00:00:00.000Z",
      "reviews.id": "19908f21-d4a4-4643-b506-7ec1436ee5bc",
      "reviews.rating": 5,
      "reviews.text": "Got this for my wife for Christmas and she loves it! She has the iPad but this Kindle Fire 8hd is so much easier to use for books and the occasional solitaire game. I am glad I bought the 32mb as I would rather have too much storage space than not enough. Great product and very easy to read books on."
    },
    {
      "reviews.date": "2017-05-06T00:00:00.000Z",
      "reviews.id": "e4d8db9f-91ed-4895-882e-83f2eee646a4",
      "reviews.rating": 5,
      "reviews.text": "Much more memory that my prior kindles. Luv that I can add a sd card for extra storage"
    },
    {
      "reviews.date": "2017-01-08T00:00:00.000Z",
      "reviews.id": "b833f90a-568c-4ad9-9258-c34362c8d24f",
      "reviews.rating": 5,
      "reviews.text": "Not only did my daughter in law love it I was able to experience convenience of having it shipped!"
    },
    {
      "reviews.date": "2017-03-31T00:00:00.000Z",
      "reviews.id": "59e32fbd-6411-49e9-a00a-547445358943",
      "reviews.rating": 5,
      "reviews.text": "I like it. It keeps my granddaughter business and great apps too."
    },
    {
      "reviews.date": "2017-01-08T00:00:00.000Z",
      "reviews.id": "c58ea584-0bd8-489b-9340-e6279c5e7512",
      "reviews.rating": 5,
      "reviews.text": "Great value, a lot of color choices. I was able to boost up the memory for just a little extra but made the apps run so much faster. Love them"
    },
    {
      "reviews.date": "2017-03-10T00:00:00.000Z",
      "reviews.id": "fa63fb03-f676-4227-a3a4-c9c9fabbbc5c",
      "reviews.rating": 5,
      "reviews.text": "We replaced and aging fire HDX. She noticed the WiFi connection is improved and the screen is larger. She prefers this to my iPad Air"
    },
    {
      "reviews.date": "2017-03-17T00:00:00.000Z",
      "reviews.id": "b6d2d62d-966d-4f13-bf1e-87683ea33b8e",
      "reviews.rating": 5,
      "reviews.text": "I have really enjoyed my new kindle and the ability to take pictures. It stays charged a long time when I am reading a book or watching a movie. I just wish that kindles could run on an LTE network as well when you do not have a WiFi signal."
    },
    {
      "reviews.date": "2017-01-23T00:00:00.000Z",
      "reviews.id": "f481c982-7f69-40d9-be6f-76f9fc860064",
      "reviews.rating": 5,
      "reviews.text": "I purchased this Kindle Fire for my husband and he loves it. He had an older model which he loved but my dog accidentally broke it. This updated version has so many new features which he loves!"
    },
    {
      "reviews.date": "2017-04-14T00:00:00.000Z",
      "reviews.id": "c580115b-1623-4438-8a0c-e6e8d7a09b9e",
      "reviews.rating": 4,
      "reviews.text": "This is my first Fire Kindle. I love it. It is fast, and has good internet. It gives me quick access to all my Kindle library. I found out it's easier to scroll through the pages than when using Kindle Touch."
    },
    {
      "reviews.date": "2017-03-19T00:00:00.000Z",
      "reviews.id": "2c271210-47be-4585-9d82-d7da1d27650c",
      "reviews.rating": 4,
      "reviews.text": "Used it for watching television shows. The picture was clear and the audio was decent for the location of the speakers."
    },
    {
      "reviews.date": "2017-01-06T00:00:00.000Z",
      "reviews.id": "1de24aef-bbba-4d97-a1ea-e51a47dcba4b",
      "reviews.rating": 4,
      "reviews.text": "If you're looking for something basic at a good price then these are for u. These are not iPad quality but if u have prime then it's well worth it."
    },
    {
      "reviews.date": "2017-04-19T00:00:00.000Z",
      "reviews.id": "603586de-75f3-44d5-8aba-f01c8d690bed",
      "reviews.rating": 5,
      "reviews.text": "Wife really likes it. Works great& likes the front & back camera."
    },
    {
      "reviews.date": "2017-03-31T00:00:00.000Z",
      "reviews.id": "e27e82ed-ba73-4fc0-b6f2-d139669e83ad",
      "reviews.rating": 4,
      "reviews.text": "Have been using this for a while and never believe it would be so handy and helpful. Product features are good and is quite handy to carry anywhere."
    },
    {
      "reviews.date": "2017-02-13T00:00:00.000Z",
      "reviews.id": "018f7364-e9e3-479e-bb17-a68295b97dcd",
      "reviews.rating": 5,
      "reviews.text": "Had a prob with original one I purchased and Bedt Buy replaced it hassle free"
    },
    {
      "reviews.date": "2017-01-07T00:00:00.000Z",
      "reviews.id": "6dc434e6-5fa3-4796-b4ff-2589f971536c",
      "reviews.rating": 5,
      "reviews.text": "My wife loves the tablet! She's only using it for internet so far and it has worked flawlessly!"
    },
    {
      "reviews.date": "2017-02-04T00:00:00.000Z",
      "reviews.id": "e5902dc4-fca8-4aa6-b238-d2da79386f07",
      "reviews.rating": 4,
      "reviews.text": "Purchased this tablet for a gift..They love it. Easy to use."
    },
    {
      "reviews.date": "2016-12-24T00:00:00.000Z",
      "reviews.id": "4b9317e5-45de-454b-803b-b87458e0dbbe",
      "reviews.rating": 1,
      "reviews.text": "The last 2 models of Kindle HDX 8 have been terrible. We have purchased 2 of each model of Kindle and up until the last 2 models, they have been great. Last years had to be replaced 7 or 8 times and for the same problem. The slot for the SD card is defective. I gave up and bought the newest model. It shuts completely down if you try to plug it in to external speakers and sometimes it shuts down for no reason. It's going back after the first of the year. This is going to be my last year for Kindles unless they make them the same quality as before. Phooey!"
    },
    {
      "reviews.date": "2016-11-16T00:00:00.000Z",
      "reviews.id": "e0e92110-7e47-494d-babc-8b7fe52acfe2",
      "reviews.rating": 1,
      "reviews.text": "I had to return this product as it was not compatible with things such as Facebook and Itunes... which is what I needed it for. Great if you are into books and streaming movies!"
    },
    {
      "reviews.date": "2017-01-30T00:00:00.000Z",
      "reviews.id": "7a882cfc-5da4-40e2-a738-37e4e17b8640",
      "reviews.rating": 5,
      "reviews.text": "This has replaced my laptop for out and about. Easy to use. In addition, I can now read e books and listen to audio books. So convenient....."
    },
    {
      "reviews.date": "2017-02-25T00:00:00.000Z",
      "reviews.id": "6587eae2-59de-48a3-ad26-87fb446f97c8",
      "reviews.rating": 4,
      "reviews.text": "But, I can't figure out how to move books I've read, into the Cloud? I don't like clutter, and the more I read and download, just clogs up."
    },
    {
      "reviews.date": "2017-01-16T00:00:00.000Z",
      "reviews.id": "29601d08-5414-43fc-906f-7ab80bfe4d43",
      "reviews.rating": 5,
      "reviews.text": "Perfect tablet for the avid reader. Great functions light blue light filter to safeguard circadian rhythm so you do not have trouble falling asleep after being exposed to the light of a typical tablet. Easy to use and fits perfectly in hand and not too heavy for onext handed use."
    },
    {
      "reviews.date": "2017-03-26T00:00:00.000Z",
      "reviews.id": "bdd1bbaf-07de-40fa-b2ba-82241bb717e3",
      "reviews.rating": 4,
      "reviews.text": "My Fire is compact and easy to use. Mainly used to read online books at lunch time. The battery lasts much longer than previous tablet I had and charges much quicker. very happy with my Fire."
    },
    {
      "reviews.date": "2017-04-21T00:00:00.000Z",
      "reviews.id": "bcb4f370-18d4-4b7a-b666-ed26c5118225",
      "reviews.rating": 4,
      "reviews.text": "I couldn't get the tablet to work with my WiFi so I returned it and bought a Samsung A-8."
    },
    {
      "reviews.date": "2016-12-04T00:00:00.000Z",
      "reviews.id": "0dffb082-14ed-4efb-98bc-2bb7a0f49410",
      "reviews.rating": 5,
      "reviews.text": "For the price this is an excellent tablet. I have a high end laptop that does convert to tablet but at almost 16\" and the foldover design I normally just use it in laptop mode. I also have a high end \"phablet\" sized phone. So I was not sure how often I'd use a tablet, and did not want to spend 500ish on an ipad. The Fire has been a great \"in between\" so far on days I use my phone alot and want to avoid charging more than once per day, and don't have the need to use my laptop. The speed is zippy & the screen clarity/quality is good enough. Storage is even better than ipads since it is expandable (for now I use a 64 gb card giving me a total of 96 gb, but the expandable can go up to 200 gb). Tying into Amazon is nice since I have Amazon Prime). Basic web surfing, email & facebook work great. The only \"bad\" feature is the camera & video quality. But that does not matter to me since I have my high quality camera & video recorder on my phone. Only other slight negative is light bleed noticed just when booting up on grey screen. Color/brightness uniformity is perfect to my eyes once it is up & running. Really enjoying the kindle component for book & magazine reading as well. Overall, probably the best $100 I have spent in a long time."
    },
    {
      "reviews.date": "2016-12-23T00:00:00.000Z",
      "reviews.id": "76fc9940-6272-41b2-92c1-577ae27569c2",
      "reviews.rating": 4,
      "reviews.text": "So far the tablet has been working without any issues. Haven't used it enough to rate it any higher but time will tell."
    },
    {
      "reviews.date": "2017-01-09T00:00:00.000Z",
      "reviews.id": "98094e59-0fde-40be-a779-864a6812a926",
      "reviews.rating": 5,
      "reviews.text": "I found the Amazon Fire HD to be very easy to travel back and forth to school. I can easily transfer my work in class to my main computer at home!"
    },
    {
      "reviews.date": "2017-01-06T00:00:00.000Z",
      "reviews.id": "a0d19b65-59eb-4ca0-9d89-7984e081f3bf",
      "reviews.rating": 5,
      "reviews.text": "Purchased this for a gift for my mother who is a amazon fanatic she loves it ! Made her christmas this year"
    },
    {
      "reviews.date": "2017-02-03T00:00:00.000Z",
      "reviews.id": "cee1195a-aac3-48dc-b686-1cae8f78939c",
      "reviews.rating": 5,
      "reviews.text": "Easy to use. Very lightweight. Would recommend to anyone"
    },
    {
      "reviews.date": "2017-02-17T00:00:00.000Z",
      "reviews.id": "91b3232a-a39d-4dfa-8335-91e0a71d9acb",
      "reviews.rating": 4,
      "reviews.text": "Wanted something with a kids mode on it so we could limit time and content. This works. Saw it for a really low price so couldn't resist otherwise we would have gotten the padded kids version."
    },
    {
      "reviews.date": "2017-01-20T00:00:00.000Z",
      "reviews.id": "3277f63b-a609-4ebd-adf0-82f2c70852d8",
      "reviews.rating": 4,
      "reviews.text": "I know many people who have a kindle. It frees up using the cell phone memory, so I bought this one for the amount of storage it has, as well as the cost of the item. Thank you."
    },
    {
      "reviews.date": "2017-03-18T00:00:00.000Z",
      "reviews.id": "3a4a2083-f549-4e0a-ab3b-e7cbc6abc0e6",
      "reviews.rating": 4,
      "reviews.text": "great kid friendly product, hours of enjoyment for all."
    },
    {
      "reviews.date": "2017-04-21T00:00:00.000Z",
      "reviews.id": "3e160388-4c27-43bf-82a6-b1ef0f667664",
      "reviews.rating": 1,
      "reviews.text": "I bought this because I have ebooks in college. Not only could I not get my ebook. I called the school IT department. They could not either. My semester was already started. The sales representative at the store told me this is what I needed. I ended up buying a tablet from my phone carrier and my ebooks were right there in less than 5 minutes with the schools IT department help."
    },
    {
      "reviews.date": "2017-01-29T00:00:00.000Z",
      "reviews.id": "c1862b69-2125-457d-bcdd-705e50901f51",
      "reviews.rating": 5,
      "reviews.text": "Not to big, not to small. Just right for for taking your movies and music on the go. I bought this to go with my Amazon Prime membership. Popped in a 128 Gb mini sd card for plenty of storage."
    },
    {
      "reviews.date": "2017-01-27T00:00:00.000Z",
      "reviews.id": "b1363c4e-7a14-4716-af29-0e6dd867032b",
      "reviews.rating": 4,
      "reviews.text": "I bought this device to use with children in my therapy practice. It is taking me awhile to figure out how to set it up and organize it. IT 'took over' and set up things with Amazon I did not approve such as charging my account and registering me with Prime before I could figure out the settings. The picture quality for the screen is beautiful but the camera photos are very pixelated."
    },
    {
      "reviews.date": "2017-06-02T00:00:00.000Z",
      "reviews.id": "b013e520-828f-4e63-874a-419eef94c602",
      "reviews.rating": 5,
      "reviews.text": "It has such a BIG screen to see better. It loads games and books very fast!"
    },
    {
      "reviews.date": "2017-02-17T00:00:00.000Z",
      "reviews.id": "d9437bd9-e933-4c05-8b89-feb886943a99",
      "reviews.rating": 4,
      "reviews.text": "I was looking to upgrade from my old Kindle reader and stumbled on the Fire HD which is not only a reader but a tablet as well. Fairly easy to use. I really only needed to read books but how have a tablet as well. I wish it supported all google play apps and not just Amazon apps but I can check email and get to the web so it serves the purpose. But...when I want to read in the middle of the night, getting to the web can be distracting."
    },
    {
      "reviews.date": "2017-01-06T00:00:00.000Z",
      "reviews.id": "0ce0d1a9-8023-4a97-9299-104267c62a23",
      "reviews.rating": 4,
      "reviews.text": "Works very well. Video quality is very good. It is easy to navigate."
    },
    {
      "reviews.date": "2017-01-18T00:00:00.000Z",
      "reviews.id": "021f4055-3b11-46ce-9480-d830ce019573",
      "reviews.rating": 5,
      "reviews.text": "Very sleek design and very easy to use - nice graphics!!!"
    },
    {
      "reviews.date": "2016-12-04T00:00:00.000Z",
      "reviews.id": "89b2dafb-d74f-4a7b-a085-5423f6dbe946",
      "reviews.rating": 4,
      "reviews.text": "Fast, fluid, and lots of apps especially once I added the google play store(very simple to do and doesn't require anything that voids the warranty). Display is sharp and video and games load quickly. I deducted one star as Amazon's version of android lacks the ability of customization."
    },
    {
      "reviews.date": "2017-01-17T00:00:00.000Z",
      "reviews.id": "a4026d62-ef7a-4d52-ae31-99bf8997de34",
      "reviews.rating": 5,
      "reviews.text": "Very happy with product. It's a miniature lap top."
    },
    {
      "reviews.date": "2017-04-26T00:00:00.000Z",
      "reviews.id": "40a38a2d-aec0-4d04-813a-45b988c8ab47",
      "reviews.rating": 5,
      "reviews.text": "This is very nice for a little over 100.00 dollars. It took a bit to get use to after using a iPad. I got this to travel with or take to the beach nice size very lightweight."
    },
    {
      "reviews.date": "2017-03-11T00:00:00.000Z",
      "reviews.id": "799691a1-56f1-4596-ae80-faaeac0dd8cf",
      "reviews.rating": 5,
      "reviews.text": "Purchased this as a gift for my wife because her B&N Nook was dying. She absolutely loves it, especially since it does so much more. I'm now waiting for my Nook to start acting up so that I have an excuse to get a Kindle for myself."
    },
    {
      "reviews.date": "2016-12-20T00:00:00.000Z",
      "reviews.id": "1d9730ac-df71-4bc5-a0ce-83e14c29c700",
      "reviews.rating": 5,
      "reviews.text": "Haven't had this long but so far so good. It's nice when you buy a product and it works exactly how it is supposed to."
    }
  ]
}