{
  "id": "AVqVGZNvQMlgsOJE6eUY",
  "dateAdded": "2017-03-03T16:56:05Z",
  "name": "All-New Kindle E-reader - Black, 6\" Glare-Free Touchscreen Display, Wi-Fi - Includes Special Offers",
  "asins": "B00ZV9PXP2",
  "brand": "Amazon",
  "categories": "Computers,Electronics Features,EBook Readers,Tablets,Electronics,Amazon Ereaders,iPad & Tablets,Kindle E-readers,iPad Accessories,Used:Tablets,E-Readers,E-Readers & Accessories,Computers/Tablets & Networking,Used:Computers Accessories,iPads Tablets,All Tablets,Tablets & E-readers,Amazon Book Reader,Computers & Tablets,Amazon,Tablets & eBook Readers",
  "primaryCategories": "Electronics",
  "keys": "allnewkindleereaderblack6glarefreetouchscreendisplaywifiincludesspecialoffers/9siahd68dy2959,allnewkindleereaderblack6glarefreetouchscreendisplaywifiincludesspecialoffers/b00zv9pxp2,allnewkindleereaderblack6glarefreetouchscreendisplaywifiincludesspecialoffers/9siafvd7fk6707,0848719083774,848719083774,allnewkindleereaderblack6glarefreetouchscreendisplaywifiincludesspecialoffers/322538285013,allnewkindleereaderblack6glarefreetouchscreendisplaywifiincludesspecialoffers/5442403,allnewkindleereaderblack6glarefreetouchscreendisplaywifiincludesspecialoffers/kier2016bk,allnewkindleereaderblack6glarefreetouchscreendisplaywifiincludesspecialoffers/162691587356,allnewkindleereaderblack6glarefreetouchscreendisplaywifiincludesspecialoffers/391843532825,kindleereaderblack6glarefreetouchscreendisplaywifiincludesspecialoffers/b00zv9pxp2,allnewkindleereaderblack6glarefreetouchscreendisplaywifiincludesspecialoffers/252974470193,amazon/b00zv9pxp2,amazonkindleblack/5435001,amazonkindleblack/5442403,allnewkindleereaderblack6glarefreetouchscreendisplaywifiincludesspecialoffers/1631053",
  "manufacturer": "Amazon",
  "reviews": [
    {
      "reviews.date": "2017-03-26T04:08:34.000Z",
      "reviews.id": "01086e4f-c116-4009-aff3-6fdd4815e6d7",
      "reviews.rating": 4,
      "reviews.text": "thought rice was a little high but now that i have one, it is worth every penny. have not had any problems with it and not bothered by not having a backlight"
    },
    {
      "reviews.date": "2017-11-02T17:33:31.000Z",
      "reviews.id": "081581cb-183b-41ab-a847-03016b321b00",
      "reviews.rating": 5,
      "reviews.text": "I am 100 happy with my purchase. I caught it on sale at a really good price. I am normally a real book person, but I have a 1 year old who loves ripping up pages. The Kindle prevents that, it's extremely portable (it fits better in my purse than a giant book), and I have it loaded with lots of books. I finish one and start another, without having to go store. It serves all my needs. I picked this one over the Paperwhite because the price was unbeatable and the only difference that I could see was this one wasn't backlit. A simple book light from the Dollar tree solves that issue. This is my second Kindle (the first being the old Keyboard model, which I put down because I fell out of love with the keyboard. Lol) and it most likely won't be my last."
    },
    {
      "reviews.date": "2017-03-22T15:18:54.000Z",
      "reviews.id": "37864602-e11a-4d83-88f8-d642d3dca938",
      "reviews.rating": 4,
      "reviews.text": "This is a nice bare-bones reading device. Easy to set up and use. My greatest issue is that it isn't back lit so it can't be used w/o a light on in the room. Returning it an purchasing a paperwhite instead."
    },
    {
      "reviews.date": "2017-06-09T00:00:00.000Z",
      "reviews.id": "359ebf09-4b81-4fdb-9090-23c88659944b",
      "reviews.rating": 5,
      "reviews.text": "I love my Kindle black. I can read for hours without making my eyes sore the way a phone screen would. The functions are easy to use. Everything is set up clearly and simply. It's shape is adorable, and it's surprisingly light. The battery does last a long time."
    },
    {
      "reviews.date": "2016-11-17T00:00:00.000Z",
      "reviews.id": "79e96240-bab9-4193-ac96-266f020d9835",
      "reviews.rating": 5,
      "reviews.text": "My nephew is going to high school and the kindle is a great gift for him. Bestbuy has good selection and the price is good too!"
    },
    {
      "reviews.date": "2017-06-14T00:00:00.000Z",
      "reviews.id": "b7bc5d61-65e3-453f-aff2-24e1349c605f",
      "reviews.rating": 5,
      "reviews.text": "Kindle just keeps getting better. This device is the perfect size to pack away for a business trip to kill some time reading a book or even uploading your documents to access them quickly."
    },
    {
      "reviews.date": "2016-09-25T00:00:00.000Z",
      "reviews.id": "af3a968e-6610-4b31-bfa7-b8bf5e816ee4",
      "reviews.rating": 5,
      "reviews.text": "Easy to navigate. Daughter loves it. It's lightweigh and its just what she needed for this avid reader."
    },
    {
      "reviews.date": "2017-09-01T00:00:00.000Z",
      "reviews.id": "5e04d992-2c18-4494-9445-c2005b5250cf",
      "reviews.rating": 4,
      "reviews.text": "I like this e reader, but wish the screen were higher resolution. It requires decent light to look good, but it is easy on my eyes. The screen updates involve flashing the whole screen, which I noticed less over time. The advertised month long battery life is just standby time, it lasts much less if you are downloading and reading books."
    },
    {
      "reviews.date": "2017-01-18T00:00:00.000Z",
      "reviews.id": "9a1e2a45-6b92-4f7f-b199-8711184465eb",
      "reviews.rating": 5,
      "reviews.text": "I'm an avid reader. The Kindle is my go to for ease. It fits in my purse or knitting bag and stays charged for days."
    },
    {
      "reviews.date": "2016-11-23T03:38:24.000Z",
      "reviews.id": "086f62ee-2e46-4a59-b10c-90d388ef1ff2",
      "reviews.rating": 5,
      "reviews.text": "I love the Amazon Kindles! They are a reasonable price for a great little tablet."
    },
    {
      "reviews.date": "2017-12-20T17:38:23.000Z",
      "reviews.id": "c1b0fa39-7755-4f4b-8e17-dd379c03ab77",
      "reviews.rating": 5,
      "reviews.text": "I ordered this for my daughter, as I have the black paperwhite, and I love it. I read quite a bit and the larger books were driving me crazy having to hold them up while laying down, or wanting to take a book on vacation and lugging around a thick paperback, with this I can throw it in my bag and read anywhere. Its light weight, easy to use, the battery life lasts for weeks, which makes it an all around awesome device. My daughter is in public school and they offer an online library for E-Readers, so she can now download books for free from school! You can also download your own public library app (if your county offers that) and read free from there as well. You can shop for e-books straight from the device through Amazon.com."
    },
    {
      "reviews.date": "2017-11-17T00:00:00.000Z",
      "reviews.id": "4ebed6a1-b5e2-453f-896e-92fd234bcfcb",
      "reviews.rating": 4,
      "reviews.text": "Nice alternative for reading kindle books for kids. Not many features but good enough for reading."
    },
    {
      "reviews.date": "2017-01-01T00:04:32.000Z",
      "reviews.id": "8384cdbe-ad7f-46dc-b344-a78e1a124330",
      "reviews.rating": 3,
      "reviews.text": "This was advertised as the latest version 8. My ignorance led me to its 79 price. I thought they were all Paperwite - as in just like white paper in a book. Bought it for my wife. I returned mine as a refused shipment and ordered the PaperWhite. It has a backlight, higher resolution, and for 20, worth it. Kindler 1"
    },
    {
      "reviews.date": "2017-11-30T18:53:26.000Z",
      "reviews.id": "d8c70e87-61f5-480c-b82d-4c8eb81d0e7e",
      "reviews.rating": 4,
      "reviews.text": "I bought this because it was 30.00 off for the early Black Friday sale and it doesn't need to be charged every day like my fire tablet. (Which is very annoying to have to stop reading because the battery is dying). This stays charged for days! This works great during the day and I bought a Energizer book light for 6.99 that clicks on it. The book light works just fine for night reading. Only con is the magazines I downloaded are not in color which I miss,so I will use for books only. I like the size and I able to carry it in my purse and read as I commute."
    },
    {
      "reviews.date": "2017-04-07T00:00:00.000Z",
      "reviews.id": "26ca013f-ba9e-45fe-b658-f37d0b29f7da",
      "reviews.rating": 5,
      "reviews.text": "I really enjoy reading and on my iPad was hurting my eyes. This Kindle really works great."
    },
    {
      "reviews.date": "2017-12-07T17:26:18.000Z",
      "reviews.id": "a23ecec6-fab8-44bb-be85-034372023fbb",
      "reviews.rating": 5,
      "reviews.text": "I bought some to my friend as gifts.The product are all very good."
    },
    {
      "reviews.date": "2018-05-02T16:39:06.000Z",
      "reviews.id": "aae95290-6d3a-4f80-a682-407f8b162e3a",
      "reviews.rating": 5,
      "reviews.text": "Very light and easy to read on. Could have more pixles like the Paperwhite, but looks still pretty much like a book. Battery lasts forever, but without a sale its a little bit overpriced."
    }
  ]
}