{
  "id": "AVqVGZN9QMlgsOJE6eUZ",
  "dateAdded": "2017-03-03T16:56:05Z",
  "name": "Kindle Oasis E-reader with Leather Charging Cover - Black, 6 High-Resolution Display (300 ppi), Wi-Fi - Includes Special Offers",
  "asins": "B00REQKWGA",
  "brand": "Amazon",
  "categories": "eBook Readers,E-Readers & Accessories,Electronics Features,Amazon Book Reader,Computers & Tablets,Amazon Ereaders,Kindle E-readers,E-Readers",
  "primaryCategories": "Electronics",
  "keys": "amazon/53003651,0848719057331,kindleoasisereaderwithleatherchargingcoverblack6highresolutiondisplay300ppiwifiincludesspecialoffers/b00reqkwga,amazon/b00reqkwga,kindleoasisereaderwithleatherchargingcoverblack6highresolutiondisplay300ppiwifiincludesspecialoffers/5195001,848719057331",
  "manufacturer": "Amazon",
  "reviews": [
    {
      "reviews.date": "2016-11-18T00:00:00.000Z",
      "reviews.id": "8402f752-e622-4c73-bbe4-7adbb0a250e4",
      "reviews.rating": 5,
      "reviews.text": "Kindles are an excellent device for all book lovers"
    },
    {
      "reviews.date": "2016-09-02T00:00:00.000Z",
      "reviews.id": "c6e9b7f1-2ea6-4c2d-be8d-27f5aa0236b1",
      "reviews.rating": 5,
      "reviews.text": "I read a lot and have loved my kindle paperwhite and used it all the time. I didn't think it could get any better! I read all about the kindle Oasis and it sounded great but the price was freaking me out and I kept thinking I really didn't need it! Well I finally talked myself into just trying it and after just taking it out of the box and holding it I was sold. It is so lightweight and so easy to hold and the screen is wonderful! The charging case is so convenient and so easy to take off and put on and it really looks nice. I never keep it on when I'm reading which keeps the kindle oasis light. I am so glad that I went for it and bought it. I want to read more than ever now. It is always in my purse. Believe me, I am not made of money in the least but I am so glad that I purchased this. If you are an avid reader you will be too!"
    },
    {
      "reviews.date": "2016-06-13T00:00:00.000Z",
      "reviews.id": "3556db99-5a83-4652-ba0f-544d9d89f9d5",
      "reviews.rating": 5,
      "reviews.text": "Very nice Kindle with a great Battery life. My old kindle was not able to upgrade so I got the new Kindle and very pleased with the product. Arrived as promised from BESTBUY.COM."
    },
    {
      "reviews.date": "2016-08-18T00:00:00.000Z",
      "reviews.id": "086b2bc4-26b5-4218-b428-68ff5e8716ef",
      "reviews.rating": 4,
      "reviews.text": "There's no doubt that this is the best Kindle device available. The battery life is astonishing, and the design is unique and extremely ergonomic. Holding this in your hand is such a pleasurable experience, it fits like a glove. So what are the cons you may ask...For one, the battery life depends on the provided case. It acts like a travel charger in a sense. Why a con? Well, it limits your customization options. And there's no way to purchase other colors or replacements for it at this time. So, you best be cautious with it.And two, the price obviously! But if you take into account that you basically are given a premium case, the device itself is a premium device, and you have a traveling charge inside the case...It may almost even out. But a $290-$350 device is hard to justify when it's just for reading.Still would recommend to any fan of e-readers/reading"
    },
    {
      "reviews.date": "2016-05-02T00:00:00.000Z",
      "reviews.id": "dc20b77b-62da-4134-8f3a-c94110b4920f",
      "reviews.rating": 5,
      "reviews.text": "I have had every kindle since the first and this is by far the best. The screen was already great on the Voyage but the front light on this screen is more white and more evenly distributed. Physical page turn buttons are so much better than none or the haptic feedback type. They didn't include the automatically adaptive front light for some reason but I don't think I'll miss it much as I was always wont to fiddle with it on the Voyage anyway.But this device made me smile as soon as I held it for the first time because it has a larger bezel that you can really grip comfortably without touching the screen. Maybe this isn't a big deal for most, but that is exactly why I spent the money to get this device.The other thing I was hoping for was the ability to use the upper page turn button to go forward and this device does that and even better because it is software configurable.The cover is very small and light and doesn't add much bulk like the Voyage Origami case does. The only downside is that it doesn't work as a hands free stand for reading.(I still wish it was waterproof)"
    },
    {
      "reviews.date": "2017-01-30T00:00:00.000Z",
      "reviews.id": "44e6a4db-5a08-4839-b291-c34f6a8d6a65",
      "reviews.rating": 5,
      "reviews.text": "Almost feels like reading a book in a light comforting way. Easy to carry around. Great on eyes and reading is enjoyable"
    },
    {
      "reviews.date": "2017-04-23T00:00:00.000Z",
      "reviews.id": "a3a07c0d-89f0-40b9-8c77-7563b9314968",
      "reviews.rating": 5,
      "reviews.text": "I own a Kindle HDX 8.9 and wanted something small and portable... WOW is all I can say when I got my hands on the Kindle Oasis ( Thank you Babes :) ). The Kindle Oasis is very tiny, portable & fits in about anything from a jeans back pockets to a very very small purse! The clarity of the screen is awesome. The touch of it works perfect! Very different than my HDX BUT I HIGHLY RECOMMEND it! A little more pricey than the paperwhite BUT this one already comes with the case and a built in battery in the case so you are set for long time reading & the price is fair since the others you would still have to buy a case for it! Keep in mind the case for the oasis is leather and you can choose from black, brown and red (red was my choice., which to me it's not red it's more of a wine red color) it's beautiful! Picture shows My Kindle Oasis in the middle of the IPhone 7 Plus (left) & Samsung S8+ (right) so you can get an idea on the size... it's super cute! It's tinier than the Kindle paperwhite!"
    },
    {
      "reviews.date": "2017-05-12T00:00:00.000Z",
      "reviews.id": "e2d341be-6a35-4563-a7d9-90252176a64e",
      "reviews.rating": 5,
      "reviews.text": "I thought long and hard about upgrading from my paperwhite, but decided to do so despite not beating able to actually see one in the store. I have owned a Kindle since the second generation version. This is by far my favorite. The look and feel are amazing. I don't regret the purchase one bit as I have the disposable income to do so, but for most the paperwhite will more than suffice at a significantly smaller price point."
    },
    {
      "reviews.date": "2016-12-02T00:00:00.000Z",
      "reviews.id": "d027ef23-19e2-487c-ac48-111905e5eaac",
      "reviews.rating": 4,
      "reviews.text": "I love the snap on cover that charges the kindle. It is also very light."
    },
    {
      "reviews.date": "2017-02-05T00:00:00.000Z",
      "reviews.id": "362347f5-5074-4243-8864-bb89f6c2ba45",
      "reviews.rating": 5,
      "reviews.text": "Kindle Oasis is phenomenal... It is portable size so it fits almost anywhere when I travel, the book-like screen doesn't bother my eyes after long periods of time of reading, I can modify the font and size to my wants and needs, you can conveniently connect to your Goodreads account to view your bookshelves and all of my purchases sync perfectly. The color Merlot is beautiful and I've had it for three months and traveled with it and there have been no damages. The battery life is so long I have only charged it three times since owning it and I read anywhere from 3-5 hours a day. Completely user friendly."
    },
    {
      "reviews.date": "2017-02-24T00:00:00.000Z",
      "reviews.id": "2ce91fe8-dd3e-49c6-aa54-3a8bef56b123",
      "reviews.rating": 5,
      "reviews.text": "Its a great ereader but a little pricy. It has the same specs as the Voyage as far as pixels and procesor, which costs less. The only difference between this and the Voyage, is that it's much lighter, it's brighter (LEDs), and a longer battery life if you're using the cover. I've noticed the battery life drains much faster without the cover, but you'll still be able to read for hours without it. You would think it be water resistant, hence the name but it isn't. But then I don't plan on reading when it's raining or outside or while taking a bath. Overall, it's the best ereader Amazon currently has to offer but if you don't mind the price tag and want the best, then go for it! Voyage is still not a bad option though"
    },
    {
      "reviews.date": "2016-05-28T00:00:00.000Z",
      "reviews.id": "b7363f75-449c-49fb-b68c-f154ec374b0c",
      "reviews.rating": 5,
      "reviews.text": "This is my 4th kindle and is easily the best one I've ever had. It is very comfortable to hold and is very compact. I was surprised how small it is but has the same screen size as my other kindles. It may look costly at first but remember you are getting a cover with additional battery."
    },
    {
      "reviews.date": "2016-05-27T00:00:00.000Z",
      "reviews.id": "1d850062-34f5-45d9-912a-3149f3f06507",
      "reviews.rating": 5,
      "reviews.text": "This is my third Kindle. The best differentiator is the form factor. Definite improvement over the paperwhite. Also like having the page-turn buttons back. Case is very cool indeed. If you can get past the jump in price (remember you're not having to buy the case separately), it's a quality product to have."
    },
    {
      "reviews.date": "2016-05-27T00:00:00.000Z",
      "reviews.id": "589b720a-0df9-4ced-b3c5-d59cf4a95f68",
      "reviews.rating": 5,
      "reviews.text": "This is the best kindle ereader yet. The size and weight make it perfect for comfortable reading. You will find yourself reading more books than ever with it."
    },
    {
      "reviews.date": "2016-10-08T00:00:00.000Z",
      "reviews.id": "02ea4305-0213-43c7-92b6-ad5f78f9c0fc",
      "reviews.rating": 5,
      "reviews.text": "As a previous several Kindle device owner I read a lot of reviews, many of them put the Voyage above it for various reasons, mainly price, or battery charging. But, after reading the pros and cons of both I still decided the Oasis was the direction I wanted to go, I could always return it and get the Voyage after all if I didn't like it. It's light, very well lit, comfortable to hold both in the case and out of it. The buttons improve the page turning experience, I see no dark areas on my screed from the LED lights, it holds a great battery charge (true not as good as my previous Kindle, but I still generally get around 3 weeks between charges), and it looks absolutely beautiful. I am very happy with this purchases and am glad I purchased the Oasis over the Voyage. It's expensive, and that's the major con, but if you want the best reading device this is it and worth it if you read enough."
    },
    {
      "reviews.date": "2016-08-05T00:00:00.000Z",
      "reviews.id": "b586bbae-f794-4ea5-83d4-17eda3f379c5",
      "reviews.rating": 5,
      "reviews.text": "The new design, compared to my old kindle paperwhite and voyage, looked weird when I first got my Kindle Oasis. After I used it for a while (5 hours), I felt the design was kind of make sense. When I hold it with one hand (right hand), the centre of gravity position was right in my hand, so there was less change that I drop the kindle on my face(when I was laying on my bed, it happened a lot with my kindle voyage)"
    },
    {
      "reviews.date": "2016-08-26T00:00:00.000Z",
      "reviews.id": "db21579b-4b84-42fd-a509-6b2e8d32d44c",
      "reviews.rating": 4,
      "reviews.text": "Excellent reader night or day, sunshine or shade. Not as full function as earlier kindels"
    },
    {
      "reviews.date": "2017-03-11T00:00:00.000Z",
      "reviews.id": "dbfe2a82-9392-46ea-ac3e-8e54b19b80ce",
      "reviews.rating": 4,
      "reviews.text": "This product may be extremely overpriced, but it also lives up to everything it's promised. It's a lightweight, long-lasting ereader that is much easier on the eyes than an iPad. It is much lighter and more ergonomical than a paperback, and I find myself renting kindle copies of books I already own just to take advantage of the device's convenience."
    },
    {
      "reviews.date": "2016-05-28T00:00:00.000Z",
      "reviews.id": "c53a3c09-ff5e-46c1-a5ad-3cb22a624406",
      "reviews.rating": 5,
      "reviews.text": "I purchased this as a gift for my wife and she loves it. She has an older Kindle, and she can't believe how much better the Oasis is."
    },
    {
      "reviews.date": "2016-05-27T00:00:00.000Z",
      "reviews.id": "cf1e20ef-1497-48f6-98df-7904f43c5993",
      "reviews.rating": 4,
      "reviews.text": "I was so looking forward to this that I bought it right when it popped up as available on Best Buy. This is obviously the most refined Kindle on the market as of now. The ergonomics are just perfect, as there is no other Kindle or any ebook reader for that matter that is as easy to use single handed as this one. Fits perfectly in the palm and the page turn buttons are a joy to use.The charging case can be removed while reading and it snaps back easily, you do not have to deliberately align it properly. Once the case is connected it starts charging the Kindle which prolongs its battery life.In short, if you are an avid reader and can spare $290, this is the Kindle to buy. For occasional readers it might not make sense to spend so much and the Kindle Paperwhite should do just fine."
    },
    {
      "reviews.date": "2016-06-01T00:00:00.000Z",
      "reviews.id": "3987a65b-31d5-4d59-a4be-4553360ceb82",
      "reviews.rating": 5,
      "reviews.text": "lightweight and convenient to use. love my new kindle"
    },
    {
      "reviews.date": "2016-07-02T00:00:00.000Z",
      "reviews.id": "d4bd08fb-91b5-4a8c-af40-9ce234364431",
      "reviews.rating": 4,
      "reviews.text": "I've been a kindle owner since the early days and when new versions have come out in the past, it was usually a no-brainier to upgrade. The oasis was a little challenging because the price really makes you stop and think if this upgrade is worth it. After a lot of thought, the factor that convinced me to switch was the reappearance of the page turning buttons. I missed them since they vanished with the kindle keyboard! The paper white and the voyage were great devices but I often accidentally changed pages if I accidentally pinched the bezel when carrying the device or even just shifting positions on the couch. The Oasis' buttons have removed that issue and I am delighted! The weight and thinness of the device are also appreciated tho the paper white etc are pretty thin already. The addition of the cover is interesting but after a month's use I think it's pretty clear the cover/battery is there only to boost the very short-lived battery in the kindle itself. \"Months\" of battery life just seems impossible unless you keep the screen at low illumination and only read a few minutes a day. The screen is clear and bright, I can't see any LED issues others have complained about and the interface does seem snappier than older versions. Ultimately the only real justification for buying this kindle is if you miss the page turn buttons and want to pay top dollar for them. Otherwise, the existing kindles will meet your needs."
    },
    {
      "reviews.date": "2016-12-07T00:00:00.000Z",
      "reviews.id": "c03ec241-8579-4950-a1b5-3c349dc825a7",
      "reviews.rating": 5,
      "reviews.text": "Bought for my wife to upgrade from the original Kindle that she has worn out. Big step up from the original and should be good for another 8-10 years."
    },
    {
      "reviews.date": "2017-02-24T00:00:00.000Z",
      "reviews.id": "64d2e399-c0a4-4ee4-bde1-e87dbf1cdb64",
      "reviews.rating": 5,
      "reviews.text": "Great ebook for a beginner. Light and good looking"
    },
    {
      "reviews.date": "2016-09-16T00:00:00.000Z",
      "reviews.id": "75c5c63b-3362-4c51-88d9-b85721703e38",
      "reviews.rating": 5,
      "reviews.text": "New to eBooks and researched available eReaders and tablets. What I like best about the OASIS is the weight (lightest on the market), battery life (measured in weeks not hours) and the capability to use it in bright sunlight. Recommend it for all."
    },
    {
      "reviews.date": "2017-06-03T00:00:00.000Z",
      "reviews.id": "5993ed37-5581-4ba2-8d80-05a40a07aa1e",
      "reviews.rating": 5,
      "reviews.text": "The new Kindle is a great gift and fantastic entertainment idea."
    },
    {
      "reviews.date": "2016-11-11T00:00:00.000Z",
      "reviews.id": "9966bcea-fbaf-4584-bf72-8f28b0e4c7b7",
      "reviews.rating": 4,
      "reviews.text": "Great for reading in the sunlight. As well as light, and easy on the wrist. Great product, but a little speedy."
    },
    {
      "reviews.date": "2017-03-15T00:00:00.000Z",
      "reviews.id": "04b58b08-95a5-44cd-afff-46aebd7f8c80",
      "reviews.rating": 5,
      "reviews.text": "Great item! Would definitely recommend this item -- am still learning all the things about it."
    },
    {
      "reviews.date": "2017-06-16T00:00:00.000Z",
      "reviews.id": "4e86b66b-2f40-4bfb-a252-ff817497c101",
      "reviews.rating": 4,
      "reviews.text": "This kindle is awesome. I love the design of it. Nothing software wise that was different than my other kindle but the way it's designed makes it much more comfortable and easier to read. The only reason I didn't give it five stars was because of the price. If it were cheaper, this kindle would have been five stars no doubt."
    },
    {
      "reviews.date": "2016-04-28T00:00:00.000Z",
      "reviews.id": "f2263b30-939e-45f9-8a08-7e80ebf93f4d",
      "reviews.rating": 5,
      "reviews.text": "BestBuy delivered this on the day of release. Amazon still seems to be back-ordered. It is a great product. Nice and light with uniform screen and snappy performance."
    },
    {
      "reviews.date": "2017-05-17T00:00:00.000Z",
      "reviews.id": "1f91d955-3ced-4c44-8910-cdd15c93567e",
      "reviews.rating": 5,
      "reviews.text": "Met all my expectations! Lightweight and compact. I enjoy using the product."
    },
    {
      "reviews.date": "2016-11-25T00:00:00.000Z",
      "reviews.id": "0275d4c3-33b8-422d-83e5-5a8fbf2ae913",
      "reviews.rating": 5,
      "reviews.text": "Wife love it, reads a lot and this is her go to reader."
    },
    {
      "reviews.date": "2017-03-10T00:00:00.000Z",
      "reviews.id": "26b3714a-1378-4dbc-9bef-1afb16d32920",
      "reviews.rating": 5,
      "reviews.text": "Upgraded from my old Kindle keyboard. I love the ability to adjust brightness and font. I have small hands and this is not too big to hold in one hand. I was able to change the page turning buttons for left handed use. The charging cover last a long time. I wish there were more colors to choose from."
    },
    {
      "reviews.date": "2017-06-21T00:00:00.000Z",
      "reviews.id": "66c02c7d-d50e-4341-b22e-75444aa27b1b",
      "reviews.rating": 5,
      "reviews.text": "Replacing older reader without a light and traveling overseas soon. With electronics in the cabin under scrutiny, this very small and very lightweight reader fits the bill! Perfect in small purses and large pockets. I can read without annoying seatmate with cabin overhead seat light. Easy to hold in either hand and screen adjusts for whichever direction you're holding it."
    },
    {
      "reviews.date": "2017-03-09T00:00:00.000Z",
      "reviews.id": "7a0e027e-3161-46c3-a63f-502889352aef",
      "reviews.rating": 1,
      "reviews.text": "This is not an upgrade by any means! My three year old kindle outperformed Oasis.Battery life better than a week with the lights on lowest setting Magnetic connector is poorly designed and grows weak Two pieces to keep up with; unsnaps constantly Amazon Customer Services promises it will resolved in an update"
    },
    {
      "reviews.date": "2017-07-19T00:00:00.000Z",
      "reviews.id": "10685112-1344-42fb-914e-028f410dd1e4",
      "reviews.rating": 4,
      "reviews.text": "I bought the Kindle Oasis for my wife as a 37th-anniversary gift. She enjoys reading and I thought that being able to adjust the text size would be very nice. She tried it for a few days and didn't care for it. She writes notes in the margins and wasn't happy with the way the Kindle did its notes. For just reading I think it would be a very nice product."
    },
    {
      "reviews.date": "2017-06-30T00:00:00.000Z",
      "reviews.id": "cb136b97-0412-410c-88d0-b02cb0a34f2e",
      "reviews.rating": 5,
      "reviews.text": "I like this so much more than the Voyage. The shape makes for easier holding. I only wish this devise was maybe 2 inches taller then it would look like a real book"
    },
    {
      "reviews.date": "2017-03-17T00:00:00.000Z",
      "reviews.id": "0753bab5-a8a0-4a2d-98b5-6cf94fb7f17c",
      "reviews.rating": 5,
      "reviews.text": "I started to buy the Voyage but when I saw how close the price was to the Oasis, I decided to go ahead and buy the Oasis. So glad I did! I love the case and the physical buttons to turn the page. It is so lightweight and I love the option of the screen rotating whenI need to change hands. Awesome device!"
    },
    {
      "reviews.date": "2016-06-18T00:00:00.000Z",
      "reviews.id": "2254ff0f-4056-4a48-8a71-b4c8e6eb2168",
      "reviews.rating": 4,
      "reviews.text": "I would definitely buy it again, but it does not have the ambient light sensor like the cheaper voyage does to turn the brightness up and down automatically in the dark or sun. For a product of this price, it shouldn't be missing any features. Otherwise it is great, light, and the text refreshes quickly and is crisp."
    },
    {
      "reviews.date": "2016-05-23T00:00:00.000Z",
      "reviews.id": "e678b9b0-e74e-418b-9c9e-75411beb7972",
      "reviews.rating": 5,
      "reviews.text": "When they first announced the Kindle Oasis, I did not have much of a desire to upgrade from my 1st generation Kindle Paperwhite. Just as I felt when they announced the Voyage.I read a lot, so my Kindle travels with me throughout the day most of the time. I have never had an issue with battery life, I have only had it get really low a few times (typically when I was traveling). So again, I originally did not see a lot of the value to the Oasis.As the reviews for the Oasis came out, I started to realize what I did not like about my Paperwhite, and I began to have an interest in upgrading my Paperwhite to the either the Oasis or possibly the Voyage. The main thing I noticed is that I took my Paperwhite out of the Amazon case quite a lot, especially when I was in a seated position. This slight reduction in weight made it much more comfortable to hold for longer reading sessions. I had some other minor issues with my Paperwhite, like when reading in the dark, I couldn't find an adjustment for the light that I preferred (5 was a little too dim and 6 was a brighter than I needed). I decided to pass on the Voyage because I really did not like the case options and the pressure sensitive page turn option.Now that I have the Oasis, I definitely think it was worth it for me. I really appreciate the reduced weight when the cover is off (not to mention the ease of removing the cover compared to the Paperwhite). It provides the same reading experience, although I did get a resolution upgrade compared to my older Paperwhite, which is a plus.The Oasis is really comfortable in my hand, which helps me forget that it is there. When I was holding my Paperwhite with my left hand, at times I would accidentally go back a page, which drove me crazy even though its just a minor inconvenience.I have the black model because it was the only option available unless I was willing to wait a few more months. The build quality of the Oasis and its case is very nice, just like with the Paperwhite and the amazon leather case for it. The only concern I have is how well it will protect the Kindle. I will update the review if I find this to be a problem.I loved my Paperwhite, and I will recommend it to anyone looking to upgrade from an older Kindle or buying one for the first time. It definitely is great and the better buy, but I am glad I decided to order the Oasis. The reduced weight, ergonomic design, and page turn buttons make it worth the added cost."
    },
    {
      "reviews.date": "2016-06-05T00:00:00.000Z",
      "reviews.id": "13448c76-cbed-46e3-9a91-eda796acd3d8",
      "reviews.rating": 3,
      "reviews.text": "Th size difference is noticeable and squarish rather then rectangular, which I prefer. The Kindle unit itself is rather nice, the auto rotate and adjust being the best part. I returned this item b/c the cover is flimsy. and I was afraid I would drop it and break the kindle."
    },
    {
      "reviews.date": "2017-01-30T00:00:00.000Z",
      "reviews.id": "cdb37e29-837d-4324-83fc-f2fc3f87d025",
      "reviews.rating": 5,
      "reviews.text": "With the cover attached, the battery lasts for a good, long period. With the cover detached (which is how I use it primarily), the Oasis is so thin that it is almost weightless in your hand. The ability to switch hands (flip upside down) means one never seems to tire of holding the device to read a book; and, it fits into my pants pocket, again, perfect for traveling. The battery seems to last with heavy usage for at least several days, but I tend to reconnect the cover at night (I am assuming that helps to recharge the basic Oasis battery). Regardless, it was well worth replacing our older Kindle readers with the newer Oasis (we bought two)."
    },
    {
      "reviews.date": "2016-12-10T00:00:00.000Z",
      "reviews.id": "fb875338-e457-492d-9666-2992f8409a6f",
      "reviews.rating": 5,
      "reviews.text": "Even when I‚Äôm outside in bright sunlight, the words of the book I‚Äôm reading are still crystal clear. That alone makes the Kindle Oasis worth what it cost me.The Kindle Oasis wakes up in just seconds, and any book I choose instantly opens, ready to be read.It is the perfect size and isn‚Äôt heavy or bulky. I really do read for hours at a time. Sometimes I pace the floor while I read. Sometimes I‚Äôm on my elliptical machine when I read. And sometimes I‚Äôm sitting down. No matter what I‚Äôm doing, the Kindle Oasis remains comfortable to hold, and it is always easy on my eyes.When I receive a book that is in PDF, most of the time I can enlarge the words. If it won‚Äôt allow me to enlarge the words, I can change the orientation of the page and the words are automatically larger. I am able to make notes on the book if needed, and I can highlight words and/or passages.My merlot leather cover is attractive. When I flip it open, it is just like opening the cover of a book.How to Make the Battery LastOn the Kindle Oasis page, it says that its ‚Äúdual-battery charging system delivers months of battery life.‚Äù This was a huge thing for me. Instead of having to charge my tablet almost every day, I would be able to read for months without charging the Kindle!Is this how my Oasis has performed? Well, not so much. There are conditions that have to be met for the charge on your Oasis to last for two months.First, you have to limit your reading to thirty minutes a day. That one is impossible for me. There are days that I am only able to read for thirty minutes, but they don‚Äôt occur very often. My Kindle goes everywhere with me, and I use just about every spare moment to read.Second, the wireless needs to be turned off. That one is easy to do but not always easy to remember. The only time the wireless needs to be on is to download one or more books.Third, this is based on your light setting at 10. That is way too low for me. I keep my light setting anywhere from 16 to 18.I don‚Äôt limit my reading to thirty minutes a day, and I try to remember to keep my wireless turned off. My light setting is kept anywhere from 16 to 18, and I put my Kindle to sleep the second I‚Äôm done reading. So how long does a single charge last me? Ten days is the longest a charge has lasted me so far, but it would have kept a charge for several more days if I had remembered to turn my wireless off. Once I succeed in keeping my wireless off, I will let you know how long the charge lasts.Now, I don‚Äôt plug it in to charge as soon as the charge on the cover gets low. I allow my cover charge to go as low as it will possibly go and then the Kindle battery will start to drain since it can no longer charge from the cover. I allow it to drain down to about 50% before I plug the cover and Kindle into my computer to charge.The one thing that surprised me was that everything on the Oasis is in black and white. For some reason, I thought that maybe the book covers would appear in color. But since I bought the Oasis to read books on, color isn‚Äôt needed.Special offers do appear on my screen but only when my Kindle is going to sleep or waking up. They aren‚Äôt a distraction, and to be honest, they are kind of fun to look at. You can pay a higher price so they won‚Äôt appear on your Kindle if you would rather not see them.I asked myself some questions once I had my Kindle and knew just how it worked. If I had known before I bought my Kindle Oasis that the charge wouldn‚Äôt last for months, would I still have bought it? Yes, I would have. If I had known that everything would appear in black and white, would I still have bought it? Yes, I would have."
    },
    {
      "reviews.date": "2016-04-28T00:00:00.000Z",
      "reviews.id": "01ff63e2-4e4c-4136-b354-9aed121e476b",
      "reviews.rating": 5,
      "reviews.text": "Despite not being able to get one of these from Amazon until late June due to apparent strong demand, Best Buy was able to get one to me on the day of its release, April 27. Well done Best Buy! Having owned several previous Kindles, including the most recent Paperwhite model, I was unprepared for how small and light this new Oasis model is -- reading about it is one thing, but actually holding one in your hand is something else entirely. The Oasis and its battery-charging cover together weigh only one ounce more than the latest Paperwhite with no case. The Oasis _without_ its cover feels impossibly light at 4.6 ounces. Size-wise, the Oasis is nearly a square shape at about 5\" wide by 5.5\" tall. In fact, the shape is so different from traditional Kindle designs that I had to compare it next to my Paperwhite to verify that the screens are actually the same size (they are). It's the first Kindle I think I could easily fit into a jacket pocket without any effort, For frequent travelers like me, this is a key reason to buy one of these, as it's extremely compact and easy to pack in a briefcase or purse. The screen is the first front-lit Kindle I've ever seen where you simply cannot see any trace of the LEDs from any angle. No dark spots, no bright spots...just a completely uniform illumination from edge to edge in both directions. The \"page\" also appears to be nearly flush with the top glass surface, helping achieve the illusion of printed paper. It's sharp and clear, better than any Kindle I've used. The reader can be easily separated from the battery case by simply pulling them apart, since they are held together with magnets. After doing so, this is where the Amazon engineering team's achievements really become clear, as you just won't believe how lightweight this thing is. It's easy to imagine holding onto it for hours without any arm fatigue, and switching from hand to hand is a simple matter of rotating it 180 degrees when switching. The display instantly rotates, and the page turn buttons also \"follow\", with the top button always used to advance the page, and the bottom button always used to go backward. You can also use the screen to change pages as you always have with earlier touch screen models. The battery on the reader has a lower capacity than the cover's battery, so it runs down faster if you don't have it connected to the case. It's very easy to snap the reader back into its cover, which allows it to recharge while you continue to read. The power button and charge port are located in the upper top-right corner, more or less opposite from where they are on the Paperwhite. I find this location to be less awkward, as it's easier to reach on the top than it is on the bottom edge. The back surface of the reader (not the case) seems to easily attract fingerprints, and they are not so easy to clean off. You'd think that Amazon would have figured out a way to prevent this by now. It's a minor annoyance. Lots of reviewers in the tech press have complained loudly about this model's high price relative to other Kindle models (without ads, it's $310 vs. $139 for an ad-less Paperwhite). Is this a lot of money? Perhaps, but if you are a book addict and value an extremely lightweight reader that's easy on both your arms and your eyes, then I personally think it's worth it. A lot of thought and effort clearly went into designing and building this unit, and the price reflects that. Is it for everyone? Probably not, but there is obviously a market for it when you consider how many months you'll have to wait to get one on Amazon's website. If you are a serious reader, this device deserves a very close look -- I'm definitely keeping mine!"
    },
    {
      "reviews.date": "2017-02-24T00:00:00.000Z",
      "reviews.id": "7bcfbd87-6af6-46c7-b26e-55d5c4715d12",
      "reviews.rating": 5,
      "reviews.text": "I have had a Kindle for some time and was curious about the Oasis. It did not disappoint. It is very compact, even with the cover, and fits in a coat pocket. I really enjoy the size and the redesign which brings back hard buttons. Great device for home or on the go."
    },
    {
      "reviews.date": "2016-09-09T00:00:00.000Z",
      "reviews.id": "de588118-4023-4857-9146-457dae0bc261",
      "reviews.rating": 5,
      "reviews.text": "I am a book addict and this is my 4th kindle device. This is by far the best one. It is so compact it is almost smaller than my large wallet. Can fit anywhere. Holds a charge incredibly well and very nice display to make reading fun."
    },
    {
      "reviews.date": "2017-02-03T00:00:00.000Z",
      "reviews.id": "c56e510e-57e9-40d4-a6e9-b65d29082050",
      "reviews.rating": 5,
      "reviews.text": "Small, light, but comfortable to hold with either hand. If you keep it in airplane mode with medium lighting, the battery last for weeks. Lovin' it so far."
    },
    {
      "reviews.date": "2016-05-10T00:00:00.000Z",
      "reviews.id": "a4d9e293-8a33-4b3b-9115-0cf8d26747ac",
      "reviews.rating": 5,
      "reviews.text": "'ve owned the Kindle Keyboard, 2nd generation Paperwhite and now the Oasis. I love the Oasis very much. The ergonomic design is wonderful and makes it a breeze to hold. It is so light -- that is the biggest killer feature of the Oasis. The 10 LEDs look fantastic and I love the return of page buttons. I've never had one where the screen is flush with the bezel so this is great. All in all, this is easily the best Kindle ever made and even though it's a bit spendy, it will be the one future Kindles are measured against."
    },
    {
      "reviews.date": "2016-05-27T00:00:00.000Z",
      "reviews.id": "97846d4c-0ed0-4c68-992e-698d46269a2f",
      "reviews.rating": 5,
      "reviews.text": "Actually easier to hold than a paperback, and might even be lighter!"
    },
    {
      "reviews.date": "2016-12-31T00:00:00.000Z",
      "reviews.id": "466e1ba4-70ce-48c8-b317-c44ea012b274",
      "reviews.rating": 2,
      "reviews.text": "Easy to carry in purse or pocket but doesn't do anything better than the cheapest Kindle reader."
    },
    {
      "reviews.date": "2017-02-24T00:00:00.000Z",
      "reviews.id": "46911914-80c4-44d2-8107-53298f920067",
      "reviews.rating": 5,
      "reviews.text": "Battery life is unreal! So much faster than my old kindle."
    },
    {
      "reviews.date": "2017-06-17T00:00:00.000Z",
      "reviews.id": "d26ace29-4e17-42c9-b08d-990e8735a773",
      "reviews.rating": 4,
      "reviews.text": "This is my first e-reader. I didn't know about the odd refresh and it took a little while to get used to but I do love how small and light it is and that I do not have to remember to plug it in everyday"
    },
    {
      "reviews.date": "2016-04-28T00:00:00.000Z",
      "reviews.id": "186e2f24-c085-4b8e-91e7-c139c6e92c42",
      "reviews.rating": 4,
      "reviews.text": "I got oasis yesterday, very lighweight compared to voyager, screen size comparable, like having actual page turn button, touchscreen seems kinda slow, the on/off button on top is improvement from back of voyager. cover does seem kind of flimsy, but supposed to be leather so will see how it holds up. finding it easier to hold with cover on, then removed. cover doesn't have separate charge port, so all charging is done thru kindle."
    },
    {
      "reviews.date": "2017-06-30T00:00:00.000Z",
      "reviews.id": "b578b342-a475-4f00-997f-3903f600c8f8",
      "reviews.rating": 5,
      "reviews.text": "Very lightweight and portable with excellent battery life."
    },
    {
      "reviews.date": "2017-02-18T00:00:00.000Z",
      "reviews.id": "59c629d0-b336-4d69-bad7-59554399700b",
      "reviews.rating": 5,
      "reviews.text": "This Kindle reader with cover attached is light weight and easy reading. Page turner is easy to use and it reverses so you can hold with either hand. I am very happy and satisfied with this product. Happy reading -"
    }
  ]
}