{
  "id": "AVwjfXp4QMlgsOJE8qmk",
  "dateAdded": "2017-05-20T01:34:04Z",
  "name": "All-New Fire HD 8 Kids Edition Tablet, 8 HD Display, 32 GB, Blue Kid-Proof Case",
  "asins": "B01J94SBEY",
  "brand": "Amazon",
  "categories": "Fire Tablets,Computers/Tablets & Networking,Walmart for Business,Tablets,Amazon Tablets,Tablets & E-readers,Kids' Tablets,Electronics,Computers & Tablets,Office Electronics,Amazon,Tablets & eBook Readers",
  "primaryCategories": "Electronics",
  "keys": "amazonfirehd8kidsedition8tablet32gb7thgeneration2017releaseblue/5836204,amazon/53005704,amazon/b01j94sbey,amazonfirehd8kidsedition8tablet32gb7thgeneration2017releaseblue/5836203,841667123134,amazonfirehd8kidsedition8tablet32gb7thgeneration2017releaseblue/5871317,allnewfirehd8kidseditiontablet8hddisplay32gbbluekidproofcase/b01j94sbey,amazonallnewfirehd8kidseditiontablet8hddisplay32gbbluekidproofcaseblueblue32gb150gbmediatekmt8163quadcore4core130ghzfireos51280x800/9sia22f6y93806,amazonallnewfirehd8832gbkidseditiontabletblue/5836203,amazonallnewfirehd8832gbkidseditiontabletblue/292182397045",
  "manufacturer": "Amazon",
  "reviews": [
    {
      "reviews.date": "2017-08-17T00:00:00.000Z",
      "reviews.id": "a8b7a578-f85f-498b-bd6e-9bbed94b1fab",
      "reviews.rating": 5,
      "reviews.text": "I have been wanting to get a tablet for my grandson. However his mother insisted on waiting till he was older. Recently he has been talking a lot more and my daughter said that if I wanted to buy the kids kindle for him. Its a great tool since he has the kindle unlimited free time he has learnered shapes, basic colors, words, puzzles, numbers, sorting, and even sequencing. Money well spent my grandson loves it."
    },
    {
      "reviews.date": "2018-04-15T00:00:00.000Z",
      "reviews.id": "755f6d8d-0c6d-49e7-b7ec-59582dec2e46",
      "reviews.rating": 5,
      "reviews.text": "A perfect tablet for kids. The parental controls allow only age appropriate content and are customizable without spending hours digging through the settings. It comes with a 2-year no questions asked ADH warranty from Amazon, making the geek squad protection on this device irrelevant. It also comes with a free, 1-year subscription to amazon kids allowing unlimited access to almost any children‚Äôs show and apps (that are normally paid for)."
    },
    {
      "reviews.date": "2017-07-19T00:00:00.000Z",
      "reviews.id": "6cc8e67e-2449-4b15-b8ad-9f5731e5f7ab",
      "reviews.rating": 5,
      "reviews.text": "Got this for my son he loves it. Very easy to use durable and with a two year no questions ask warranty can't beat it"
    },
    {
      "reviews.date": "2018-01-17T00:00:00.000Z",
      "reviews.id": "02a5d319-ff70-42b7-8832-ef281fcd064b",
      "reviews.rating": 5,
      "reviews.text": "I wish I would have bought this version earlier! Love the free play option as well."
    },
    {
      "reviews.date": "2017-06-27T00:00:00.000Z",
      "reviews.id": "76d97833-29b1-40c5-be91-787c0759b8f1",
      "reviews.rating": 2,
      "reviews.text": "The looks and the screen of Amazon - Fire HD 8 Kids Edition are good. The navigation is sluggish when compared to apple and Samsung. The touch screen is not very responsive. Camera is not so good. Amazon should have done much better job to make it a better product to compete with Samsung and apple. Hope Amazon makes improvements. The cost is low and appreciate that. I would not recommend to someone who is looking for good product. I cost is the factor you can live with it."
    },
    {
      "reviews.date": "2018-08-24T21:05:49.000Z",
      "reviews.id": "560259d5-e91a-4413-9358-726e333a72cb",
      "reviews.rating": 5,
      "reviews.text": "I love this tablet and so do my children! I have been wanting to get one for a couple years but never had any wifi to use it with all the features, and trust me i bought every other kids tablet there was along the way. My daughter will be 6 this year and this is easily her 10th tablet i got all the ones for kids with the pre loaded apps and learning games. From nabi to samsung kids tablets and everything in between. These are by far the best. Very easy to use and my daughter loves all the games on them she plays for hours and the battery lasts a long time too, all the other tablets battery would die after an hour! This one just keeps going! Even my 2 year old son cant get enough of the books and learning games. I also like that it comes with a free year of free time for kids and if it breaks for any reason within 2 years they will replace it. All the other tablets broke after only a year or less, just stop working or glitch out. Trust me this tablet us worth it! Give it a try! You wont be sorry."
    },
    {
      "reviews.date": "2018-01-05T00:00:00.000Z",
      "reviews.id": "307fa265-0473-4e4c-881e-9bcf17cb6b07",
      "reviews.rating": 5,
      "reviews.text": "The daughter was surprised with the speed and ability of the Fire HD 8.She spends a lot of time on it and the battery life is good for the size of it."
    },
    {
      "reviews.date": "2018-05-12T14:14:57.000Z",
      "reviews.id": "1cee1f48-abaa-4739-8932-8146473b57d7",
      "reviews.rating": 5,
      "reviews.text": "The Kindle Fire HD 8 edition is just like the adult version except it comes withOUT the special offers (ads). It also includes a two-year warranty, one year of FreeTime, a protective case, and can be bought locally at Target. PIN protected accounts can be set up for adults and children. The Kindle Fire is designed to consume content including accessing Amazon services and content. A library of apps, books, music, videos, and more is available at your fingertips! For the kids, content is appropriate for their age level and screen time can be set. It just works! If you want more than that, the additional desired options do not just work out of the box. I am an older, non-traditional college student with children and some difficulty seeing. I prefer to buy my textbooks or check out books from the local library in the Kindle Edition. There are a lot of advantages to eBooks including being able to enlarge the font, multi-media elements, built-in dictionary, ability to extract notes, and some have text-to-speech. There are also no books to return or mail back. The Kindle Edition format works better with the actual reader instead of just the apps on an iPad, iPhone, or even computer--I have all these too. I need to be able to create content too and apps that may not be available through Amazon app store. A quick web search led me to instructions to install the four necessary files to have Google Play on this device (software version 5.6.1.0) with no root needed from a reputable source. I was now able to add the Microsoft Office apps, YouTube, VLC, a virus scanner, and some other favorites through the Google Play app. The SD card can be used for movies or music too for on the go where access to Wi-Fi may not be available. This part was easy. These apps can be copied over to the children's profiles too. It was a bit more complicated to do this because of the number of steps involved, and it takes a little more time and patience. Bluetooth allowed me to connect a keyboard (can add separately or buy a case/keyboard combo like one made by Fintie named Blade X1) and a mouse too turning it into a lightweight, inexpensive, functional, and portable device great for classes or on the go at a fraction of the cost for the least expensive iPad with a case and keyboard. It is no powerhouse tablet though. However, it does work much better than my under-powered netbooks that run Windows. I only installed the essentials and close the apps I am not using. Unless your child is responsible and careful, I think the charging of the device by an adult would eliminate many of the issues I have seen about it."
    },
    {
      "reviews.date": "2017-11-15T00:00:00.000Z",
      "reviews.id": "78fa915c-a588-4789-a4d9-b3f20aa58297",
      "reviews.rating": 4,
      "reviews.text": "Bought for my 5year old daughter and it is perfect. You can set two profiles one as parent when has control over what apps can be made on your child's, also many free books instant download that is great for learning to read and even chapter books."
    },
    {
      "reviews.date": "2017-11-17T00:00:00.000Z",
      "reviews.id": "afa7c401-bd81-409f-a5ca-0f6c549d3d00",
      "reviews.rating": 5,
      "reviews.text": "This was for my granddaughter for her 6th birthday. She had quickly outgrown her other tablet although it was age appropriate. This tablet has enough storage space, especially when you add a micro-SD card, to allow downloading of apps. The operating system also permits downloading, which the earlier tablet did not permit. She is extremely happy with the Amazon Fire Tablet as is evidenced by the amount of time she spends using it."
    },
    {
      "reviews.date": "2018-02-04T00:00:00.000Z",
      "reviews.id": "4589a3ba-9295-4612-8b32-4f96d43c145d",
      "reviews.rating": 5,
      "reviews.text": "I‚Äôve purchased a total of 4 tables from Best Buy in the past and thanks to God no issues!!!"
    },
    {
      "reviews.date": "2018-01-13T00:00:00.000Z",
      "reviews.id": "82ee0dcc-c39a-4a9c-b325-c72912366778",
      "reviews.rating": 5,
      "reviews.text": "bought on sale. amazing value of device + kids content + 2 year full warranty.one caveat : when traveling outside the USA most of the content does not play."
    },
    {
      "reviews.date": "2018-03-23T00:00:00.000Z",
      "reviews.id": "b49d905c-b985-49c6-a1cc-80da8fe4065a",
      "reviews.rating": 5,
      "reviews.text": "Was iffy at first. But so glad a I got my kids these pads"
    },
    {
      "reviews.date": "2017-09-01T00:00:00.000Z",
      "reviews.id": "e1b54f22-1ffe-4d91-9833-e5337d8da5b5",
      "reviews.rating": 4,
      "reviews.text": "My sons face lit up the day he saw this and it has been his best friend ever since. I'm so happy we bought this item."
    },
    {
      "reviews.date": "2017-07-14T00:00:00.000Z",
      "reviews.id": "e7557096-5967-4765-abef-f76c927d6da3",
      "reviews.rating": 4,
      "reviews.text": "There are better tablets out there, but not at this price point, and if you are a prime member it's a no brainer!"
    },
    {
      "reviews.date": "2017-06-23T00:00:00.000Z",
      "reviews.id": "600bd6a1-8c41-4f8d-9478-70847bd4772c",
      "reviews.rating": 5,
      "reviews.text": "Excellent kids tablet good for reading and videos. Very easy to set up."
    },
    {
      "reviews.date": "2017-12-01T00:00:00.000Z",
      "reviews.id": "9318434e-f4c9-4a4e-bb5a-10250c1b74fe",
      "reviews.rating": 5,
      "reviews.text": "I am 100% an apple person. I was always hating on Kindles due to them having a very limited AppStore. Once I found out how to get the google play store on the device, I fell in love. The kid version is 100% worth the extra money. It isn‚Äôt just the case that makes it more money, it comes with a year of freetime, which features awesome child appropriate shows, videos and apps. It also includes the two year worry free warranty! It is the only type of tablet I will be purchasing in the future. With iPads, you‚Äôre constantly terrified of them being dropped and cracking. Even if these crack, at least you have the warranty with no ridiculous deductible!"
    },
    {
      "reviews.date": "2017-12-03T00:00:00.000Z",
      "reviews.id": "6ad64978-5afe-4338-8ab4-145f42a8c42f",
      "reviews.rating": 5,
      "reviews.text": "Awesome product for kids who are looking to learn more"
    },
    {
      "reviews.date": "2018-03-01T17:57:40.000Z",
      "reviews.id": "5418b330-81fc-40fb-b2d5-7503e4e2cb50",
      "reviews.rating": 5,
      "reviews.text": "Great value. I have a 5 year old and a 2 year old so I needed a tablet that was indestructible. This tablet is extremely durable, fairly quick and the 1 year of Amazon Freetime is nice. You cannot break this tablet especially with the thick foam case that comes with it. If you want a tablet for your little ones that is indestructible, affordable, educational and has great parental features then this is what you are looking for. The only downside is the screen brightness could be a lot brighter."
    },
    {
      "reviews.date": "2017-12-01T00:00:00.000Z",
      "reviews.id": "604b240b-6153-4694-b0a5-0388fb6ca127",
      "reviews.rating": 5,
      "reviews.text": "My daughter loves her tablet she takes it every where with her."
    },
    {
      "reviews.date": "2017-09-20T00:00:00.000Z",
      "reviews.id": "59fe3258-5fe0-431e-8742-be464c68bdf1",
      "reviews.rating": 5,
      "reviews.text": "My grandchildren loved getting the kindle fire for their birthday. Tons of application and learning application make for hours of fun for the whole family."
    },
    {
      "reviews.date": "2017-07-22T00:00:00.000Z",
      "reviews.id": "034f94de-6cff-45ee-b23f-6fd3e9376143",
      "reviews.rating": 5,
      "reviews.text": "We have had a number of tablets but non of them have been as user friendly as this one. My son loves it and it is super easy for him to find his apps."
    },
    {
      "reviews.date": "2018-05-21T00:00:00.000Z",
      "reviews.id": "c767727e-16ad-43e1-ab4e-3abc98db2f27",
      "reviews.rating": 5,
      "reviews.text": "My soon to be wife and I decided to buy the tablet for our nephew for his birthday and he's in love with it. He's able to watch youtube and play games on it, doesn't hiccup or lag at all. A huge plus for me is the protective case it came with. With it being on sale at the time for around $100 for a 32GB tablet - that was a no brainer. Definitely worth every penny."
    },
    {
      "reviews.date": "2018-04-19T00:00:00.000Z",
      "reviews.id": "96e1c619-0879-4357-9ed1-fd975c7f1f51",
      "reviews.rating": 5,
      "reviews.text": "Our 1 1/2 year old daughter loves this one and she is very delighted with this one"
    },
    {
      "reviews.date": "2018-09-10T00:32:46.000Z",
      "reviews.id": "177ecd16-e5df-40d8-ac5d-df32a7fdf910",
      "reviews.rating": 5,
      "reviews.text": "I love this tablet!! I love that I can set limits for my daughter. She loves the tablet enjoys every single app on it"
    },
    {
      "reviews.date": "2017-10-20T00:00:00.000Z",
      "reviews.id": "903782e7-0712-41a3-8bcd-7527c56dac5b",
      "reviews.rating": 5,
      "reviews.text": "Portable, durable, strong battery life and it came with 13k in education programs. Both children are proud and showing do much responsibility by taking care of there tablet. They have designed their own schedule. Am very happy for them both. Best investment ever."
    },
    {
      "reviews.date": "2017-07-16T21:39:24.000Z",
      "reviews.id": "43bac7e0-af2b-4d7e-872c-74d39e497fe4",
      "reviews.rating": 5,
      "reviews.text": "I give this as many stars as possible, I recently bought this tablet for my kids to share which I can create their own profile with each their own apps. I also have a parent profile which allows me to download apps for my kids which syncs to their profile . I can view which apps they've used and how long they been on the tablet for . I can also time the tablet for them since I don't want them stuck on the tablet all day. It's just like a regular tablet with YouTube and Web . Except it's so much easier for kids to use ! And comes with a kid friendly case ! Think of it like a cellphone that you let your kids borrow while you get things done around the house , except kids probably click on something else by accident and takes them to an ad which kids hate and mostly throw the phone to the floor . Well this tablet shows the apps, movies and books making it easier for kids to handle without worrying about them clicking something else by accident .It also blocks ads from the applications/games and doesn't let them click on tokens you can purchase with debit card etc.. This has such great quality videos! Very fast and a great amount of volume !!! I love this tablet and recommend it to anyone that has kids !!!"
    },
    {
      "reviews.date": "2018-01-18T00:00:00.000Z",
      "reviews.id": "2352b614-4285-412d-ab2d-33c70681f273",
      "reviews.rating": 4,
      "reviews.text": "I bought this tablet for my 3rd grader, she loves it! She will be on it for hours at a time, there's a feature that allows me to put time limits which I love. Reason I gave it 4 stars is because sometimes the filtered content doesn't have a lot of options. However, I would buy again."
    },
    {
      "reviews.date": "2017-11-19T00:00:00.000Z",
      "reviews.id": "b994b9a2-6a74-4557-989c-b1fd2ac7f1fb",
      "reviews.rating": 5,
      "reviews.text": "I was able to upgrade from the 7\" tablet to the 8\" and my kids love it. The best part of it is the durable case! When I went in to the store to exchange it (the SD card slot was no longer picking up the SD card), I took it out of the case and was so surprised at how it had no dents and stuff marks. It looked brand new after 2 years (I purchased a screen protector). Would recommend to kids of any age."
    },
    {
      "reviews.date": "2018-05-16T00:00:00.000Z",
      "reviews.id": "039a8627-b490-4f20-ae1c-1ef4f0e4b975",
      "reviews.rating": 5,
      "reviews.text": "Very happy with this purchase..thw kid has dropped it no less than 39383 times and no screen cracks"
    },
    {
      "reviews.date": "2018-01-06T00:00:00.000Z",
      "reviews.id": "78100ad3-18ca-478a-91d5-cdfd92e2a0fd",
      "reviews.rating": 5,
      "reviews.text": "My 8 year old grandson absolutely loves this tablet so glad we purchased it!!!!"
    },
    {
      "reviews.date": "2018-05-20T00:00:00.000Z",
      "reviews.id": "5652e369-6f47-4a85-b7a4-b6487953f420",
      "reviews.rating": 5,
      "reviews.text": "I like that it can be used as a regular tablet but also have a separate account for my niece where she can‚Äôt get into anything crazy."
    },
    {
      "reviews.date": "2017-11-03T00:00:00.000Z",
      "reviews.id": "ba3189bd-848a-4be9-8389-48880598a081",
      "reviews.rating": 2,
      "reviews.text": "I have always bought nabi's they have lasted for a couple of years with my grandkids This item I bought for my six year old grandson as an upgrade (his nabi lasted 26 months) This broke in two days after giving it to him, It would not charge and the LCD went out . I am now having to jump through hoops to get it replaced ."
    },
    {
      "reviews.date": "2018-05-18T00:00:00.000Z",
      "reviews.id": "e17f350b-1c30-44da-8b60-d03d64af2380",
      "reviews.rating": 4,
      "reviews.text": "Love the ease of using parental controls and adding new programming. And Grandson loves it."
    },
    {
      "reviews.date": "2017-12-02T00:00:00.000Z",
      "reviews.id": "a49448a2-523c-42f5-9143-edda4ca5628b",
      "reviews.rating": 5,
      "reviews.text": "I got 3 for my kids for Christmas which they have yet to be open but got them on black Friday so the price was right"
    },
    {
      "reviews.date": "2017-11-16T00:00:00.000Z",
      "reviews.id": "c8106be4-8ce3-4398-a42b-a1dcea1d0a2b",
      "reviews.rating": 4,
      "reviews.text": "This item was for my 5 year old he loves it he's able to rent books from library surf web and play games a parents dream"
    },
    {
      "reviews.date": "2018-01-21T00:00:00.000Z",
      "reviews.id": "2d2c08af-4e6c-4887-8a08-3d29ec673d50",
      "reviews.rating": 5,
      "reviews.text": "Purchased for my daughter. She loves it. $129.99 and even got a price adjustment once it went it sale."
    },
    {
      "reviews.date": "2017-12-20T00:00:00.000Z",
      "reviews.id": "ae74ab29-de08-414f-af47-477f7003667e",
      "reviews.rating": 3,
      "reviews.text": "Tablet works as expected, Apple warranty is a joke. Read the fine print, they don't cover most problems with the tablet. Learned this the hard way"
    },
    {
      "reviews.date": "2018-08-28T14:59:54.000Z",
      "reviews.id": "53fcfcb8-43b8-40f0-9e03-80d76847a92f",
      "reviews.rating": 4,
      "reviews.text": "I bought this tablet to download videos from youtube red and to be able to take the tablet everyone we travel to play the videos. But unfortunately this tablet model does not support youtube red and it definitely doesn't work without wifi. So that was a fail! I'm gonna need to figure out how to download stuff so we can run the tablet without being connected to wifi. Other then that it's good for your little ones older then 3 or 4 years of age. It's big so they might have trouble holding it up but if they sit down with it then all the apps help promotes them to keep engaged and interested to sit still. Great case protector!"
    },
    {
      "reviews.date": "2017-12-25T14:25:58.000Z",
      "reviews.id": "2ccae835-68bf-4e96-8bd0-cdd1d9c419a4",
      "reviews.rating": 1,
      "reviews.text": "I'm sure its a great product but there was something wrong with the one I ordered on target.com. My daughter opened it on Christmas morning and was so excited. We went to charge it and it wouldn't turn on. We tried holding the power button down for 40 seconds like the amazon website suggests, nothing, we left it charging for hours and still nothing. Very disappointed."
    },
    {
      "reviews.date": "2018-01-18T00:00:00.000Z",
      "reviews.id": "bcc6a629-26f3-4457-b01d-74d330c71ab6",
      "reviews.rating": 4,
      "reviews.text": "Love how durable this is. Works fast and makes gameplay fun. Wish Google play was on this."
    },
    {
      "reviews.date": "2017-07-27T00:00:00.000Z",
      "reviews.id": "395db335-0f64-43e1-bb7c-78cc1cb2664b",
      "reviews.rating": 5,
      "reviews.text": "My three year old daughter loves this. It pairs nicely with our Amazon account and allows her to see our full video library. Storage is expandable. Guaranteed from breakage. Works well as and iPad alternative for the adults too."
    },
    {
      "reviews.date": "2018-05-18T00:00:00.000Z",
      "reviews.id": "5c38f756-f68e-4af2-b1c8-776285bd9aae",
      "reviews.rating": 5,
      "reviews.text": "Bought this for my 1year 7 months he loves it so much"
    },
    {
      "reviews.date": "2018-03-20T00:00:00.000Z",
      "reviews.id": "9a5b26e4-599d-449a-876d-778fd57ce909",
      "reviews.rating": 4,
      "reviews.text": "nice size tablet with a good protective case that is easy to hold onto"
    },
    {
      "reviews.date": "2017-12-21T00:00:00.000Z",
      "reviews.id": "53269893-b3ab-4c42-8bf9-85310b67ad49",
      "reviews.rating": 5,
      "reviews.text": "The item is excellent, the price, the store, and the agents that assisted me"
    },
    {
      "reviews.date": "2017-12-21T00:00:00.000Z",
      "reviews.id": "3aacb7b4-13b2-4655-8558-d349fd20feb0",
      "reviews.rating": 5,
      "reviews.text": "The item was excellent ,best price,best cost and best store"
    },
    {
      "reviews.date": "2017-07-09T00:00:00.000Z",
      "reviews.id": "f791c74d-db4b-487e-84df-a9751d76f4f2",
      "reviews.rating": 5,
      "reviews.text": "I was contemplating if I should me buy the regular tablet or the specific one for kids. And I recommend if it's going to be used by kids a lot, better buy the kids version. You get 1 year subscription of unlimited entertainment and learning stuff and many of the best stuff is already available. No need to go to the app site and think of what to download. It's a major benefit."
    },
    {
      "reviews.date": "2017-09-17T00:00:00.000Z",
      "reviews.id": "ca148c08-1085-4be3-abfc-dc645e6c58e2",
      "reviews.rating": 5,
      "reviews.text": "We chose this tablet specifically for the parental controls and it does not disappoint. I really appreciate the fact that I don't have to worry about the kids getting into and changing settings or coming across inappropriate content. Normally we choose apple products so I was a little worried about this platform but I'm thrilled with this purchase."
    },
    {
      "reviews.date": "2017-12-22T00:00:00.000Z",
      "reviews.id": "fb9022dd-be7f-4f11-9cc2-bc6c6d04951b",
      "reviews.rating": 5,
      "reviews.text": "We were shopping for a tablet for our 7 year-old daughter. We checked out numerous tablets but ultimately chose the Kindle based on the ability to control it very easily."
    },
    {
      "reviews.date": "2018-04-18T00:00:00.000Z",
      "reviews.id": "756bfd0c-3fbf-4451-9211-68a989f5aebd",
      "reviews.rating": 5,
      "reviews.text": "Bought this for trip, works great long battery life with lots of apps for the kids."
    },
    {
      "reviews.date": "2017-12-03T00:00:00.000Z",
      "reviews.id": "bdf247cb-2db9-499c-86fd-9b4c9036eb89",
      "reviews.rating": 5,
      "reviews.text": "Great app selection. Parental controls are easy to set up to prevent unwanted purchases. The fact that the bumper is already included is a plus and protects it well."
    },
    {
      "reviews.date": "2017-07-23T00:00:00.000Z",
      "reviews.id": "e79db2f2-21e3-42fb-8179-0824a3beddff",
      "reviews.rating": 5,
      "reviews.text": "I enjoy shopping at best buy stores. Best buy has the best prices and quality of merchandise."
    },
    {
      "reviews.date": "2018-01-20T00:00:00.000Z",
      "reviews.id": "a43a1424-fbe9-44da-9ee1-82499df93b8c",
      "reviews.rating": 5,
      "reviews.text": "Bought this for our 3.5 year old grandson. So far so good! Loves it!"
    },
    {
      "reviews.date": "2017-11-15T00:00:00.000Z",
      "reviews.id": "bfa11d8c-d839-46cc-a543-ffde2decc847",
      "reviews.rating": 5,
      "reviews.text": "I'm really impressed with Amazon products my son really happy.."
    },
    {
      "reviews.date": "2018-02-27T00:00:00.000Z",
      "reviews.id": "b6784964-703d-472f-b9c5-19b7f227e21f",
      "reviews.rating": 5,
      "reviews.text": "So my son broke my (his) old Samsung tablet that he'd been using for himself since his older brother had an iPad. I immediately thought of the fire kids edition and knew it would be good for him since it's still Android and since it's a very simple fix to get all of his favorite apps on it. A word of advice: Fire OS is very limited, but with a few downloads you can easily bypass the fire OS launcher and even install google services. Battery life is very good, and with the included case now I'm not afraid of another accidental drop. It can handle any of his kids games and with both the Amazon app store AND the play store the possibilities are endless."
    },
    {
      "reviews.date": "2018-01-03T17:04:39.000Z",
      "reviews.id": "8ca9bed9-750a-4224-9ef9-b42de71a4e93",
      "reviews.rating": 5,
      "reviews.text": "Love this tablet. I bought it while it was on sale 99 as a Christmas present for my 4 year old. Plus with my red card i saved an additional 5.. It is so nice and easy to use. I love the case it comes in too! My other son has an iPad mini I added to my phone plan, and i like this way better. It comes with apps, books, games and movies and is educational as well as fun. Very happy with this purchase would definitely recommend."
    },
    {
      "reviews.date": "2017-10-06T00:00:00.000Z",
      "reviews.id": "b789c285-80f6-478a-9be6-5f901c401ec4",
      "reviews.rating": 4,
      "reviews.text": "Easy to use for kids as a beginner. Plus it's already got a case on it!"
    },
    {
      "reviews.date": "2017-07-19T00:00:00.000Z",
      "reviews.id": "19a348bd-7c68-4c58-8e7d-87b0d5d95313",
      "reviews.rating": 4,
      "reviews.text": "Home screen and videos are confusing.But it works great.Love it."
    },
    {
      "reviews.date": "2018-01-05T00:00:00.000Z",
      "reviews.id": "ab5fd83e-98ba-4347-93de-ca2305b367fc",
      "reviews.rating": 5,
      "reviews.text": "The purchase of this tablet is sufficient for my granddaughters needs"
    },
    {
      "reviews.date": "2018-01-17T00:00:00.000Z",
      "reviews.id": "f0c6d4d5-eaed-4638-8c90-8e3a63f21f6c",
      "reviews.rating": 5,
      "reviews.text": "Excellent product would recommend it to all of my friends"
    },
    {
      "reviews.date": "2017-11-16T00:00:00.000Z",
      "reviews.id": "7000ad91-1f15-4d92-9ca0-a6645d504695",
      "reviews.rating": 4,
      "reviews.text": "My daughter loved her new tablet.. it was, what we expected."
    },
    {
      "reviews.date": "2017-10-06T00:00:00.000Z",
      "reviews.id": "72e142df-13f1-407d-add0-9b9176dc1297",
      "reviews.rating": 3,
      "reviews.text": "I bought 2 for my kids and got a great discount but the one my daughter uses has gave us a little trouble from the start"
    },
    {
      "reviews.date": "2018-01-20T00:00:00.000Z",
      "reviews.id": "d6beecfa-b1b3-4ff0-a9a5-6ccf0f2b7974",
      "reviews.rating": 5,
      "reviews.text": "My nephew is so happy to have his own tablet. Works pretty good."
    },
    {
      "reviews.date": "2017-11-27T00:00:00.000Z",
      "reviews.id": "babb99ca-a31e-4aba-93d7-7ee9a33d0705",
      "reviews.rating": 5,
      "reviews.text": "Excellent processing speed and best for kids.we can download and stream videos apps and can lock the contents that are not needed"
    },
    {
      "reviews.date": "2018-01-26T00:00:00.000Z",
      "reviews.id": "fca4d72c-5942-48f6-a483-30703f60de00",
      "reviews.rating": 4,
      "reviews.text": "Good for kids, it‚Äôs no iPad but can‚Äôt beat it for the price"
    },
    {
      "reviews.date": "2018-02-21T00:00:00.000Z",
      "reviews.id": "54e4a015-7a5b-41ea-bd6d-ba12e67dc791",
      "reviews.rating": 5,
      "reviews.text": "I bought for my 5 year old. Easy for her to use. Easy for me to track and control screen time."
    },
    {
      "reviews.date": "2018-03-21T00:00:00.000Z",
      "reviews.id": "cdb7c404-c89a-447f-a1a6-9627979a1496",
      "reviews.rating": 5,
      "reviews.text": "I purchase this for my granddaughter of 9 months. Love the games"
    },
    {
      "reviews.date": "2017-07-19T00:00:00.000Z",
      "reviews.id": "86f24b81-d4df-47d0-9fb5-0fdcf4b0cb80",
      "reviews.rating": 4,
      "reviews.text": "Easy to use even for my 3 yr old happy with how it has a lot of apps that are free same as Android to download. Good deal for the price. My son loves it."
    },
    {
      "reviews.date": "2018-01-13T00:00:00.000Z",
      "reviews.id": "6b089268-2be7-453b-9964-386c010567a0",
      "reviews.rating": 5,
      "reviews.text": "My sons first table since school is using apps now for supplemental math. He loves it and the child controls are great. Performance is solid, particularly for a grade school kid. The case and price point make this a great buy."
    },
    {
      "reviews.date": "2018-01-13T00:00:00.000Z",
      "reviews.id": "ff364d3e-e20d-492e-b465-e48da5534580",
      "reviews.rating": 3,
      "reviews.text": "This was not the best choice for my autistic son. We were unable to download anything from Google Play and were limited to the Amazon store. Making this a deal breaker for us. I had to return it and get a different tablet."
    },
    {
      "reviews.date": "2017-09-08T00:00:00.000Z",
      "reviews.id": "6909db65-e99d-4d0c-b565-714fe99bb0cd",
      "reviews.rating": 3,
      "reviews.text": "This is a pretty good tablet for kids, but the sound is way to low. Very difficult to hear."
    },
    {
      "reviews.date": "2018-01-26T00:00:00.000Z",
      "reviews.id": "b7801f49-4526-46e6-8c93-8ee78dfdbe79",
      "reviews.rating": 5,
      "reviews.text": "it was a gift for my grandaughter and she loves it"
    },
    {
      "reviews.date": "2017-12-20T00:00:00.000Z",
      "reviews.id": "0e940e84-9d3c-4bcf-98a9-f0a9270b4677",
      "reviews.rating": 4,
      "reviews.text": "About this for my grand kids for Christmas they absolutely love it"
    },
    {
      "reviews.date": "2018-03-17T00:00:00.000Z",
      "reviews.id": "5c92e23c-a366-4025-9c2c-70e45777ac59",
      "reviews.rating": 5,
      "reviews.text": "Bought this for my grandson and he was so excited, my daughter loves it because she has control over what he sees and does"
    },
    {
      "reviews.date": "2018-02-23T00:00:00.000Z",
      "reviews.id": "841a3889-9d57-4c66-af2a-87d3d8c84284",
      "reviews.rating": 5,
      "reviews.text": "WE bought 2 Amazon Fire HD2 for our grandkids. The educational apps are excellent!"
    },
    {
      "reviews.date": "2018-01-17T00:00:00.000Z",
      "reviews.id": "30223d7e-65c3-45bc-9d7f-5f0b6eb3c495",
      "reviews.rating": 5,
      "reviews.text": "It‚Äôs a great little iPad for children my son loves this iPad and he‚Äôs always on it"
    },
    {
      "reviews.date": "2017-12-08T00:00:00.000Z",
      "reviews.id": "e8d1774a-6096-4f22-82e8-2928d1bb8f6f",
      "reviews.rating": 5,
      "reviews.text": "Perfect for my granddaughter for her Christmas present"
    },
    {
      "reviews.date": "2018-03-21T00:00:00.000Z",
      "reviews.id": "4ca5ad2f-a391-43f8-b90f-c8d3a42555f2",
      "reviews.rating": 4,
      "reviews.text": "We bought 2 of these for our great grandsons. It a personal thing, built tough, they can learn, entertain themselves, and let great gramps sleep when they use the headphones."
    },
    {
      "reviews.date": "2017-12-17T00:00:00.000Z",
      "reviews.id": "4db9c366-c283-40ea-9a66-cf7b344eae94",
      "reviews.rating": 5,
      "reviews.text": "We bought this for my grandson and it has worked out well for him."
    },
    {
      "reviews.date": "2017-12-24T00:00:00.000Z",
      "reviews.id": "ef035382-1537-4572-bb61-4d798478da15",
      "reviews.rating": 5,
      "reviews.text": "This is a Christmas gift for my husband. He is very pleased with it"
    },
    {
      "reviews.date": "2018-02-11T00:00:00.000Z",
      "reviews.id": "a7e76875-56b6-40e5-b5fe-4461d98f8d59",
      "reviews.rating": 5,
      "reviews.text": "My 3 year old daughter loves this, it makes her feel grown like her sisters, it is user friendly for a small tike, safe from drops and falls from the protective casing and the warranty on it from amazon is amazing for 2 year, no questions replacement even if it broken screen."
    },
    {
      "reviews.date": "2017-10-08T00:00:00.000Z",
      "reviews.id": "63a54ad0-f4f0-404b-8e7f-cf083280e141",
      "reviews.rating": 5,
      "reviews.text": "She is already using it to help with school assignments. She is learning and having fun. Parent dashboard rocks. Love the status update on her activities and suggestions for parent-child discussions. Her teacher gave it a thumbs up also. 11 year old and 5 year old have already asked for as Christmas presents."
    },
    {
      "reviews.date": "2018-01-09T00:00:00.000Z",
      "reviews.id": "9cc4db20-e264-4152-9aa0-ed54fed36b8b",
      "reviews.rating": 5,
      "reviews.text": "Great buy to keep the child occupied during car rides"
    },
    {
      "reviews.date": "2018-05-01T00:00:00.000Z",
      "reviews.id": "ae2512fa-5ab6-4574-9c58-bde28cc827d4",
      "reviews.rating": 5,
      "reviews.text": "THESE TABLETS ARE PERFECT FOR TODDLERS! I WAS PLANING TO BUY MY 5 AND 3 YEARS OLD AN IPAD BUT CAME ACROSS THESE AND AFTER READING REVIEWS I DECIDED TO ORDER. THE COVERS WORK GREAT SINCE MY 3 YEAR OLD ALWAYS DROPS IT. TOTALLY RECOMMEND!!!"
    },
    {
      "reviews.date": "2018-05-25T00:00:00.000Z",
      "reviews.id": "d47943f1-0291-4ab0-ba58-15d86c4ab80b",
      "reviews.rating": 5,
      "reviews.text": "Easy access to a lot of different apps . My daughter loves to watch YouTube and Netflix ."
    },
    {
      "reviews.date": "2017-12-15T00:00:00.000Z",
      "reviews.id": "c9aa08ae-c65e-479f-92e9-26c006049419",
      "reviews.rating": 5,
      "reviews.text": "This is a present for my 3 year old great-granddaughter. She is advanced for her age."
    },
    {
      "reviews.date": "2017-09-20T00:00:00.000Z",
      "reviews.id": "96019021-6568-46cf-a846-d40f691627d6",
      "reviews.rating": 5,
      "reviews.text": "My niece loves this. Plays the games. Just loves it."
    },
    {
      "reviews.date": "2018-02-24T00:00:00.000Z",
      "reviews.id": "c451ae08-09f2-464e-b158-50f885684f0f",
      "reviews.rating": 5,
      "reviews.text": "My four year old love it. It‚Äôs like Theon his own world"
    },
    {
      "reviews.date": "2017-10-14T00:00:00.000Z",
      "reviews.id": "ad7d5a24-6de2-4df9-9b2f-b37aa6b83c5c",
      "reviews.rating": 5,
      "reviews.text": "Awesome tablet. I was amazed how fast it is. And the software is very user friendly"
    },
    {
      "reviews.date": "2018-01-09T00:00:00.000Z",
      "reviews.id": "62ab05e4-704b-4872-80a3-2e56cf59da87",
      "reviews.rating": 5,
      "reviews.text": "got it on black friday for $79.99my 2 year old love it"
    },
    {
      "reviews.date": "2017-12-08T00:00:00.000Z",
      "reviews.id": "2d8e9bff-3bf0-4433-8e18-b72a1bde03b5",
      "reviews.rating": 3,
      "reviews.text": "Great case.. took awhile to get to my house but after several delays it finally got there."
    },
    {
      "reviews.date": "2017-11-01T00:00:00.000Z",
      "reviews.id": "aee50cfb-c1eb-4167-bc9b-a1904ef2b08a",
      "reviews.rating": 5,
      "reviews.text": "I got this for my son for his 4th birthday and he loves it. The kids section is the best."
    },
    {
      "reviews.date": "2017-08-18T00:00:00.000Z",
      "reviews.id": "5acaba2f-8d6e-4333-b02d-e98800854fbc",
      "reviews.rating": 4,
      "reviews.text": "I got this tablet for my 3 year old and she absolutely loves it. We travel a lot and it's been a life saver."
    },
    {
      "reviews.date": "2017-10-14T00:00:00.000Z",
      "reviews.id": "c9f4b395-43ef-4732-94d5-65f81fe065f1",
      "reviews.rating": 5,
      "reviews.text": "It‚Äôs pretty fast and I love the built in protective case on it"
    },
    {
      "reviews.date": "2018-01-12T00:00:00.000Z",
      "reviews.id": "e513f05b-76fa-4765-9f28-99533317c96a",
      "reviews.rating": 5,
      "reviews.text": "Keeps the little one entertained and love the battery life."
    },
    {
      "reviews.date": "2018-01-17T00:00:00.000Z",
      "reviews.id": "0bc9fd89-da6b-4975-a848-59239891cf91",
      "reviews.rating": 5,
      "reviews.text": "My daughter and her cousin love this product and they are 6 years old going on 7 and its easy for Parents to set up and Monitor. It comes with a case already which is awesome so.no need to get the expensive Ipad for your child. 5 stars for sure!"
    },
    {
      "reviews.date": "2017-11-20T00:00:00.000Z",
      "reviews.id": "e541e173-f270-4a55-8259-5c8c481fcd08",
      "reviews.rating": 5,
      "reviews.text": "Solid state of the art tablet, kids enjoyed a lot and easy to work with"
    },
    {
      "reviews.date": "2017-08-11T00:00:00.000Z",
      "reviews.id": "b07546a8-a237-428b-af64-cc648d14fb36",
      "reviews.rating": 5,
      "reviews.text": "The best part is that mommy can restrict what the kids do and when they do it."
    },
    {
      "reviews.date": "2017-09-20T00:00:00.000Z",
      "reviews.id": "880b7095-9c5d-432e-aba8-48d9a8b9e255",
      "reviews.rating": 5,
      "reviews.text": "The kindle fire is great for kids to learn and be entertained!"
    },
    {
      "reviews.date": "2017-07-21T00:00:00.000Z",
      "reviews.id": "b3980cf7-3530-44ca-af95-856ed704c075",
      "reviews.rating": 5,
      "reviews.text": "This is a great kindle for smaller children. My 4 year old has already dropped it several times, with no issues. Easy for him to work and comes with kindle free time, which has a lot of educational games."
    },
    {
      "reviews.date": "2018-04-03T00:00:00.000Z",
      "reviews.id": "50db3512-56d7-44f4-92d4-e586c3a589c3",
      "reviews.rating": 5,
      "reviews.text": "We got this the day it came out. I have a four year old daughter, and she loves it! We have an iPad for her, but it was getting very expensive because so many of the games have buttons that you can click which then tell you about things you need to buy and she would have to have them. This tablet restricts all in app purchasing. Yay! We tried the older version of this tablet but it kept freezing and did not perform well. But so far, this one works well. I have two requests to Amazon, and I am hoping that someone from Amazon reads my review so they can make this change. Please change Amazon Freetime so that it puts the story apps that are under apps into the books sections. There are many wonderful stories that are read out loud but they are in the apps section instead of the books section, so then when I restrict her tablet to books only, she can't access them. I would love it so much if you they would fix this. A few examples of the stories she can't access when I restrict her to books because they are considers apps are the following: Nighty Night!, Charlie Brown's, The Berenstain Bears, and Dino-Store Story. The other recommendation I have is to please hide from view the activities that are restricted. As it is now, she can see all the apps but gets an error message when she selects them. I really like this product, and I think it so great for children. It just needs a few little improvements to the Freetime interface."
    },
    {
      "reviews.date": "2018-01-18T00:00:00.000Z",
      "reviews.id": "08c121c1-0c12-4afd-8f7d-81fdb9544f5b",
      "reviews.rating": 4,
      "reviews.text": "We like the durability but wish there were more applications available (Google play store). The other challenging thing is we would prefer to have more control over what the kids can do. Our standards are a bit different than whoever is in charge of choosing age appropriate apps."
    },
    {
      "reviews.date": "2018-03-21T00:00:00.000Z",
      "reviews.id": "acbc869e-77ae-4685-972c-481ea9c4371b",
      "reviews.rating": 5,
      "reviews.text": "Easy to use my 2 year old loves it and I can use it for my needs also"
    },
    {
      "reviews.date": "2017-08-16T00:00:00.000Z",
      "reviews.id": "4c125600-779a-40fb-832c-b141d9b89d3e",
      "reviews.rating": 4,
      "reviews.text": "This is a great, easy to use tablet. It's nice because it doesn't have to be \"just a kids tablet.\" I can do what I want to do on there as well. The parental controls are great. The case makes it feel pretty durable. The battery lasts a really long time. The only reason I gave it 4 stars is because we can't get all of our apps/games on there because they're not available which is pretty disappointing. One real popular one we can't get is YouTube kids. My son loved that. He was pretty bummed about that. Overall we love the tablet, and would definitely recommend it."
    },
    {
      "reviews.date": "2017-12-04T00:00:00.000Z",
      "reviews.id": "0ac3d6ae-6bdc-443c-80f6-0e83cf0a6979",
      "reviews.rating": 5,
      "reviews.text": "It‚Äôs a tough tablet...perfect for kids! And I love the ‚Äúparent control‚Äù so we can limit our child on how long she can be on the tablet."
    },
    {
      "reviews.date": "2017-11-15T00:00:00.000Z",
      "reviews.id": "b37fa9be-2384-4c96-bc71-68552185adf0",
      "reviews.rating": 5,
      "reviews.text": "I bought this as a gift for my four year old son, couldn‚Äôt pass up on the price. My son seems to enjoy it. Has plenty of learning apps that help with directions,colors and numbers."
    },
    {
      "reviews.date": "2017-07-19T00:00:00.000Z",
      "reviews.id": "dac57957-2685-442b-abb1-5c9c02f1b469",
      "reviews.rating": 5,
      "reviews.text": "My daughter loves this tablet! It's got loads of apps to choose from & the graphics are great!"
    },
    {
      "reviews.date": "2017-08-07T00:00:00.000Z",
      "reviews.id": "9c34fe0a-3458-4609-ade4-4e9d5f66d5f6",
      "reviews.rating": 5,
      "reviews.text": "Enjoyed the color, construction, and ability to control viewing for our daughter."
    },
    {
      "reviews.date": "2017-07-19T00:00:00.000Z",
      "reviews.id": "dab6f9ef-4767-4de5-bf43-503044235710",
      "reviews.rating": 5,
      "reviews.text": "As a grandparent, we purchased two of these for our grandsons (of course with Mom's help). We were looking at a normal tablet (Samsung/Apple) and finally decided on the Fire HD 8. The boys just love them, mom is happy that she can put time limits on usage and from looking at the loaded applications, they are very appropriate for child learning (strategy, logic development, etc.). We would buy them again if needed."
    },
    {
      "reviews.date": "2017-12-12T00:00:00.000Z",
      "reviews.id": "f982045e-c0e3-4b48-b992-9258b7710e4a",
      "reviews.rating": 3,
      "reviews.text": "Easy to setup. Large screen. Protective case built-in. Two year protection plan included."
    },
    {
      "reviews.date": "2018-04-18T00:00:00.000Z",
      "reviews.id": "8ae0acd5-9763-4719-a7ae-05c6b32d1e9d",
      "reviews.rating": 5,
      "reviews.text": "my stepdaughter is still learning how to navigate it but she mostly spends her time on youtube on it awesome product"
    },
    {
      "reviews.date": "2018-01-05T00:00:00.000Z",
      "reviews.id": "1668676a-6c87-4779-98f0-2ece0438ca5e",
      "reviews.rating": 5,
      "reviews.text": "My daughter loves it. She uses it consistently and her brother has expressed an interest in having his own"
    },
    {
      "reviews.date": "2018-02-21T00:00:00.000Z",
      "reviews.id": "ce6e7215-62b3-441c-9624-0fb402017d50",
      "reviews.rating": 5,
      "reviews.text": "My grandson loves the Fire 8 Kids. It is durable, and doesn‚Äôt mind being dropped by little hands. His mind stays engaged and car rides are pleasurable once again!"
    },
    {
      "reviews.date": "2018-02-21T00:00:00.000Z",
      "reviews.id": "fc325e9a-b0e2-49d6-83ee-eb3e54d69298",
      "reviews.rating": 5,
      "reviews.text": "This is t!he best learning tool you can get for a young child. They will get hooked on this tablet."
    },
    {
      "reviews.date": "2017-10-18T00:00:00.000Z",
      "reviews.id": "0b0feba1-5278-47a4-bdce-7d96766d6dbd",
      "reviews.rating": 5,
      "reviews.text": "Bought two for our 5-year-old twin god-children and they love it. It's both a learning tool and can also be used for entertainment. Great Investment in their future."
    },
    {
      "reviews.date": "2017-12-15T00:00:00.000Z",
      "reviews.id": "933becc4-5fa5-45c4-9811-fab16c35b3d1",
      "reviews.rating": 5,
      "reviews.text": "So many kid friendly apps for my 1 year old! She loves this thing!"
    },
    {
      "reviews.date": "2017-09-15T00:00:00.000Z",
      "reviews.id": "200b8d2b-ee8f-4ea8-81cd-0e7e58ab080e",
      "reviews.rating": 5,
      "reviews.text": "A great deal with case for kids and you can't beat the price"
    },
    {
      "reviews.date": "2017-08-19T00:00:00.000Z",
      "reviews.id": "fc4ff4f4-8d73-434a-97d7-c711c048ad0e",
      "reviews.rating": 5,
      "reviews.text": "Not just a good kid tablet but it was also at a good price"
    },
    {
      "reviews.date": "2018-01-13T00:00:00.000Z",
      "reviews.id": "a2959cd7-aeee-434c-973b-29f0037d1a16",
      "reviews.rating": 5,
      "reviews.text": "Best gift ever for my granddaughter. She loves it ."
    },
    {
      "reviews.date": "2017-11-16T00:00:00.000Z",
      "reviews.id": "41a69cd3-2650-4ff7-b2cb-15806896486b",
      "reviews.rating": 5,
      "reviews.text": "Good for kids. Good parental control. Great shipping."
    },
    {
      "reviews.date": "2017-10-13T00:00:00.000Z",
      "reviews.id": "ac052ecf-9b1f-4497-bee1-ee5b56680bf2",
      "reviews.rating": 5,
      "reviews.text": "I‚Äôve bought several for my foster kids. I like that they come preloaded with blocking inappropriate websites and limits them to kid friendly stuff"
    },
    {
      "reviews.date": "2017-11-19T00:00:00.000Z",
      "reviews.id": "184cb848-eab6-40cf-80e1-b88d13c34a62",
      "reviews.rating": 5,
      "reviews.text": "Bought 2 for my 7yr old twins. The are great for the little ones but also great for general use.Very responsive."
    },
    {
      "reviews.date": "2017-12-16T00:00:00.000Z",
      "reviews.id": "cd5070e1-73b0-4b87-84f4-841b103e8bce",
      "reviews.rating": 5,
      "reviews.text": "Got this for my daughter after her ipad got too old. Im really surprised how good it works and all the features for the price."
    },
    {
      "reviews.date": "2018-02-21T00:00:00.000Z",
      "reviews.id": "9654fabf-b9ba-4242-8882-92f8a907c45a",
      "reviews.rating": 5,
      "reviews.text": "My kid loves this device n for the price it does and has lots of apps"
    },
    {
      "reviews.date": "2018-03-25T00:00:00.000Z",
      "reviews.id": "fea9f27c-534e-410e-ad35-a2418b59bdb8",
      "reviews.rating": 5,
      "reviews.text": "The rubber case has been a game changer. It is a very easy product to set up restrictions for a child to use."
    },
    {
      "reviews.date": "2017-11-24T00:00:00.000Z",
      "reviews.id": "2cd72f34-f04c-4656-82dd-aceab1fc0d9d",
      "reviews.rating": 4,
      "reviews.text": "First off, I‚Äôm primaril an Apple product user that chose this unit because of its price & child centered form factor. Price - compared to an iPad was - & form factor such as weight & resilience from being dropped from reasonable heights were definite strengths. The ability to discretely control access for a 2 to 4 users was also a plus. Relative down side for me has been counter intuitive user interface as compared to Apple products."
    },
    {
      "reviews.date": "2018-04-19T00:00:00.000Z",
      "reviews.id": "cb5c4901-5a75-47f1-9806-0923eb122b46",
      "reviews.rating": 4,
      "reviews.text": "My daughter loves her tablet and I love the parental controls. I can monitor everything and dont have any unwanted credit card charges. Can even set a curfew on it!"
    },
    {
      "reviews.date": "2017-06-28T00:00:00.000Z",
      "reviews.id": "48cb9a42-076f-4087-9bc7-3e4594f4e9c1",
      "reviews.rating": 5,
      "reviews.text": "Buying the kid version of the kindle was the way to go! We are able to control everything our son watches and does. The case seems to do the job protecting it as well."
    },
    {
      "reviews.date": "2017-11-24T00:00:00.000Z",
      "reviews.id": "2e4ca163-0819-4f48-972f-669af45c5239",
      "reviews.rating": 5,
      "reviews.text": "I love this product!! I recommend it to everyone!!"
    },
    {
      "reviews.date": "2018-04-20T00:00:00.000Z",
      "reviews.id": "7c4aac8b-c701-46cb-ab2e-0bbf1246db6c",
      "reviews.rating": 5,
      "reviews.text": "I wish it was more user friendly for my 2 year old."
    },
    {
      "reviews.date": "2017-09-21T00:00:00.000Z",
      "reviews.id": "c5743594-d773-412b-91bd-fd047f675295",
      "reviews.rating": 5,
      "reviews.text": "My kid loves the tablet. She is learning so much with the apps."
    },
    {
      "reviews.date": "2018-05-04T00:00:00.000Z",
      "reviews.id": "2c24601b-ea71-45f4-9a50-ce9fae695dc4",
      "reviews.rating": 5,
      "reviews.text": "My son loves it. I bought this one because it‚Äôs a kids model and has a great rubber protector. I went through 3 kindles from amazon and they all broke very easily and one would get too hot to touch. This one from Best Buy is awesome. Definitely recommend."
    },
    {
      "reviews.date": "2018-03-22T00:00:00.000Z",
      "reviews.id": "e3c8825b-06d8-4dc3-b01f-3af586023802",
      "reviews.rating": 5,
      "reviews.text": "This tablet works great. It is easy to set up and the Amazon kids account allows you to limit access by age groups. My kids love these."
    },
    {
      "reviews.date": "2017-10-18T00:00:00.000Z",
      "reviews.id": "65c6b58f-7417-4e33-b727-ea10247cd2ed",
      "reviews.rating": 5,
      "reviews.text": "we bought tablet for my grandson, he really likes it"
    },
    {
      "reviews.date": "2018-01-17T00:00:00.000Z",
      "reviews.id": "4926ac49-94e7-4312-8a95-45568b7563a5",
      "reviews.rating": 4,
      "reviews.text": "The amazon fire kids is amazing .. great games already loaded tons to chose from . Able to have dual users where she can only play games that are age appropriate without accidentally getting into an unwanted app"
    },
    {
      "reviews.date": "2018-02-02T00:00:00.000Z",
      "reviews.id": "7a5cf5aa-407d-4b85-bcb9-8d4ed382a572",
      "reviews.rating": 5,
      "reviews.text": "Bought this for my grandkids and they love it. Use it for all kinds of things."
    },
    {
      "reviews.date": "2018-03-22T00:00:00.000Z",
      "reviews.id": "8caf2627-e983-4be9-9942-8980130d327d",
      "reviews.rating": 5,
      "reviews.text": "Each granddaughter has one now, they love it. Super .now need one more set of head phones. Love the apps and learning tools. Great coverage if anything happens."
    },
    {
      "reviews.date": "2018-01-05T00:00:00.000Z",
      "reviews.id": "0ca419e6-fb22-470b-8605-c217b810ad21",
      "reviews.rating": 5,
      "reviews.text": "Got these for my grand kids and they love them...already went thru 6 of them...lol"
    },
    {
      "reviews.date": "2017-08-01T00:00:00.000Z",
      "reviews.id": "e0639bd4-5803-42e8-8b65-d45fb1f2c486",
      "reviews.rating": 5,
      "reviews.text": "Got this tablet to replace the nabi my 4 yr old daughter had. I picked this tablet because of its 2 yr no questions asked return policy, If u have kids you know they always find away to break spill or the software glitches. So far this tablet works great it's way faster then the nabi was its easy for my 4 yr old to work and I can set time limits and what she can do it also shows me what she uses and for how long each day. The tablet is light and easy for her to hold and the bumper has worked good when it has been dropped. Has a great selection of free apps books and games for a full year after that its $4.99 a month. My 8 yr old wants one now and she currently has a ipad but says the amazon works better and she loves the selection of books. I would recommend this tablet"
    },
    {
      "reviews.date": "2018-01-17T00:00:00.000Z",
      "reviews.id": "701f64ca-8687-441a-9778-7cb692ded9ea",
      "reviews.rating": 5,
      "reviews.text": "This tablet is great for children. This is my daughter's second tablet. The preset apps are very usual."
    },
    {
      "reviews.date": "2018-03-21T00:00:00.000Z",
      "reviews.id": "a15b27c4-d2f9-4b78-81cf-ad6c62b3dcf0",
      "reviews.rating": 5,
      "reviews.text": "Great tablet at a great price with the big screen Kids have no problem scrolling through it"
    },
    {
      "reviews.date": "2017-12-09T22:22:49.000Z",
      "reviews.id": "d019f8ab-fe95-46b9-990d-f8022811bb1c",
      "reviews.rating": 5,
      "reviews.text": "The tablet is wonderful the only negative about this tablet is that it doesnt allow you to download kids youtube or any google app that im aware of.... i almost returned the tablet but i found a website that showed me how to turn off security settings and download the links i needed in order to get the app so now everything is great and we love it!"
    },
    {
      "reviews.date": "2017-12-23T00:00:00.000Z",
      "reviews.id": "e2dd65e5-55ed-404d-abbd-cc10888f6bef",
      "reviews.rating": 5,
      "reviews.text": "Excellent screen size and storage. Nice that it includes a case."
    },
    {
      "reviews.date": "2017-11-15T00:00:00.000Z",
      "reviews.id": "4cdc777b-5c0e-457d-9606-2ec3dbd2f73d",
      "reviews.rating": 5,
      "reviews.text": "Would highly recommend to anyone with children. Great value for money"
    },
    {
      "reviews.date": "2017-12-05T00:00:00.000Z",
      "reviews.id": "093f0f1f-e089-441e-bd76-8790c69e609f",
      "reviews.rating": 5,
      "reviews.text": "I bought this for my granddaughter as a birthday present. The tablet is wonderful for games, music and homework."
    },
    {
      "reviews.date": "2017-12-17T19:56:53.000Z",
      "reviews.id": "3588553b-e510-4306-b223-b49f4dcc9015",
      "reviews.rating": 5,
      "reviews.text": "Daughter loves it. I love the Amazon free time that came with it. Has access to lots of books, videos and apps that are appropriate for kids. Love that I can add websites and apps that I decide she can watch. Pretty durable so far. She's had two other tablets but I like this one much better. definitely would recommend."
    },
    {
      "reviews.date": "2017-09-01T00:00:00.000Z",
      "reviews.id": "2cd01de3-ede9-406a-9d1f-ed4aa641f99b",
      "reviews.rating": 5,
      "reviews.text": "Easy to use tablet for kids. Very durable case. Love it!"
    },
    {
      "reviews.date": "2017-08-16T00:00:00.000Z",
      "reviews.id": "eac7bd7a-6656-4598-8b8a-83d78c82084b",
      "reviews.rating": 4,
      "reviews.text": "I purchased Amazon - Fire HD 8 Kids Edition - 8 for my daughter and she immediately fell in love with her first tablet. I personally find this device a great value for money."
    },
    {
      "reviews.date": "2017-12-02T00:00:00.000Z",
      "reviews.id": "d19570d8-2111-4d7a-a2a5-d15a5923ce19",
      "reviews.rating": 5,
      "reviews.text": "My 2 year old and 5 year old love this. I don't have to worry about them dropping and breaking it since it has a warranty.."
    },
    {
      "reviews.date": "2017-07-23T00:00:00.000Z",
      "reviews.id": "d7034800-37bd-4b1c-84f6-b061ea565217",
      "reviews.rating": 5,
      "reviews.text": "My daughter loves her tablet! She's only two and has learned how to use and navigate with ease."
    },
    {
      "reviews.date": "2017-12-11T00:00:00.000Z",
      "reviews.id": "095350f2-f0d3-417e-8e45-e8042e86ecd0",
      "reviews.rating": 5,
      "reviews.text": "Parental controls, lots of storage space, easy for little hands to handle and love the added bumpers."
    },
    {
      "reviews.date": "2017-08-25T00:00:00.000Z",
      "reviews.id": "9eea342c-14c5-48af-9481-527b56a46d41",
      "reviews.rating": 5,
      "reviews.text": "Tablet is easy to use for everyone The camera is good. Love the protector for the occasional drops. Can't beat the 2 year no questions asked replacement from the manufacturer."
    },
    {
      "reviews.date": "2017-12-18T00:00:00.000Z",
      "reviews.id": "8da35908-144d-4b5a-92d2-aa7b1d83a039",
      "reviews.rating": 5,
      "reviews.text": "This tablet is much more durable and faster for impatient children, my kids had kurios before purchasing these and it is much better and easier to use. Easier parental control area and you can easily transfer anything to the parent account and then install it on the tablet for your child."
    },
    {
      "reviews.date": "2018-03-21T00:00:00.000Z",
      "reviews.id": "ad6530a9-3b17-408a-b3ad-e109e5e13c16",
      "reviews.rating": 5,
      "reviews.text": "Very easy to use and navigate. Both kids, ages 3 and 5 can operate it without any issues and enjoy reading books and playing games on it."
    },
    {
      "reviews.date": "2018-01-05T00:00:00.000Z",
      "reviews.id": "5b9e2da8-d855-4347-b129-7f6c46142cdf",
      "reviews.rating": 4,
      "reviews.text": "My son loves his new tablet. He is 5 years old. Great feature of having kids games downloaded already."
    },
    {
      "reviews.date": "2017-10-25T00:00:00.000Z",
      "reviews.id": "45b92441-f8cb-4494-804c-c224ffd7acfe",
      "reviews.rating": 5,
      "reviews.text": "Delight your child with books, games and shows tailored just for him on this Amazon Fire HD 8 Kids Edition tablet. The 8-inch high-definition display offers immersive play or viewing, and a parental dashboard lets you set up appropriate content or time limits. This Amazon Fire HD 8 Kids Edition tablet comes with a durable case that resists damage."
    },
    {
      "reviews.date": "2017-12-10T00:00:00.000Z",
      "reviews.id": "1017db79-b890-428b-b2e0-df61adb10fd0",
      "reviews.rating": 5,
      "reviews.text": "My granddaughter was thrilled to see her new tablet on the day of her birthday. The color and size was perfect for her little hands. She could not wait for the tablet to charge. She kept asking if the tablet was ready to turn on. When the tablet finally charged, she could not put it down. She went from room to room showing her brothers what she could do with her tablet. Everybody wanted to do something with her tablet. As a parent, I just love the rubber bumper. The rubber bumper around the tablet is an excellent bonus to the tablet. It helps protect the tablet if it drops or falls accidentally. We all know how little hands sometimes drops things more than once. I only wish we could have bought this tablet much sooner. Being a first grader this year, my granddaughter can really benefit while using this tablet. Also, there are many educational opportunities for young children to engage themselves in instead of being glued to the television on a daily basis. This tablet is more child-centered and parental controlled."
    },
    {
      "reviews.date": "2017-09-08T00:00:00.000Z",
      "reviews.id": "b3314fd1-cdf1-4d9a-8bd9-57a50213bddc",
      "reviews.rating": 5,
      "reviews.text": "Child loves the kindle and is very user friendly for both child and adult."
    },
    {
      "reviews.date": "2018-01-17T00:00:00.000Z",
      "reviews.id": "9369d44d-6fe3-4212-8747-305de1a41a75",
      "reviews.rating": 5,
      "reviews.text": "The best tablet fory toddler, who constantly drops his tablet! We love all the preinstalled apps & videos."
    },
    {
      "reviews.date": "2017-10-18T00:00:00.000Z",
      "reviews.id": "fb432c50-24ff-40b9-a4a7-24e66f39f42b",
      "reviews.rating": 4,
      "reviews.text": "My daughter is artistic, and we were looking for a tablet that would not only serve as a teaching tool, but also be able to put up with typical abuse of a toddler. It is only lacking the ability to download apps from the google play store, which can be worked around by downloading the apk files and installing them. The other issue is being able to move said apps from the play store to the child‚Äôs profile of the tablet. I am still working on finding a way to make this happen."
    },
    {
      "reviews.date": "2017-08-16T00:00:00.000Z",
      "reviews.id": "7a8f53a7-9913-4579-86ee-fa74e676683b",
      "reviews.rating": 5,
      "reviews.text": "Purchased this tablet for my kiddo, very easy to set up and he loves it!"
    },
    {
      "reviews.date": "2018-04-13T00:00:00.000Z",
      "reviews.id": "86f4b307-243a-40d7-ad5a-7a58c4e571d6",
      "reviews.rating": 5,
      "reviews.text": "My 1 1/2 yr old uses this tablet easy to use and setup. I love that you put in her age and it only pulls up age appropriate. Battery last long and heavy duty."
    },
    {
      "reviews.date": "2017-07-10T00:00:00.000Z",
      "reviews.id": "dc6d52ea-2a3f-4411-ab73-dabd2c647887",
      "reviews.rating": 5,
      "reviews.text": "Great size easy to hold overall it a great tablet."
    },
    {
      "reviews.date": "2018-03-13T17:13:07.000Z",
      "reviews.id": "4b88326f-c300-4988-835b-45f7e3f44410",
      "reviews.rating": 4,
      "reviews.text": "When you get this device please update the software (you might have to run update a few times - I did it 4 times) and then it will start to work properly. Also, if you are not an Amazon table user, then some of this is slightly different to use. Great for the kid to use and the apps in freeplay seem to be great for my kid of 7"
    },
    {
      "reviews.date": "2017-09-20T00:00:00.000Z",
      "reviews.id": "c0f20ddf-20c9-4156-b079-95d5e32e532f",
      "reviews.rating": 1,
      "reviews.text": "This tablet shut down and never turned back on after a week of purchasing it. I had to return it and they were out of stock for exchange. Annoying."
    },
    {
      "reviews.date": "2017-06-16T04:32:45.000Z",
      "reviews.id": "f1269d8d-f5cc-4bea-8491-8736f3f0822e",
      "reviews.rating": 5,
      "reviews.text": "My 2 year old broke her email pro easily Being a toddler I wasn't surprised but email makes you buy a brand new one so I bought this instead. Nowe originally she had the 7 generation one and it was only 16 G and it ran out of battery in like 4.5 hours. The 8 generation 32 G allows ny 2 year old to download plenty but with parental controls I customized myself and for a long day at the RMV or doctor office or a drive 3vstates away, even if she takes a break I don't have to recharge it for more like 9 hours. This is with downloading and watching movies and full episodes if all her favorite b shows. Also she's crazy abusive with it and it functions perfectly. My 4 year old ha's it too and his preschool teachers are begging me to tell them how he's so quick to learn almost everything they put in front of him and his vocabulary has significantly improved as well. I'm so happy with it I'm going to buy one for myself as well as a back up incase one is stolen. Only issue is the kids get addicted so it's real important to b set the timer to shut the system down so they remember to take potty breaks and play outside, but other than that I am thrilled with this product"
    },
    {
      "reviews.date": "2017-12-28T00:00:00.000Z",
      "reviews.id": "f2920666-85ae-445f-8fa2-2c823e8e09e0",
      "reviews.rating": 5,
      "reviews.text": "my 6 year old has not put this down!! It is easy to use and she loves the games that are already preinstalled!"
    },
    {
      "reviews.date": "2018-01-03T00:00:00.000Z",
      "reviews.id": "21bb4fb6-34c2-4500-833c-618443aa8892",
      "reviews.rating": 5,
      "reviews.text": "Our favorite item for the kids screen time! We have a few others, same brand and different, and this one is our favorite one!"
    },
    {
      "reviews.date": "2017-10-23T00:00:00.000Z",
      "reviews.id": "13a87c6d-8f8e-4844-95b8-cde3e2347115",
      "reviews.rating": 5,
      "reviews.text": "I wanted something for reading and surfing the web and i love it."
    },
    {
      "reviews.date": "2017-12-15T00:00:00.000Z",
      "reviews.id": "9b669124-0be5-4e94-b972-a9a26160a5c8",
      "reviews.rating": 5,
      "reviews.text": "kind of difficult for me to figure out how to use compared to an apple"
    },
    {
      "reviews.date": "2017-12-22T00:00:00.000Z",
      "reviews.id": "5deb2b8a-691d-4050-928f-c0682ab17c9d",
      "reviews.rating": 5,
      "reviews.text": "Great purchase highly recommended. Would definitely buy again."
    },
    {
      "reviews.date": "2018-01-17T00:00:00.000Z",
      "reviews.id": "c3102b06-eccb-4aff-a344-649a30c942b4",
      "reviews.rating": 3,
      "reviews.text": "I bought this tablet to use with my 3 year old autistic son. I tried 3 different tablets and all 3 were defective. It would turn off by itself during a video. We were using It for his therapy sessions and this was very inconvient. Switched to a 7 and have had no trouble since."
    },
    {
      "reviews.date": "2018-01-28T00:00:00.000Z",
      "reviews.id": "9e2e0ec5-993d-4f48-a696-b4e0d375978d",
      "reviews.rating": 5,
      "reviews.text": "Very easy to use and understand for my 4 year old."
    },
    {
      "reviews.date": "2017-11-29T00:00:00.000Z",
      "reviews.id": "25be0ec4-ccde-47cb-a9ef-846fcb15019e",
      "reviews.rating": 5,
      "reviews.text": "I love it! Recently drove to Texas and this device was a life saver. It kept my daughters entertained the times they were awake. Definitely recommend and its great for Adults too!"
    },
    {
      "reviews.date": "2017-09-30T00:00:00.000Z",
      "reviews.id": "ae5dc6ef-d64c-4612-80a6-0c71ea722403",
      "reviews.rating": 5,
      "reviews.text": "Purchased for my daughters to use, and they love it, user. Interface is easy to use, love the fact that I can select what is available to them."
    },
    {
      "reviews.date": "2017-07-29T00:00:00.000Z",
      "reviews.id": "8a4ab43a-497c-4ea9-900f-5b275e80701f",
      "reviews.rating": 5,
      "reviews.text": "Very user friendly, love the bumper guards, love all the memory compared to the 8 gb"
    },
    {
      "reviews.date": "2017-06-15T00:00:00.000Z",
      "reviews.id": "44759b0f-966b-4ca5-b7b4-3d9f433ba1b4",
      "reviews.rating": 1,
      "reviews.text": "Bought this for my young son, because of the warranty. You are required to have a credit card stored in the account, and to turn on parental controls it blocks other features too like Alexa. This is the most ridiculous setup ever."
    },
    {
      "reviews.date": "2018-05-23T00:00:00.000Z",
      "reviews.id": "b3afd49c-5b89-4339-b4a1-8a4dc9702394",
      "reviews.rating": 5,
      "reviews.text": "Nice product! Would Recommend! Kids love it a lot!!"
    },
    {
      "reviews.date": "2018-01-07T03:46:08.000Z",
      "reviews.id": "cfb84b33-ba47-44b9-9293-99a18891ac10",
      "reviews.rating": 3,
      "reviews.text": "Purchased this for my 18 month old granddaughter, had to return the first one due to it crashing. The second one has done the same , but plan on giving it a few more days before returning it. A little disappointed with it, expected it to be better than what it is."
    },
    {
      "reviews.date": "2017-09-26T00:00:00.000Z",
      "reviews.id": "276ca556-8d19-4eb9-8d0f-13b7fd16288c",
      "reviews.rating": 5,
      "reviews.text": "We bought a pink kindle kore for my daughter and we love it. Its the beat one we have found"
    },
    {
      "reviews.date": "2017-11-29T18:21:27.000Z",
      "reviews.id": "33ffc8ca-d281-437a-a400-c20cdc4086d2",
      "reviews.rating": 5,
      "reviews.text": "We have had this device for.over a week now and we love it! We have been able to use apps that encourage my daughter with special needs development, watch movies on it and read books we don't already own through it! Both of my daughters love it... Maybe too much. I will say the interface is a little confusing to switch between the parent and the child profiles. This is not very intuitive as you have to go into the free time app to do so, but otherwise it's fairly easy to use once you understand it."
    },
    {
      "reviews.date": "2017-09-20T00:00:00.000Z",
      "reviews.id": "34f9c04c-769b-44ad-97fb-fb38282f16cb",
      "reviews.rating": 5,
      "reviews.text": "I bought these for my kids they really love them I love the fact that I can change parental settings in their learning time and the kids really enjoy them"
    },
    {
      "reviews.date": "2018-02-21T00:00:00.000Z",
      "reviews.id": "3ccec986-c52b-4a38-b462-ac5425567e89",
      "reviews.rating": 4,
      "reviews.text": "This tablet is easy for my 9 y/o to use. I like that I can set goals, time limits on games, and a curfew."
    },
    {
      "reviews.date": "2018-04-05T02:35:59.000Z",
      "reviews.id": "1a910113-8c26-451b-80ac-826c6330690d",
      "reviews.rating": 5,
      "reviews.text": "This tablet is great. My 2 yr old loves the puzzles and games. He plays them with or without sound which was nice during church last week. I dont let him play for too long but it sure does come in handy when I need him to be entertained. Its Also durable so I dont worry about it breaking. My son has dropped it a few times and stood on it and its fine!"
    },
    {
      "reviews.date": "2017-10-20T00:00:00.000Z",
      "reviews.id": "0e57ca3a-98f0-4060-99f0-b59581c4cd4c",
      "reviews.rating": 5,
      "reviews.text": "Purchased for a 3 and 4 yr old grandchild for preschool. Software included will take them many years ahead. Both children just took off with scheduled programs. Very solid instrument easy parental control setup. Best life investment ever. Very happy and so are the kids."
    },
    {
      "reviews.date": "2017-11-25T17:10:08.000Z",
      "reviews.id": "a7c7123e-d572-4116-b5ea-d8cc33db690b",
      "reviews.rating": 5,
      "reviews.text": "Brought this for my granddaughter who is a bit rough with her toys. She dropped it and it bounced off the floor. No damage. Touch screen makes it easier for her to control. She's 4 and learned quick how to use it. I would definitely recommend this. After buying 3 tablets that broke within months. I finally got it right."
    },
    {
      "reviews.date": "2018-03-07T00:00:00.000Z",
      "reviews.id": "85f709f7-0ab8-4abb-bb3e-ded44f0a0fd5",
      "reviews.rating": 5,
      "reviews.text": "Excellent entertainment for children. Very controlled content."
    },
    {
      "reviews.date": "2018-04-08T00:00:00.000Z",
      "reviews.id": "d68fbe42-e000-4d22-9311-9dc4c70d04b2",
      "reviews.rating": 5,
      "reviews.text": "My daughter wanted this tablet. She couldn‚Äôt wait to get home to start using it. She spent hours quietly exploring. The comfort of knowing she can‚Äôt accidently get on sites not appropariate is the best. We don‚Äôt feel like we have to patrol what she is looking at now."
    },
    {
      "reviews.date": "2017-09-04T00:00:00.000Z",
      "reviews.id": "309d38b4-8668-4add-a1ed-9213778fb73f",
      "reviews.rating": 5,
      "reviews.text": "Great product for kids. My 8 year old loves the camera and ability to rock it out listening to music and watching American Girl doll shows."
    },
    {
      "reviews.date": "2018-01-22T00:00:00.000Z",
      "reviews.id": "55f21ebe-402d-4872-a95f-8a7cbe61fe3c",
      "reviews.rating": 4,
      "reviews.text": "We download shows from Netflix and with the child safety programs and apps we are good with or without WiFi."
    },
    {
      "reviews.date": "2018-01-14T00:00:00.000Z",
      "reviews.id": "c75593e6-3acf-4781-abfe-91c4c6807560",
      "reviews.rating": 4,
      "reviews.text": "Would have gave it a 5 star but it lost my parental setup and had to reset it one time. Other than that it has been great."
    },
    {
      "reviews.date": "2018-04-18T00:00:00.000Z",
      "reviews.id": "c44ee09d-a23b-4bf5-8b8b-4d15c9ebc0f5",
      "reviews.rating": 5,
      "reviews.text": "Purchased this for my kiddo and he loves it! All the apps he needs are there!"
    },
    {
      "reviews.date": "2017-08-25T00:00:00.000Z",
      "reviews.id": "51c7caf3-ef20-4fb9-8852-274fd1f6b680",
      "reviews.rating": 5,
      "reviews.text": "My son loved it a lot. Educational apps and videos help a lot."
    },
    {
      "reviews.date": "2017-08-05T00:00:00.000Z",
      "reviews.id": "4d103210-049f-4c0b-be77-9d712a7bb579",
      "reviews.rating": 4,
      "reviews.text": "Pretty sure he is probably playing angry birds with it now."
    },
    {
      "reviews.date": "2017-09-06T00:00:00.000Z",
      "reviews.id": "cc3c1e93-7740-434b-99d9-cae10ead7f25",
      "reviews.rating": 5,
      "reviews.text": "With pre-installed apps, a comfortable and protective case, and a year of Amazon Freetime, this product is worth every penny. The amount of educational programs available for free in Freetime is absolutely staggering. My son suddenly knew things I hadn't taught him, and when I asked him where he learned it, he would open the app and show me. He's three. It boggles the mind."
    },
    {
      "reviews.date": "2017-12-08T00:00:00.000Z",
      "reviews.id": "0f629afd-e0a9-4521-8e1a-a246108e6133",
      "reviews.rating": 4,
      "reviews.text": "Although a new tablet, had some issues. The updates kept it from the freetime. I called tech support and did not solve the issue. I eventually figured out how to resolve the issue, a bug in the tablet os I guess. I now have a great tablet for my 3 year old."
    },
    {
      "reviews.date": "2017-12-25T00:00:00.000Z",
      "reviews.id": "a92b6a5e-97ac-4af5-a54c-239a4ea303fe",
      "reviews.rating": 3,
      "reviews.text": "Its a good one but didn't set for my 6 year old.So had to return it back !"
    },
    {
      "reviews.date": "2018-03-23T00:00:00.000Z",
      "reviews.id": "a3585390-05cc-46d4-a579-93d745c52855",
      "reviews.rating": 5,
      "reviews.text": "This is our second Kindle Fire for kids (we upgraded to the newest version). The screen is a little bit bigger and has the awesome blue light filter built into the screen so I don‚Äôt have to worry as much about my 5 year old‚Äôs eyes and macular degeneration. It has all of the features of the original kids kindle; you can set time limits and reading goals to get more game time. It is durable and our 10 and 11 year old also love theirs as you can customize it to each child‚Äôs specific age group."
    },
    {
      "reviews.date": "2018-01-15T00:00:00.000Z",
      "reviews.id": "a421bf9d-a8b3-4c79-98dd-ffbee48edf0f",
      "reviews.rating": 5,
      "reviews.text": "Wonderful gift for my niece.She gets entertainment and also gets to use it to learn things."
    },
    {
      "reviews.date": "2018-04-08T00:00:00.000Z",
      "reviews.id": "4f65d311-d9e9-4f94-b234-7ed5d4ff7eb4",
      "reviews.rating": 2,
      "reviews.text": "I think the charging port should be something more simple since this product is aimed at smaller children. We‚Äôve only had ours for a month and the port is broke. Getting a new one sent to us."
    },
    {
      "reviews.date": "2017-09-27T00:00:00.000Z",
      "reviews.id": "ad3bf783-7bca-43a5-ac93-44904f0b1a35",
      "reviews.rating": 3,
      "reviews.text": "Bought it for my 3 year old son. Physically the product is amazing! Love the case around it, and how amazon replaces the product if anything happens, no questions asked. However, the software is terrible. I wasn't expecting much to begin with but its hard to consider this as a tablet when everything is limited. I only use it now to play movies from an external SD card, which cannot be played via kids profile"
    },
    {
      "reviews.date": "2017-09-22T00:00:00.000Z",
      "reviews.id": "3bf23e56-c0ec-48cc-ae93-533078db92a1",
      "reviews.rating": 5,
      "reviews.text": "Very easy to use. Trying to motivate my son to read more. So far is working."
    },
    {
      "reviews.date": "2017-11-10T00:00:00.000Z",
      "reviews.id": "3fd18649-5267-479f-9e47-8383ad6d43d1",
      "reviews.rating": 4,
      "reviews.text": "My 5 year daughter really likes this and I can put parental controls on it so I know what she is watching."
    },
    {
      "reviews.date": "2017-11-30T00:00:00.000Z",
      "reviews.id": "b831166c-8af4-4afe-8ae8-9bbc8499c851",
      "reviews.rating": 5,
      "reviews.text": "This is exactly what my daughter wanted. Easy to use, great case for a 3 year old to drop. And an amazing no questions replacement via Amazon."
    },
    {
      "reviews.date": "2018-01-19T00:00:00.000Z",
      "reviews.id": "64650fc4-683a-4a32-89d0-790c348f9900",
      "reviews.rating": 5,
      "reviews.text": "We bought this for our 2 yr old grandson for Christmas. He just loves it. The protective case is very sturdy and can hold up to a toddler. Easy to you and kid friendly."
    },
    {
      "reviews.date": "2017-12-04T00:00:00.000Z",
      "reviews.id": "6526eca1-9249-49e5-87ac-11ec639c1362",
      "reviews.rating": 5,
      "reviews.text": "Youd be silly not to buy this for a childs tablet. Comes with a no questions asked 2 yr warranty. Doesnt have special offer ads on it. Can be modded to provide Google play apps but you will miss out on the Amazon child filters for content. Durable and plenty powerful. Price is insanely cheap"
    },
    {
      "reviews.date": "2018-05-01T00:00:00.000Z",
      "reviews.id": "d667be61-a5f1-445e-93f5-f3c24709afa8",
      "reviews.rating": 5,
      "reviews.text": "This is awesome for kids, not too pricy, has a great case, and loads of parental controls."
    },
    {
      "reviews.date": "2018-05-22T11:21:13.000Z",
      "reviews.id": "9b78d0f3-818a-4496-882c-3e0587eee9f1",
      "reviews.rating": 5,
      "reviews.text": "Love item for 2 year old"
    },
    {
      "reviews.date": "2017-09-17T00:00:00.000Z",
      "reviews.id": "0a855a51-d7fd-4741-b322-9006d99dfe40",
      "reviews.rating": 5,
      "reviews.text": "I had originally tried getting an At&T or a Sprint tablet for my young daughter but she (or someone else) would inevitably end of breaking the screen and making the tablet unusable. Screen protectors would make the sensitivity too difficult for her to use and I couldn't ever find a good drop-proof protective case.I finally discovered the Amazon Fire Kids edition and wish I had known of this 3 broken tablets ago. Aside from the awesome drop-proof case, it has a nicely done custom kids view that removes all the things I don't want my daughter having access to (Youtube, the Google play store, web browsing). I already had one issue with it (99% certain it was my fault) but Amazon's \"Worry Free Guarantee\" had me a replacement tablet in 2 days for zero cost and no questions asked. If you have a young child you want to get a tablet for, this is it."
    },
    {
      "reviews.date": "2017-08-16T00:00:00.000Z",
      "reviews.id": "3c360331-51c5-4c82-8744-e515ca0cde86",
      "reviews.rating": 4,
      "reviews.text": "For what it is, it's great. If you expect an iPad, you're not going to get it. It's a very capable tablet, and has a good variety of apps for the kids."
    },
    {
      "reviews.date": "2018-09-05T16:22:10.000Z",
      "reviews.id": "2f06f637-4706-4a9d-b9c0-3e99d0f54eed",
      "reviews.rating": 4,
      "reviews.text": "So far, so good, but I've only used it for 1 week. Would've like for some kind of handle for the cover so it's easier to hold for kids small hands."
    },
    {
      "reviews.date": "2018-04-20T00:00:00.000Z",
      "reviews.id": "fe97b646-ec5e-4c14-a274-354f52427ec2",
      "reviews.rating": 5,
      "reviews.text": "Bought this for my 3 year old. He absolutely loves it. It is easy for him to navigate"
    },
    {
      "reviews.date": "2018-04-18T00:00:00.000Z",
      "reviews.id": "f0b3a523-c527-4391-bb13-18886079f233",
      "reviews.rating": 5,
      "reviews.text": "My son loves this tablet and so does his mom lol.."
    },
    {
      "reviews.date": "2017-10-06T00:00:00.000Z",
      "reviews.id": "a0eb1b45-2cd2-4a35-982f-478072380dc0",
      "reviews.rating": 5,
      "reviews.text": "Was looking for a reasonably priced tablet for the kids. Comes with a protected case and easy to use"
    },
    {
      "reviews.date": "2018-03-21T00:00:00.000Z",
      "reviews.id": "5014c38b-1590-4818-80ba-7a7df6122e64",
      "reviews.rating": 2,
      "reviews.text": "We have only had this product for about a month and there's already a problem with the charging port. Having to send it back. My Daycare owns 3 of them for her own children and their having the same problems with two of there's."
    },
    {
      "reviews.date": "2017-12-12T00:00:00.000Z",
      "reviews.id": "4534158b-e6fb-4b0c-bff8-b20a1576848d",
      "reviews.rating": 5,
      "reviews.text": "Its a perfect device and secure device for kids, just love it."
    },
    {
      "reviews.date": "2017-12-27T00:00:00.000Z",
      "reviews.id": "d0e168b1-d969-4fe3-9965-a8edd419bae5",
      "reviews.rating": 5,
      "reviews.text": "I bought this for my special needs son. He keeps kissing it saying,\" I love you tablet\". Could not be happier. Setup is a breeze. Very easy forkids to use and enjoy."
    },
    {
      "reviews.date": "2017-09-02T00:00:00.000Z",
      "reviews.id": "6af1adf4-6c5e-4c2e-89c8-65ef9bd8701b",
      "reviews.rating": 5,
      "reviews.text": "This was a gift for grandkids. I'm hearing that they are very happy with it."
    },
    {
      "reviews.date": "2017-12-20T00:00:00.000Z",
      "reviews.id": "9843dbfb-4885-4b19-bd1e-075b43555f8e",
      "reviews.rating": 5,
      "reviews.text": "I bought this for my son and he is able to easily navigate along safe for Kids!"
    },
    {
      "reviews.date": "2017-10-06T00:00:00.000Z",
      "reviews.id": "0c26801e-9c93-410e-94fe-4d5adbfe4032",
      "reviews.rating": 5,
      "reviews.text": "We have our son Christian with autism he needs a tablet that can with stand being dropped these TABLETS are tough as nails."
    },
    {
      "reviews.date": "2017-12-08T00:00:00.000Z",
      "reviews.id": "3a75c971-9ace-493a-ab97-1f0740aeca35",
      "reviews.rating": 5,
      "reviews.text": "We have had cell phone service tablets for years, our kids need kid tablets. We bought 2! So cute and a great price..."
    },
    {
      "reviews.date": "2017-08-19T00:00:00.000Z",
      "reviews.id": "323b3a5b-c69c-4331-909b-a5cb190aa7ad",
      "reviews.rating": 2,
      "reviews.text": "I purchased the Kids kindle because of the warranty plan. Thinking it's the best deal for the money. I find it in no way user friendly for my ha me or my 3 year old granddaughter! She can take my iPad go strength to her folder."
    },
    {
      "reviews.date": "2017-12-25T00:00:00.000Z",
      "reviews.id": "7a71012c-31dd-44f4-a082-6ee23376e55c",
      "reviews.rating": 5,
      "reviews.text": "Great to use for my little one. She loves it awesome"
    },
    {
      "reviews.date": "2018-04-20T00:00:00.000Z",
      "reviews.id": "6c06f38d-1aad-4da3-9388-d1bce96ce882",
      "reviews.rating": 5,
      "reviews.text": "My son loves his \"tabwet\" lol. Hes got plenty of PJ Masks episodes and games plus much more."
    },
    {
      "reviews.date": "2018-01-24T00:00:00.000Z",
      "reviews.id": "f1cec238-1ad3-4792-a2a8-2caefa0ec959",
      "reviews.rating": 5,
      "reviews.text": "Very good first tablet for kids without breaking the bank. Have had no issues and the kids love them (ages 3 and 5)"
    },
    {
      "reviews.date": "2018-01-18T00:00:00.000Z",
      "reviews.id": "36ddcfc8-210c-486c-b18c-ba6cad9557fe",
      "reviews.rating": 5,
      "reviews.text": "Our daughter loves it. Has helped keep her engaged with the games and shows while traveling and running errands"
    },
    {
      "reviews.date": "2018-05-02T01:17:42.000Z",
      "reviews.id": "3504e900-6b6d-4fb4-8d65-b5e18cff0e46",
      "reviews.rating": 1,
      "reviews.text": "Waste of money,You tube does not work on these tablets,so everything from there old tablet does not work on the new ones,so going back to the old ones and sending these back"
    },
    {
      "reviews.date": "2018-01-22T00:00:00.000Z",
      "reviews.id": "ec36b2bf-7e18-4323-ab12-010d8da2487c",
      "reviews.rating": 5,
      "reviews.text": "Limited time by Mom but she says he loves it a lot"
    },
    {
      "reviews.date": "2018-02-24T00:00:00.000Z",
      "reviews.id": "35ca8c66-f876-4969-9ee5-8af608cce820",
      "reviews.rating": 4,
      "reviews.text": "My son loves it. Very easy for him to use. It's pretty durable as well."
    },
    {
      "reviews.date": "2018-07-31T01:23:53.000Z",
      "reviews.id": "1f36f5c0-1943-4d89-8dab-f368af05eceb",
      "reviews.rating": 5,
      "reviews.text": "Easy to set up. I havent given it to my daughter yet... as I am afraid she will turn into a screen freak but I will be using it for lo g car rides."
    },
    {
      "reviews.date": "2018-05-17T00:00:00.000Z",
      "reviews.id": "187111d7-5dfe-4199-ba74-37fe5a5798f2",
      "reviews.rating": 5,
      "reviews.text": "I love it. I‚Äôm so glade they made this tablet with protection. Love that my child can watch movies learn and play kid games."
    },
    {
      "reviews.date": "2018-07-25T11:44:51.000Z",
      "reviews.id": "673d8cf2-2036-4684-9b63-2294b8af128a",
      "reviews.rating": 5,
      "reviews.text": "Bought for grand daughters birthday after her tablet broke. She loves it! Only downside she can not get on YouTube. Love that it coverts to a parent tablet as well."
    },
    {
      "reviews.date": "2017-12-28T00:00:00.000Z",
      "reviews.id": "ad6a70d8-c1e5-4579-8f1b-783b882329b3",
      "reviews.rating": 5,
      "reviews.text": "I‚Äôm happy I got this tab for my daughter as a Xmas gift she‚Äôs in love with it!"
    }
  ]
}