{
  "id": "AVzvXXwEvKc47QAVfRhx",
  "dateAdded": "2017-06-28T15:41:40Z",
  "name": "Certified Refurbished Amazon Fire TV with Alexa Voice Remote",
  "asins": "B00UH4D8G2",
  "brand": "Amazon",
  "categories": "Amazon SMP,Categories,Streaming Media Players,Electronics,Fire TV,Digital Device 4",
  "primaryCategories": "Electronics",
  "keys": "certifiedrefurbishedamazonfiretvwithalexavoiceremote/b00uh4d8g2,amazon/53003706,0848719063264,848719063264",
  "manufacturer": "Amazon",
  "reviews": [
    {
      "reviews.date": "2017-03-12T00:00:00.000Z",
      "reviews.id": "8b3390d3-71de-4fbb-ae99-66dfaa2ae550",
      "reviews.rating": 1,
      "reviews.text": "Certified garbage! Lesson learned about paying attention to reviews. Fire TV box and remote was packaged like new, even included new batteries. After plugging it in it would only show Amazon logo and 'unknown boot' on screen. Cycled power several times and even tried to reset using remote buttons, no dice. I read all the negative reviews before I purchased this, I chose to take the chance so I'm angry with myself, but very disappointed with Amazon for even suggesting this is refurbished, let alone certified, as if that means something."
    },
    {
      "reviews.date": "2016-10-25T00:00:00.000Z",
      "reviews.id": "de3657fa-4e08-4389-9b1e-8e14724f92dd",
      "reviews.rating": 5,
      "reviews.text": "Love it, had the stick and it was kinda slow navigating. This one is much faster. Was going to use this and cancel cable. When I told my cable company I wanted to cancel and I was just going to stream everything they cut my bundle cost by 100. I kept cable but I also still use my firetv alot."
    },
    {
      "reviews.date": "2016-06-19T00:00:00.000Z",
      "reviews.id": "dd8fc1f7-9e62-4b91-8afd-e839f6fa0457",
      "reviews.rating": 5,
      "reviews.text": "This box is wonderful, meets my expectations plus some. I gave up cable and tried it. I don't watch a lot of movies but this box comes with a lot of selections in my opinion more than basic cable, and if you have prime even more selections, theres a lot of free shows just download the apps for them."
    },
    {
      "reviews.date": "2016-11-12T00:00:00.000Z",
      "reviews.id": "0365b9f0-4d2d-4a80-8e02-e6cbb5152d2e",
      "reviews.rating": 1,
      "reviews.text": "Stay away from the certified refurbished Amazon Fire TV. I received two Certified Refurbished defective fire TVs. The first the screen looked half corrupted, see the pictures. The second Certified Refurbished Amazon fire tv I received would not boot up, it was stuck in an infinite loop where I would only see the amazon logo for 10 seconds then it would boot up again.If anything, Amazon needs to re-visit its refurbishment process and quality control of the refurbished products they let get in consumer hands.Update 11/28/16: I purchased a new Fire TV during the BF sale and I have had no issues so far :)."
    },
    {
      "reviews.date": "2017-01-17T00:00:00.000Z",
      "reviews.id": "39b68325-ef59-440c-9d52-61fae1b8178b",
      "reviews.rating": 2,
      "reviews.text": "I bought this thing refurbished. I find that I have to unplug / plug back in the HDMI cable on a regular basis when switching inputs on the TV. Not sure if it is the Amazon Fire box itself or if it is the TV (Not likely).Otherwise it is a good device. I bought it for the ability to hard wire my Ethernet connection to my gigabit switch and for 4K capabilities which it does do. Having the Alexa app is handy but her features can be severely handicapped.I probably should have just bought it new..... usually refurbished devices work well as they are tested before resale and it was probably tough to catch that the HDMI port on these might be finicky. I may have to switch it out."
    }
  ]
}