{
  "id": "AVzYlGj3vKc47QAVeZRH",
  "dateAdded": "2017-06-24T05:30:23Z",
  "name": "Amazon Fire HD 8 with Alexa (8\" HD Display Tablet)",
  "asins": "B01J94SWWU",
  "brand": "Amazon",
  "categories": "Fire Tablets,Computers/Tablets & Networking,Tablets,All Tablets,Amazon Tablets,Computers & Tablets,Electronics,Amazon,Tablets & eBook Readers,Tablets & E-Readers",
  "primaryCategories": "Electronics",
  "keys": "amazonfirehd88tablet16gb7thgeneration2017releaseblack/9sia9587yv6014,amazon/53005678,amazonfirehd88tablet16gb7thgeneration2017releaseblack/253052099486,841667123295,amazon/b01j94swwu,allnewfirehd8tabletwithalexa8hddisplay16gbblackwithspecialoffers/b01j94swwu,amazonfirehd88tablet16gb7thgeneration2017releaseblack/9sia85v8k89132,amazonfirehd88tablet16gb7thgeneration2017releaseblack/5871311,amazonfirehd88tablet16gb7thgeneration2017releaseblack/201990338788,amazonfirehd88tablet16gb7thgeneration2017releaseblack/5822969,amazonfirehd88tablet16gb7thgeneration2017releaseblack/9siah9u8ke4777,amazonfirehd88tablet16gb7thgeneration2017releaseblack/5871308,detailsaboutamazonkindlefirehd8tablet16gbwalexa7thgen2017black/173503498222,amazonfirehd88tablet16gb7thgeneration2017releaseblack/5871309,amazonfirehd8tablet8150gbquadcore4core130ghz16gb1280x800inplaneswitchingipstechnologyblack1610aspectratiomicrosdmemorycardsupported/9sia22f6wj9941",
  "manufacturer": "Amazon",
  "reviews": [
    {
      "reviews.date": "2017-12-23T00:00:00.000Z",
      "reviews.id": "f36e97e5-1bcb-43ac-b1be-ffcbbe5a17cf",
      "reviews.rating": 4,
      "reviews.text": "This is a great tablet. I got it on Black Friday at an amazing price. The downside: a lot of features are only available to Amazon prime and audible members with an expensive membership fee and the selection of apps is limited. But on the other hand it‚Äôs inexpensive, the Alexa app is useful, games run ok, the display and photo quality is good and it‚Äôs easy to handle. For music and books I recommend an additional memory card - I use a 128GB - which works fine."
    },
    {
      "reviews.date": "2018-03-24T00:00:00.000Z",
      "reviews.id": "3ed7e376-5842-44f7-b715-de4c12d4ed90",
      "reviews.rating": 5,
      "reviews.text": "Excellent upgrade for my wife's original 7\" 8GB Fire Tablet. Great graphics and very powerful!"
    },
    {
      "reviews.date": "2018-03-13T00:00:00.000Z",
      "reviews.id": "0530d7aa-4a42-4c67-8827-db021c4548a7",
      "reviews.rating": 5,
      "reviews.text": "Got this gift as a present for Christmas for my son. He enjoys playing games on it and watching Netflix"
    },
    {
      "reviews.date": "2018-02-21T00:00:00.000Z",
      "reviews.id": "45a20c84-7000-4a1b-a3ad-c3cab5a4e60d",
      "reviews.rating": 5,
      "reviews.text": "This is well worth the money spent and I recommend it. The new upgrades are nice."
    },
    {
      "reviews.date": "2017-09-16T00:00:00.000Z",
      "reviews.id": "c750d270-300d-427f-9258-a55e8a70d400",
      "reviews.rating": 4,
      "reviews.text": "The great Best Buy associate helped fit us with the perfect computer for what we need. We love it."
    },
    {
      "reviews.date": "2017-08-14T00:00:00.000Z",
      "reviews.id": "61c021e2-db4d-4838-97b7-bd91d132e42e",
      "reviews.rating": 5,
      "reviews.text": "I bought the Fire HD 8 with 16MB ram on sale for $49.99 ($30 off sale and tax free day). My intent is to use it primarily to surf the internet while on the couch in front of the TV or in bed. If you've been using your cell phone to surf the internet at home this is a great solution for a more comfortable experience.Like others have stated, the Amazon Fire O/S is an Android flavor that Amazon modified and as such you can easily install the Google Playstore which allows you to download most of your favorite apps. You don't have to \"hack\" it to do this and installing the Google Playstore allows you to install the Chrome browser among other things. Basically, the Google apps and the Amazon Fire apps can coexist together so you don't have to remove any of the Amazon content or apps. Install Chrome, Gmail, Youtube, a nicer keyboard app and many Google apps as you like.Also, for those concerned that about the Amazon advertisements that show up ONLY ON THE LOCK SCREEN don't sweat it. No, you don't have to pay Amazon the extra $15 for an ad free lock screen. Simply call Amazon or open up a chat window with an Amazon rep and ask them to kindly remove the advertisements. It takes two minutes for them to do it remotely and apparently Amazon wants you to be a happy customer so they'll gladly do this for free.For $49.99 I'm very happy with the Amazon Fire HD 8. Lastly, I recommend the ZtoTop version of the case, the version with the built in handle that allows you to slide your hand in the backstrap to easily hold it without effort."
    },
    {
      "reviews.date": "2018-02-21T00:00:00.000Z",
      "reviews.id": "91fed62f-4049-41da-bdf8-e2b89dd33a25",
      "reviews.rating": 5,
      "reviews.text": "I bought my grandson this tablet because it was easy to use and it was at a awesome price."
    },
    {
      "reviews.date": "2017-08-25T00:00:00.000Z",
      "reviews.id": "8f334ca3-8ca8-41eb-bca6-e95bcaefd0ea",
      "reviews.rating": 5,
      "reviews.text": "I love this tablet. Very responsive and fast for a cheap tablet. just the right size! I bought 2 of them! the battery last a long time also! HIGHLY recommend it! It has Alexa built into it also!"
    },
    {
      "reviews.date": "2017-08-16T00:00:00.000Z",
      "reviews.id": "f443722d-0bba-4498-83a4-3f81f04e06a4",
      "reviews.rating": 5,
      "reviews.text": "Sharp screen, surprisingly quick web surfing with the Silk browser. Easy to add Google Store (albeit without Amazon's support) so you may add Google apps such as PlayBooks, etc. So you're not really locked into Amazon's ecosystem. The lockscreen ads are only seen for a few moments after you press the standby button and then swipe; so you won't even be tempted to pay Amazon the extra $ to have them remove it (remotely). Very happy."
    },
    {
      "reviews.date": "2017-12-02T00:00:00.000Z",
      "reviews.id": "c000a619-4c8c-4029-811f-bb070b5fbf17",
      "reviews.rating": 5,
      "reviews.text": "What can be said. For the sale price of $50.00 this was a great purchase. Not a high end tablet but for ebooks, movies, email and web browsing I have no complaints."
    },
    {
      "reviews.date": "2017-07-07T00:00:00.000Z",
      "reviews.id": "c146784b-f184-4d36-b824-c1b222215d40",
      "reviews.rating": 5,
      "reviews.text": "Gift to my sister and she is loving it. It was a sweet deal!!"
    },
    {
      "reviews.date": "2018-06-03T18:06:56.000Z",
      "reviews.id": "bf5438fb-3655-49b1-8355-fb972cdfd8f9",
      "reviews.rating": 5,
      "reviews.text": "You may be locked into Fire OS, but for 90 of what you do on a tablet it is not a problem."
    },
    {
      "reviews.date": "2018-01-17T00:00:00.000Z",
      "reviews.id": "e485baee-63f1-4682-b9fc-0eccc457c5e7",
      "reviews.rating": 5,
      "reviews.text": "I love my new Kindle the screen is great and I love the fact that you can add an sd card for more storage. However, the speaker sounds like mono instead of stereo. The sound is loud and clear but it would have been great if they had a speaker on each side of the Kindle."
    },
    {
      "reviews.date": "2018-03-26T16:11:47.000Z",
      "reviews.id": "1f6d76ad-2e8e-47c7-b115-dca969e322ce",
      "reviews.rating": 5,
      "reviews.text": "I bought this for my MIL, who loves Kindle and podcasts, but finds it harder to get to her desktop to get online. This tablet has me thinking seriously why I paid nearly 1,000 for an ipad (my 4th). The screen is gorgeous and the setup is easy. Ok, I'll confess, I bought it because of the yellow body--our favorite color and easy to find in a pile of books!"
    },
    {
      "reviews.date": "2018-02-02T00:00:00.000Z",
      "reviews.id": "4f49d6ce-2792-4dd4-a1da-d520aea02e01",
      "reviews.rating": 5,
      "reviews.text": "While there are many budget tablets out there, not all of them are functional. This one is. If you are part of the Amazon universe this links seamlessly. Book purchases sync without effort. Movies are easy to see on Amazon Prime and you can use Netflix also. Alexa is an added bonus. Not sure the camera will get much use but it is there if you want it. Amazon is slowly opening up their market place to other popular apps so expect more. (Note: I turned off the WiFi and just used this as an e-reader and didn't have to charge it for almost 2 weeks!)"
    },
    {
      "reviews.date": "2017-12-27T00:00:00.000Z",
      "reviews.id": "75f52008-675e-4ced-8c20-d6c34a6c8e7d",
      "reviews.rating": 4,
      "reviews.text": "For the money you can't beat what you get. iPads still rule and are far better when you aren't connected to wifi but given the cost difference I think this is the best andriod to compete with it."
    },
    {
      "reviews.date": "2017-07-14T00:00:00.000Z",
      "reviews.id": "6352becc-02ab-479f-87e8-829eae5281e4",
      "reviews.rating": 5,
      "reviews.text": "This tablet is great if you have Amazon Prime. You really cant beat it for the price. I also have the 7\" version."
    },
    {
      "reviews.date": "2017-08-04T00:00:00.000Z",
      "reviews.id": "95437cab-5457-48c0-90ce-6aa7eedf1f98",
      "reviews.rating": 1,
      "reviews.text": "This is unacceptable spend the extra money for a tablet without obtrusive software and advertising"
    },
    {
      "reviews.date": "2018-03-03T00:00:00.000Z",
      "reviews.id": "350030d3-2a03-4626-9c1f-f373577c269c",
      "reviews.rating": 4,
      "reviews.text": "While it isn't the most powerful tablet on the market it does what it was designed to do. It gets on the social media sites and the internet. If you're expecting more from yoru tablet then don't look for one at this price. You'll need the more powerful ones that translate to bigger price tags. I've watched movies on this from my Amazon prime account and have read my books from my Kindle account and everything works well. It's not at lightening speed but it does get there in a timely manner!"
    },
    {
      "reviews.date": "2017-06-21T00:00:00.000Z",
      "reviews.id": "30e4513e-df71-4739-a9ae-ae7c811f998b",
      "reviews.rating": 4,
      "reviews.text": "If it weren't for the limitations of the tablet to just Amazon things, this would've been a great tablet overall.The battery is good, Display is decent for reading."
    },
    {
      "reviews.date": "2017-11-03T02:11:53.000Z",
      "reviews.id": "0d39e148-3b84-4caf-b8fe-bc159d6a266a",
      "reviews.rating": 5,
      "reviews.text": "My grandchildren have mastered the Kindles. They are ages 5-10 and can do anything with them. I have some avid readers and the four have discovered how to play games against each other with each having a kindle. I love this kindle. It was easy to download everything and link to internet."
    },
    {
      "reviews.date": "2017-12-23T00:00:00.000Z",
      "reviews.id": "12916c3b-75e6-42e7-a5e8-7c266190f086",
      "reviews.rating": 5,
      "reviews.text": "Gift for Nana. She said it was so easy to set up. Picture is great. Also it is much faster than her older model!"
    },
    {
      "reviews.date": "2017-06-30T00:00:00.000Z",
      "reviews.id": "947ef60d-e316-47ae-978d-22ffeb18d40a",
      "reviews.rating": 4,
      "reviews.text": "Much better than my older Kindel. This is my third Kindel. They just keep getting better."
    },
    {
      "reviews.date": "2018-03-21T00:00:00.000Z",
      "reviews.id": "9f78fb7f-994a-4ee0-86bb-0fdac1a13900",
      "reviews.rating": 5,
      "reviews.text": "Great product I use at night to watch shows on, play games and listen to music."
    },
    {
      "reviews.date": "2018-01-12T00:00:00.000Z",
      "reviews.id": "c68a8aed-7c7c-42e7-a013-03321bdedc47",
      "reviews.rating": 5,
      "reviews.text": "I purchased this for my 80 year old mother in law and she loves it!! It is very easy for her to use and read the screen."
    },
    {
      "reviews.date": "2018-02-26T00:00:00.000Z",
      "reviews.id": "719f96a2-1ac3-4f17-9635-0c903794d01b",
      "reviews.rating": 5,
      "reviews.text": "I bought this tab for my 5 years old kid.The tab is excellent and my son liked it very much."
    },
    {
      "reviews.date": "2017-12-15T00:00:00.000Z",
      "reviews.id": "50169037-80b9-47c1-9eca-e6247cf167a7",
      "reviews.rating": 4,
      "reviews.text": "I love the Amazon fire. It is very user friendly. It's great for reading books, streaming music, and watching movies."
    },
    {
      "reviews.date": "2018-01-17T00:00:00.000Z",
      "reviews.id": "40e6283a-3b48-4a7e-9fab-37b2e509e466",
      "reviews.rating": 5,
      "reviews.text": "Cannot beat the price for this Fire HD 8inch tablet--just the right size and during Black Friday, it was less than $50. Graphics are superb, tablet very easy to use."
    },
    {
      "reviews.date": "2018-01-03T06:40:06.000Z",
      "reviews.id": "22a7a68e-9a00-472a-8f23-1c063e9731cc",
      "reviews.rating": 5,
      "reviews.text": "Great value for the price.."
    },
    {
      "reviews.date": "2017-12-23T00:00:00.000Z",
      "reviews.id": "11e6c8c4-b90c-4e6b-976f-e1938fbc07fc",
      "reviews.rating": 5,
      "reviews.text": "We purchased item as a Christmas gift. Was a hit for sure"
    },
    {
      "reviews.date": "2017-06-27T00:00:00.000Z",
      "reviews.id": "d744af33-3867-45cb-a1cf-a17df1e9a35c",
      "reviews.rating": 5,
      "reviews.text": "Now, I didn't expect this to be an amazing tablet, but people were generally saying it was snappy enough. I wanted a media tablet. Something I could use late at night to watch YouTube videos or an episode of my favorite show while laying in bed. I also like it for online shopping so I don't have to hold a laptop but am not looking at my phone screen.PROS:Tablet exceeded my expectations. It's great for media. I use this more than my phone and my laptop now.It's snappy, I was able to complete my homework for online classes, watch videos from CNN and other tasks without too much struggleIt can be a general purpose tablet. HEED MY WARNING doing the following may void your warranty with Amazon, I'm not sure. But I installed the Google play store on my fire HD 8 and now have access to a huge selection of apps. I decided to do this after finding there was no good YouTube app from Amazon's app store. Because fire OS is basically Android with a heavy skin on it, everything runs perfectly as you can see from the pictures.SOUND IS FANTASTIC!!!! Did I say that loud enough? Yes they are still tablet speakers, no they won't fill your whole room with bumping bass but MY GOSH these are some GOOD tablet speakers. Better than my $900 smartphone, $1000 laptop and $500 iPad. What I'm trying to say is, the speakers are way better than the price point would suggest. Bravo Amazon.CONS:Ram is lacking. Doesn't excel in multitasking, drops tasks while you're away even if it was the last thing you were doing. It does this randomly however, and it's not always a problem. When it is it's very annoying.Screen is meh. It's good enough to not be a bother but coming from a 4k laptop and AMOLED display on my Google pixel XL, the screen is lacking. To the standard user, I don't think it will be noticeable though, and looks pretty good.Case and screen protector selection are sad and limited. Hopefully that changes soon as this tablet was just released this month.Cameras are useless. Not what I bought the tablet for so it didn't bother me one bit, but don't buy it for the cameras, a potato could take better photos.CONCLUSION:So overall I adore this tablet. I use it every day and now that I can have my Google apps and such on it, it is a fully functional Android tablet. It's wonderful, suits my needs, and hasn't disappointed me yet. Highly recommend."
    },
    {
      "reviews.date": "2017-12-09T19:32:24.000Z",
      "reviews.id": "4dc56a6a-d1bc-457a-afc0-da919fc05d44",
      "reviews.rating": 5,
      "reviews.text": "Unbelievable price. Purchased two, one for myself and gift for grandchild. Shipped and arrived with 3 days!"
    },
    {
      "reviews.date": "2017-12-28T00:33:21.000Z",
      "reviews.id": "d1070317-7b05-42c4-80ae-74445e0ffe88",
      "reviews.rating": 5,
      "reviews.text": "It is a great tablet. Especially one to carry around in a backpack because it is also tough. It was a great price on it also."
    },
    {
      "reviews.date": "2017-07-07T00:00:00.000Z",
      "reviews.id": "e3bd3415-bbd2-4499-9d82-e9354b32a12f",
      "reviews.rating": 5,
      "reviews.text": "I love my fire hd I have read four books and play all my games on it.......it is an awesome deal for seventy-nine dollars .......it is a great tablet........like I said I love it ......"
    },
    {
      "reviews.date": "2017-09-05T15:01:00.000Z",
      "reviews.id": "b893c9a5-83ba-4e4e-ab7c-b1865ac0709f",
      "reviews.rating": 5,
      "reviews.text": "Excellent for the price point. Light weight, good display, connectivity is good, runs pretty smooth, and it's better than getting an iPad and spending hundreds of dollars. This is worth the price and this will be my tablet of preference from now on."
    },
    {
      "reviews.date": "2017-12-18T00:00:00.000Z",
      "reviews.id": "be3f9ffa-22c8-4c59-9734-1cca3e134e5d",
      "reviews.rating": 5,
      "reviews.text": "Bought this product for a friend and she loves it. I plan to buy myself one now."
    },
    {
      "reviews.date": "2018-01-13T00:00:00.000Z",
      "reviews.id": "21f1235e-3f04-48c0-8a1e-7e1a7a157bbc",
      "reviews.rating": 1,
      "reviews.text": "Its very cool great picture good sound. Was kind of disappointed that i couldnt make calls but overall great piece of hardwark"
    },
    {
      "reviews.date": "2017-12-08T00:00:00.000Z",
      "reviews.id": "6d14a229-40f7-4970-bf86-e78dc13e3923",
      "reviews.rating": 5,
      "reviews.text": "Its good tablet. Cheap and nice items and nice service"
    },
    {
      "reviews.date": "2018-02-17T12:49:33.000Z",
      "reviews.id": "d94979ab-c350-417a-a248-ef70aca52358",
      "reviews.rating": 5,
      "reviews.text": "It was ready when Target said it would be and the product is outstanding."
    },
    {
      "reviews.date": "2017-12-01T00:00:00.000Z",
      "reviews.id": "5b020516-f4e4-4f74-a787-acae64c1a472",
      "reviews.rating": 5,
      "reviews.text": "Purchased for my god daughter as a gift easy to use would recommend this product for young and old"
    },
    {
      "reviews.date": "2017-12-29T00:00:00.000Z",
      "reviews.id": "5e4f1282-4f03-436c-98d4-d5b6b06e96ce",
      "reviews.rating": 4,
      "reviews.text": "Use this to watch Netflix instead of my phone. Much larger screen size and battery life is good."
    },
    {
      "reviews.date": "2017-12-02T00:00:00.000Z",
      "reviews.id": "18074f2e-4c55-41bb-82a9-a6d6628cb18e",
      "reviews.rating": 4,
      "reviews.text": "Bought for reading Kindle books. Large selection of books."
    },
    {
      "reviews.date": "2017-07-20T00:00:00.000Z",
      "reviews.id": "75b5114c-2ca3-48b5-b844-644835404539",
      "reviews.rating": 5,
      "reviews.text": "Good product, iPads are great! This idea was a gift and hit a homerun!"
    },
    {
      "reviews.date": "2017-08-16T00:00:00.000Z",
      "reviews.id": "b06afc69-9070-4efa-ad47-f567b2371951",
      "reviews.rating": 4,
      "reviews.text": "Camera build to be improved.. play store needs more apps"
    },
    {
      "reviews.date": "2017-12-22T00:00:00.000Z",
      "reviews.id": "1ebe9371-f48b-414a-aa18-af48de72b1f8",
      "reviews.rating": 4,
      "reviews.text": "The product works great, just a little on the small side."
    },
    {
      "reviews.date": "2017-12-08T00:00:00.000Z",
      "reviews.id": "81ffa06b-f7aa-4314-aa7e-1c39cc717cfb",
      "reviews.rating": 4,
      "reviews.text": "I like the speed and layout. Not a lot of options with the apps. But so far okay."
    },
    {
      "reviews.date": "2018-03-23T00:00:00.000Z",
      "reviews.id": "59f2120c-b047-4b73-b11e-620520930bc4",
      "reviews.rating": 4,
      "reviews.text": "This is a good and easy to use tablet, but i returned it because i found it cheaper."
    },
    {
      "reviews.date": "2017-11-03T00:00:00.000Z",
      "reviews.id": "e2b6c943-3054-438a-860a-a4f80dbfe325",
      "reviews.rating": 5,
      "reviews.text": "Bought it for my aunt and she loved it she even told me to buy it for her friend"
    },
    {
      "reviews.date": "2017-12-22T00:00:00.000Z",
      "reviews.id": "bfbaf330-579b-4e7c-8156-107232a03bfb",
      "reviews.rating": 5,
      "reviews.text": "For $50its a great 8in tablet, quality and speed was not what expected. It's fast and video quality is great"
    },
    {
      "reviews.date": "2017-12-20T00:00:00.000Z",
      "reviews.id": "33484e42-f630-4993-af44-73b4046770fd",
      "reviews.rating": 5,
      "reviews.text": "Love i upgraded from the reg fire tablet big difference. It's great for the price. My son who is 12 now wants one."
    },
    {
      "reviews.date": "2018-03-31T00:00:00.000Z",
      "reviews.id": "e7770993-5a2c-4a09-a4f9-e2ad11bad096",
      "reviews.rating": 4,
      "reviews.text": "That was for my husband, he really loves this product,watching news,movies and video music.."
    },
    {
      "reviews.date": "2018-01-06T00:00:00.000Z",
      "reviews.id": "31072797-dae0-4f39-bc69-c6c2669d2edf",
      "reviews.rating": 5,
      "reviews.text": "This is a very good item.Gets the job done.Works great."
    },
    {
      "reviews.date": "2017-12-01T00:00:00.000Z",
      "reviews.id": "e65e0768-bcd8-4733-b10b-b35ffa2fa8d7",
      "reviews.rating": 4,
      "reviews.text": "Not as full featured as an iPad, and not nearly as extensive of an app selection, but great for kids or older parents that really just want to play Candy Crush"
    },
    {
      "reviews.date": "2017-07-07T00:00:00.000Z",
      "reviews.id": "b1caf2b6-e75d-4a67-a758-998ddecb5677",
      "reviews.rating": 5,
      "reviews.text": "Dad loves it. A little bigger than his last. Way better picture. Good camera. Easy to set up."
    },
    {
      "reviews.date": "2017-12-22T00:00:00.000Z",
      "reviews.id": "9b8a2e0c-63a2-4c3f-8c72-7e3505559194",
      "reviews.rating": 5,
      "reviews.text": "Bought this for my wife. Upgrade from fire 7in but now the 8in is in HD. At $50 a steal."
    },
    {
      "reviews.date": "2017-12-08T00:00:00.000Z",
      "reviews.id": "d2c337db-5159-4bc1-b179-9526a574ae40",
      "reviews.rating": 4,
      "reviews.text": "Will be donated for needy kids . Replacing stolen Christmas gifts gathered for St LAWRENCE church Buffalo NY"
    },
    {
      "reviews.date": "2017-12-08T00:00:00.000Z",
      "reviews.id": "7fc6177e-b31c-4d7d-9ab2-9781a6085c03",
      "reviews.rating": 5,
      "reviews.text": "Came in one piece looks great but haven't used it."
    },
    {
      "reviews.date": "2017-12-08T00:00:00.000Z",
      "reviews.id": "9b88d973-2276-44a3-a11b-21bece5a794d",
      "reviews.rating": 5,
      "reviews.text": "Wanted to upgrade my grandaughter's kindle. I know she will enjoy it as much as her previous one."
    },
    {
      "reviews.date": "2017-09-12T00:00:00.000Z",
      "reviews.id": "ba64d9b9-d977-450b-8052-a6c4601130d4",
      "reviews.rating": 5,
      "reviews.text": "Works great especially if you have Amazon prime and other Amazon devices. Connect all of your Amazon devices to your wifi and suddenly your home just got smarter. The tablet is quick and snappy, and the battery life is astounding! I went about a week straight of 2-3 hours of use before it finally needed charging. Overall I am happy with this purchase!"
    },
    {
      "reviews.date": "2017-11-29T00:00:00.000Z",
      "reviews.id": "4b70c3ed-8d41-4367-9e9a-4633be3d92b0",
      "reviews.rating": 4,
      "reviews.text": "I bought this for my toddler. I love the parental control feature, that way my toddler isn‚Äôt mistakenly purchasing videos or watching what I don‚Äôt want them too."
    },
    {
      "reviews.date": "2018-01-03T00:00:00.000Z",
      "reviews.id": "bd044c80-19c3-46aa-9661-e5b9c21dd150",
      "reviews.rating": 5,
      "reviews.text": "The tablet works great for basic apps like facebook and candy crush. my father likes how easy it is to use."
    },
    {
      "reviews.date": "2018-03-22T00:00:00.000Z",
      "reviews.id": "8145beaa-fb57-4327-87a3-d9b86a3f437d",
      "reviews.rating": 5,
      "reviews.text": "Great first tablet for 6 year old, purchased with a slicone case for protection. Best Buy had great holiday pricing."
    },
    {
      "reviews.date": "2018-01-25T00:00:00.000Z",
      "reviews.id": "99580937-e2ad-49de-b68d-51bf23626cc2",
      "reviews.rating": 4,
      "reviews.text": "My granddaughter loves it. She loves playing the games and downloads books to read. I am so glad I got it for her."
    },
    {
      "reviews.date": "2017-12-08T00:00:00.000Z",
      "reviews.id": "60ebf813-55db-4912-85c9-8b88accc3481",
      "reviews.rating": 4,
      "reviews.text": "Product is great for a teenager to play games and read books."
    },
    {
      "reviews.date": "2018-01-21T00:00:00.000Z",
      "reviews.id": "438aa84a-2095-44de-87a2-5b391d8eb26d",
      "reviews.rating": 5,
      "reviews.text": "Has a wonderful display and is very dependable. They are on it alot and never complain about stalls and such, they do alot on it from games to reading to watching videos with no problem."
    },
    {
      "reviews.date": "2017-12-08T00:00:00.000Z",
      "reviews.id": "2e6bc636-8ad8-40f1-88a7-2d9999c8c816",
      "reviews.rating": 5,
      "reviews.text": "Lots of space for all my kids apps and games theyre gonna love these!!! Cant wait to see their faces!!!"
    },
    {
      "reviews.date": "2018-05-06T00:00:00.000Z",
      "reviews.id": "4869ca8f-7a33-45b9-beed-298200cab8d7",
      "reviews.rating": 4,
      "reviews.text": "It doesn't compete with the iPad in terms of screen resolution or performance but for the price it does remarkably well. Battery life is outstanding compared to the 7\" fire. Very pleased with the purchase."
    },
    {
      "reviews.date": "2018-01-06T00:00:00.000Z",
      "reviews.id": "8c6ed541-8eab-410a-83b2-0250304f53ee",
      "reviews.rating": 5,
      "reviews.text": "My daughter loves her new tablet. Her and my other daughter we're sharing and Samsung tablet but because in such a fan of Amazon I decided to do research and I ended up getting here this one and she loves it. She even said it has more features than her previous one."
    },
    {
      "reviews.date": "2018-03-30T00:00:00.000Z",
      "reviews.id": "60b59bf4-8b86-427f-a7c1-6558c3384dd7",
      "reviews.rating": 4,
      "reviews.text": "Good portable video /tv access.Able to view my subscription TV live shows when traveling."
    },
    {
      "reviews.date": "2017-12-01T00:00:00.000Z",
      "reviews.id": "3810ff72-1003-4578-96a5-81dd2ced5436",
      "reviews.rating": 4,
      "reviews.text": "Overall good performance. It works fast and comes with many apps"
    },
    {
      "reviews.date": "2017-06-21T00:00:00.000Z",
      "reviews.id": "17cbe5dc-f991-41e5-9565-038adf9cfe94",
      "reviews.rating": 5,
      "reviews.text": "Better cost value than IPads. Tablet is user friendly and convenient. Anyone can use this"
    },
    {
      "reviews.date": "2018-01-21T00:00:00.000Z",
      "reviews.id": "8644bac5-2236-4633-b908-2a0b8ad75d4c",
      "reviews.rating": 5,
      "reviews.text": "Great product that does everything I need it to be"
    },
    {
      "reviews.date": "2017-07-28T00:00:00.000Z",
      "reviews.id": "b31b13b3-30d7-43f8-a0f0-e3b44bb1306d",
      "reviews.rating": 5,
      "reviews.text": "This generation of kindle fire is excellent. The addition of alexa was key."
    },
    {
      "reviews.date": "2017-08-11T00:00:00.000Z",
      "reviews.id": "0e236be6-8f98-4d04-a3a2-23e0b391eebf",
      "reviews.rating": 5,
      "reviews.text": "This is a great tablet. Does everthing and more that a tablet should do."
    },
    {
      "reviews.date": "2017-07-19T00:00:00.000Z",
      "reviews.id": "cfa7ad5b-c3bb-4051-86fc-aaf7ba14ed3e",
      "reviews.rating": 5,
      "reviews.text": "Great product. It was easy to set it up and had it running in no time flat. Was a gift for me mom Who is tech challenged, she was using it very quickly."
    },
    {
      "reviews.date": "2017-12-23T00:00:00.000Z",
      "reviews.id": "7532d0b0-6c31-47d4-aa97-fbdbced11170",
      "reviews.rating": 5,
      "reviews.text": "The Kindle Fire HD was a replacement for a previous generation fire and the improvements are noticeable. Thinner profile and much nicer screen image are immediately noticeable. Video loooks great and the features on the Fire are outstanding for such a low price point. Highly recommended for a basic tablet as compared to far more expensive options."
    },
    {
      "reviews.date": "2017-08-16T00:00:00.000Z",
      "reviews.id": "9ec617db-7cab-43e1-8c65-5df1b85313d6",
      "reviews.rating": 4,
      "reviews.text": "Bought for my daughter. Has everything she needs, great value"
    },
    {
      "reviews.date": "2018-01-05T00:00:00.000Z",
      "reviews.id": "101afd02-505d-43da-975d-0822f22afeba",
      "reviews.rating": 5,
      "reviews.text": "Bought this as a gift for my 66 yr old dad. He loves it. Uses it everyday. Easy to learn and navigate. Would highly recommend for an alternative to the expensive ipads."
    },
    {
      "reviews.date": "2017-08-25T00:00:00.000Z",
      "reviews.id": "59608c25-11cd-4dbc-9db8-503bb42b0eeb",
      "reviews.rating": 5,
      "reviews.text": "Bought this for my son and he loves it.I will recommenf this tablet"
    },
    {
      "reviews.date": "2017-08-13T00:00:00.000Z",
      "reviews.id": "39aed3f8-36a8-4271-812e-3bd6cb5121c6",
      "reviews.rating": 5,
      "reviews.text": "Easy to to set up & operate very lite weight nice color"
    },
    {
      "reviews.date": "2018-01-17T00:00:00.000Z",
      "reviews.id": "ea4cbc80-239f-4c45-b14e-e0abc2a72692",
      "reviews.rating": 4,
      "reviews.text": "Great tablet for simple uses... not an iPad but it performs the base needs"
    },
    {
      "reviews.date": "2017-12-01T00:00:00.000Z",
      "reviews.id": "fef02609-b885-4662-b0b2-f0c5813b0962",
      "reviews.rating": 5,
      "reviews.text": "I love it, excellent tablet, fast, portable, good."
    },
    {
      "reviews.date": "2017-08-25T00:00:00.000Z",
      "reviews.id": "dde2fa72-9c32-4455-8b18-6606dbf9e46b",
      "reviews.rating": 5,
      "reviews.text": "I love this tablet, amazon did a great job with this one, Alexa is an added plus"
    },
    {
      "reviews.date": "2017-12-16T00:00:00.000Z",
      "reviews.id": "3e3828fc-1cc9-4b2f-979d-763a47a9e942",
      "reviews.rating": 5,
      "reviews.text": "I was pleasantly surprised by the power and versatility of this tablet, so glad I got the 8\" screen version."
    },
    {
      "reviews.date": "2017-12-20T00:00:00.000Z",
      "reviews.id": "650eafd1-b2b2-4c52-8caf-97f1d7a13bb8",
      "reviews.rating": 5,
      "reviews.text": "This is a nice size for holding and viewing. I debated on getting the next size up but glad I didn't. You can also create different profiles. I set up a separate profile for my granddaughter and it allowed me to add restrictions so she can't access certain things or make purchases in apps. It also gave me a 30 day free trial for Amazon FreeTime which has so much content just for children. Happy with the price and product."
    },
    {
      "reviews.date": "2017-12-20T00:00:00.000Z",
      "reviews.id": "f9833255-88ad-4cc9-b717-12dde7dc42e6",
      "reviews.rating": 5,
      "reviews.text": "This tablet is small and practical. Very convenient and fast."
    },
    {
      "reviews.date": "2017-07-14T00:00:00.000Z",
      "reviews.id": "155012f0-40cb-4266-9ba9-cc7e09e2a916",
      "reviews.rating": 5,
      "reviews.text": "We bought this for our three year old son. He loves it. Plus it has many options for us to keep him from seeing things he shouldn't. The layout is really simple also making it great for children or adults!"
    },
    {
      "reviews.date": "2017-12-01T00:00:00.000Z",
      "reviews.id": "3f88d3f9-9b2c-42bb-8e1d-61839456b754",
      "reviews.rating": 5,
      "reviews.text": "This tablet is easy to use and has every app avail"
    },
    {
      "reviews.date": "2017-09-20T00:00:00.000Z",
      "reviews.id": "1f1f3c0e-9b47-4da9-9b76-19589ffdc4e0",
      "reviews.rating": 4,
      "reviews.text": "Tablet is easy to use. Wish there were more paper instructions"
    },
    {
      "reviews.date": "2017-12-21T00:00:00.000Z",
      "reviews.id": "6afb1001-dc7c-465d-9889-c17e34b045bc",
      "reviews.rating": 5,
      "reviews.text": "If you are an Amazon customer and just want a simple tablet this fits the bill and works great. Not an iPad but not $300++ either!"
    },
    {
      "reviews.date": "2017-12-03T00:00:00.000Z",
      "reviews.id": "21f38caa-bb9e-4296-bb90-5b8f00677fb8",
      "reviews.rating": 5,
      "reviews.text": "I grabbed this for a friend for christmas. He seems very happy with it"
    },
    {
      "reviews.date": "2017-12-01T00:00:00.000Z",
      "reviews.id": "2862d705-d66f-458c-8107-fdc7b3238ab2",
      "reviews.rating": 5,
      "reviews.text": "works great, easy to read, portable, great value for the money"
    },
    {
      "reviews.date": "2017-08-25T00:00:00.000Z",
      "reviews.id": "0b3e14ce-c62d-4eee-9603-201060d5b736",
      "reviews.rating": 5,
      "reviews.text": "I had a kindle before purchasing this product. I love the new features and color screen. It is easy to read at night and the filter to remove the blue light eliminates the eye strain. I had it read short stories to me at bed time last night. That is a great feature."
    },
    {
      "reviews.date": "2017-08-21T00:00:00.000Z",
      "reviews.id": "ae91d94d-2d4e-460a-b8fd-528161a498c2",
      "reviews.rating": 5,
      "reviews.text": "Love these tablets so much. This is the third one I purchased for someone else in the family"
    },
    {
      "reviews.date": "2017-12-20T00:00:00.000Z",
      "reviews.id": "a420cab5-2d35-49be-b5fe-b4151802618e",
      "reviews.rating": 5,
      "reviews.text": "I've owned a couple iPads, three Samsung Galaxy Tabs, and I can without question say that this Fire 8HD is my favorite out of all. The 16Gig version is all you need. Why? Becuase the micro-sd card expands to 256 gig and the programs can be installed to the external drive...saving the valuable internal for the operating system. Samsung should do the same...if they did, I'd probably wouldn't have bought the Fire, but I'm so glad I did!! Love, love, love it!!"
    },
    {
      "reviews.date": "2017-07-28T00:00:00.000Z",
      "reviews.id": "625f5887-b5f7-47b8-b0f9-39fbe5129e0a",
      "reviews.rating": 5,
      "reviews.text": "The extra ram makes all the difference regarding speed and responsiveness"
    },
    {
      "reviews.date": "2018-01-04T00:00:00.000Z",
      "reviews.id": "1b110837-3c11-48d5-be55-13a5575154c9",
      "reviews.rating": 4,
      "reviews.text": "Compared to last years 7' this is a worthy upgrade. More storage and screen size by default. The OS is much more improved on the new hardware and is actually snappy and responsive. My only gripe is the old type connection that kids love to either try force in upside down or break by bending. They should have moved to usb-c. Other than that, great product for the price"
    },
    {
      "reviews.date": "2017-12-08T00:00:00.000Z",
      "reviews.id": "cac03630-f054-43f8-bd01-d85ad8974185",
      "reviews.rating": 4,
      "reviews.text": "The reviews are good. It is a Xmas gift, so the person receiving it has not tried it."
    },
    {
      "reviews.date": "2017-12-26T16:57:42.000Z",
      "reviews.id": "8ba2016d-c0a7-4421-a1d8-26ea8fb3ee77",
      "reviews.rating": 5,
      "reviews.text": "Love it! Brought it for a gift for myself.. I'm really enjoying it! Great price too!"
    },
    {
      "reviews.date": "2017-07-29T00:00:00.000Z",
      "reviews.id": "67cf3ec8-1e3a-4d19-a940-6dee06891c4f",
      "reviews.rating": 5,
      "reviews.text": "I recently purchased the Kindle Fire 8 to replace a lost Kindle HD. The Fire 8 is an excellent upgrade and much better than the HD. The Fire 8 was recommended by one of the Best Buy staff that was very knowledgeable on the product. I highly recommend the Fire 8 and Best Buy"
    },
    {
      "reviews.date": "2017-07-21T00:00:00.000Z",
      "reviews.id": "1da223a5-499b-404c-bdb9-3136629e0320",
      "reviews.rating": 5,
      "reviews.text": "Very comfortable and easy to use. Has plenty of storage for my usage. I mainly use it for books, internet and old school games( solitair, sodium and crossword puzzles."
    },
    {
      "reviews.date": "2017-11-15T00:00:00.000Z",
      "reviews.id": "0b83ff24-0896-4619-9cd1-9d2150fcc8b6",
      "reviews.rating": 5,
      "reviews.text": "I am so happy I bought this. Just enough for surfing and reading. Took it on vacation. Nice to be able to check on things and to get info on the area you are visiting without having to take a laptop. Best purchase. Great price."
    },
    {
      "reviews.date": "2017-12-26T00:00:00.000Z",
      "reviews.id": "ce3a4acd-bde6-4120-aafc-2736b8468a1d",
      "reviews.rating": 5,
      "reviews.text": "I bought this for my daughter. She loves it. Great value, and easy to use!"
    },
    {
      "reviews.date": "2018-01-08T00:00:00.000Z",
      "reviews.id": "d685835b-d5b1-4ffb-b89a-22cd1cc7293d",
      "reviews.rating": 5,
      "reviews.text": "Love the fire hd but I returned this for the 32gb."
    },
    {
      "reviews.date": "2018-01-03T00:00:00.000Z",
      "reviews.id": "3db3ae9e-a65c-4ff1-9dcb-4ffea927d43f",
      "reviews.rating": 5,
      "reviews.text": "This is my first kindle or fire or even an ereader but I love it! I can't put it down!"
    },
    {
      "reviews.date": "2018-04-19T00:00:00.000Z",
      "reviews.id": "653dfcfd-5aed-40b0-b2f8-0cde79a443d8",
      "reviews.rating": 5,
      "reviews.text": "Bought the Fire 8\" tablet for a birthday gift and my grandson loves it. It was a replacement for his old Apple I pad, what a difference. The price was great, super long battery life, and display screen is incredible. He loves it!"
    },
    {
      "reviews.date": "2017-07-07T00:00:00.000Z",
      "reviews.id": "27901557-4e24-4809-a2aa-b515416dd5af",
      "reviews.rating": 5,
      "reviews.text": "replaced am earlier version of kindle. not disappointed at all."
    },
    {
      "reviews.date": "2017-12-01T00:00:00.000Z",
      "reviews.id": "d0788778-bf88-4484-b5a5-ca6b395eac4e",
      "reviews.rating": 5,
      "reviews.text": "Great product for my kids, hours of entertainment!"
    },
    {
      "reviews.date": "2017-12-01T00:00:00.000Z",
      "reviews.id": "8ce88d5f-a30d-48a3-82cb-086ae476885b",
      "reviews.rating": 5,
      "reviews.text": "Just love the looks of the products and the pricing was great."
    },
    {
      "reviews.date": "2018-01-07T00:00:00.000Z",
      "reviews.id": "f00ad776-2879-4011-8fdf-a32f33711063",
      "reviews.rating": 4,
      "reviews.text": "For reading books, downloading apps and having something convenient to travel with, very good bang for your buck!"
    },
    {
      "reviews.date": "2018-01-06T00:00:00.000Z",
      "reviews.id": "b3c90fc6-2d01-4dfa-b464-3288716ed24b",
      "reviews.rating": 5,
      "reviews.text": "This little tablet has fast speed and a long battery life. A great buy for the money."
    },
    {
      "reviews.date": "2017-11-15T00:00:00.000Z",
      "reviews.id": "d06fd6f7-5023-4f10-9127-a0f42acf9de9",
      "reviews.rating": 3,
      "reviews.text": "The HD tablet is just right for a child who is being introduced to the computer word."
    },
    {
      "reviews.date": "2017-12-22T00:00:00.000Z",
      "reviews.id": "9fe9bd7d-d9c4-413d-a3ee-a4aa895853a4",
      "reviews.rating": 5,
      "reviews.text": "Perfect price with great clarity for a tablet without having to pay a lot like an I-Pad."
    },
    {
      "reviews.date": "2018-05-26T00:00:00.000Z",
      "reviews.id": "a3770a5d-7b1a-4fa9-abb4-5b8eb932211b",
      "reviews.rating": 5,
      "reviews.text": "Is an awesome tablet with plenty of features that made for a perfect gift."
    },
    {
      "reviews.date": "2017-12-01T00:00:00.000Z",
      "reviews.id": "4acca05b-a447-4d06-afd3-cad90f43c94b",
      "reviews.rating": 2,
      "reviews.text": "Good for reading but video quality is not so good."
    },
    {
      "reviews.date": "2017-12-15T00:00:00.000Z",
      "reviews.id": "3f2b848e-a1b8-4eb6-a3ca-11114a686c51",
      "reviews.rating": 1,
      "reviews.text": "I don‚Äôt care that you can‚Äôt change the tablet to run like as you wish. It‚Äôs pre installed menu is not something you can change."
    },
    {
      "reviews.date": "2017-07-12T00:00:00.000Z",
      "reviews.id": "98836754-1c39-4d4c-b788-3af115e4e4d3",
      "reviews.rating": 5,
      "reviews.text": "I bought two of these for my kids, and they love them. They are responsive, durable, and inexpensive. Of course, whether it works for you depends on your usage scenario. If you are looking for a full-featured tablet computer to use for content creation, serious research, or other work-related tasks, you should look at an iPad Pro. But if you are looking for a device for games, entertainment, casual reading, and consuming Amazon content, this device works great. If you're looking for something for your kids and don't want to shell out $350 or more for an iPad, I'd strongly recommend checking this Kindle Fire out. We replaced two cracked screen iPads, and my kids haven't missed a beat with these."
    },
    {
      "reviews.date": "2017-12-02T00:00:00.000Z",
      "reviews.id": "06209d85-8d09-4d2f-a34b-7761852a82c1",
      "reviews.rating": 5,
      "reviews.text": "Grandchild is exploring and learning so much, having fun"
    },
    {
      "reviews.date": "2017-12-22T00:00:00.000Z",
      "reviews.id": "c0507c54-aa52-4966-a452-d8eda24e7c93",
      "reviews.rating": 5,
      "reviews.text": "She loves it and will use it for many different ways."
    },
    {
      "reviews.date": "2017-12-08T00:00:00.000Z",
      "reviews.id": "fc3a079f-c4ca-4560-9821-f82358485d7b",
      "reviews.rating": 5,
      "reviews.text": "I love kindle. Best value for money. Replacing my older model with the 8in. Like that it is expandable as I ran out of space on other one."
    },
    {
      "reviews.date": "2017-08-17T00:00:00.000Z",
      "reviews.id": "6d849855-9bd4-49f2-af8e-374b29afd761",
      "reviews.rating": 4,
      "reviews.text": "This was to replace an earlier gen Kindle. That one would just shut down. We have not had any concerns with this and I will say I like the design better."
    },
    {
      "reviews.date": "2018-04-18T00:00:00.000Z",
      "reviews.id": "3516d615-1eca-4200-bcb0-2924f2c13a1d",
      "reviews.rating": 4,
      "reviews.text": "I bought this tablet, so I can watch movies while waiting for my wife when she goes to her doctor, I love the fact that it links up with my Lenovo with no problems.Strong yes to this product"
    },
    {
      "reviews.date": "2018-01-15T00:00:00.000Z",
      "reviews.id": "6b563b85-6f5b-43ed-8d9d-92bee5c49665",
      "reviews.rating": 4,
      "reviews.text": "Worked well as expected. I would recommend this product."
    },
    {
      "reviews.date": "2017-07-07T00:00:00.000Z",
      "reviews.id": "dff43d23-3b1c-4615-a5c9-21e38f61ee2a",
      "reviews.rating": 5,
      "reviews.text": "after downloading the Nook app, I now have both a kindle reader and Nook reader in the same device"
    },
    {
      "reviews.date": "2018-02-02T00:00:00.000Z",
      "reviews.id": "414ceed1-87f3-4ca3-b683-e40c228680a5",
      "reviews.rating": 5,
      "reviews.text": "this item is very conv. for the time to read a good book or just to let the book read to you."
    },
    {
      "reviews.date": "2018-01-05T00:00:00.000Z",
      "reviews.id": "acda76ca-eb12-47ae-aabb-2abb26e11ca7",
      "reviews.rating": 4,
      "reviews.text": "Got this item as a gift, receiver was very happy with it!"
    },
    {
      "reviews.date": "2017-07-19T00:00:00.000Z",
      "reviews.id": "fdd1ba39-e199-41d4-8192-3b84a701fefe",
      "reviews.rating": 4,
      "reviews.text": "I love my amazon fire tablet. It's got great screen resolution and is very easy to use. It works for both adults and kids. I love the books and all the app options."
    },
    {
      "reviews.date": "2018-02-10T00:00:00.000Z",
      "reviews.id": "0d44d1f5-491e-49fc-9380-5b1dc826dcaf",
      "reviews.rating": 4,
      "reviews.text": "The Kindle Fire works well and I enjoy reading on it. I gave it 4 stars instead of 5 because it seems silly to restrict people from reading Nook books on it just because it is a different platform. As a book lover, I like supporting bookstores not only the almighty Amazon. Yes, I know there are ways to get around the restriction. The reason to reduce a point is not based on the excellence of this Kindle, but on politics of sharing."
    },
    {
      "reviews.date": "2017-12-22T00:00:00.000Z",
      "reviews.id": "c9c27a1b-3d2f-4449-9da2-eb6d1404dba9",
      "reviews.rating": 5,
      "reviews.text": "Wow, I love my Amazon Fire HD 16 GB in black. It is just the right size, and works perfectly. Loved it so much, I ordered 2 more for my grandchildren, in Marine Blue and Punch Red. I am totally satisfied!"
    },
    {
      "reviews.date": "2018-02-03T00:00:00.000Z",
      "reviews.id": "e297b388-a02a-46d4-a392-2749bfa2bccc",
      "reviews.rating": 5,
      "reviews.text": "My granddaughter always wanted to use my Kindle to watch netflix movies on or play games. This way she has her own and we each can enjoy."
    }
  ]
}