{
  "id": "AWdDlIX9Hh53nbDRSc-U",
  "dateAdded": "2018-11-24T02:10:04Z",
  "name": "Certified Refurbished Amazon Echo",
  "asins": "B01GAGYVU2",
  "brand": "Amazon",
  "categories": "Consumer Electronics,Amazon Echo,Smart Speakers, Hubs & Accessories,Smart Speakers,Amazon Home,Surveillance & Smart Home Electronics,Digital Device 3",
  "primaryCategories": "Electronics",
  "keys": "certifiedrefurbishedamazonecho/b01gagyvu2,amazon/53005339,841667115337,detailsaboutnewamazonechoshowalexasmarthomecontrolwithvideowhite/273535713254",
  "manufacturer": "Amazon",
  "reviews": [
    {
      "reviews.date": "2017-09-15T00:00:00.000Z",
      "reviews.id": "aabcd6f4-2509-413c-baf4-60dee464b327",
      "reviews.rating": 5,
      "reviews.text": "I find it amusing to ask Alexa simple questions and timers. Not liking the messaging part that doesn't integrate with my iPhone, but it has awesome notifications and does sync with my Google calendar. I feel it was an EXCELLENT purchase."
    },
    {
      "reviews.date": "2017-01-18T00:00:00.000Z",
      "reviews.id": "b731d039-41ea-49fa-b04a-bf5652ebb89b",
      "reviews.rating": 5,
      "reviews.text": "This is my second Echo. The first one I purchased at Home Depot for 139. I knocked it off my nightstand a few times with no damage. The last time it fell, it completely died. So now it's just after Christmas and they are few and far between to purchase one. Amazon has a back order for almost a month for 179 and eBay tries to rape you with prices up to 300. I finally gave in and purchased one for 200. I love the Echo and all the accessories that you can purchase for it. BEWARE, buy a stand or wall mount for your Echo and protect your investment. My mistake the first time. If you have pets, you can count on it being knocked over. There are too many components inside the Echo to be abused. That is all."
    },
    {
      "reviews.date": "2019-02-07T00:00:00.000Z",
      "reviews.id": "a2b76bcb-90e0-46b8-abd8-7a712349df5f",
      "reviews.rating": 5,
      "reviews.text": "Very clear picture on monitor easy to install with mobile phone and quite enjoyable to ask questions Alexa is very informative."
    },
    {
      "reviews.date": "2018-01-16T00:00:00.000Z",
      "reviews.id": "4edd4af9-3425-42ce-a4ca-d97aede31134",
      "reviews.rating": 5,
      "reviews.text": "I ordered the first generation Amazon Echo which wasn't easy to find by the way. I absolutely love it. The sound quality is great! I have it in my living room to play music which I can hear in all of my downstairs rooms. I couldn't be more pleased!"
    },
    {
      "reviews.date": "2018-04-12T00:00:00.000Z",
      "reviews.id": "ee8db58d-f6b8-4ba5-8330-c143c4d3da78",
      "reviews.rating": 5,
      "reviews.text": "Amazon Echo Plus is a fun product it requires time to explore its skills. It copes well with accents, however the Echo have to be placed as center as possible to get the best listening results. It is a great first step towards a smart home but there are more accessories required to connect the house together. If you live outside of US you may find some of the features limited at the moment. Hopefully this will change with time and also more skills will be available for local services."
    },
    {
      "reviews.date": "2018-05-22T00:00:00.000Z",
      "reviews.id": "e148bc43-3c81-4ab6-b9e7-bac8ba77271f",
      "reviews.rating": 5,
      "reviews.text": "Just what I expected...Works great...."
    },
    {
      "reviews.date": "2018-08-16T00:00:00.000Z",
      "reviews.id": "f323516f-eb67-4676-be76-3fac59c441b6",
      "reviews.rating": 5,
      "reviews.text": "Like this version the best. The new version does not give you much of a choice for colors and you can get a skin for the 1st generation version. The speaker is great, fills the room with sound. Replaced an Echo Dot which sucked...wouldn't stay connected to the external speaker, always having to pair it or reconnect it to the internet, etc. Plugged this one in and it worked right away."
    }
  ]
}